{
  "article_number": "103",
  "title": "Publication of name by company.",
  "content": "103.- (1) Every company- (a) shall paint or affix, and keep painted or affixed, its name on the outside of every office or place in which its business is carried on, in a conspicuous position, in letters easily legible; (b) shall have its name engraven in legible characters on its seal; 4(b) of 151(I) of 2000. (c) shall have mentioned in legible characters in all business letters of the company and in all notices and other official publications of the company, and in all bills of exchange, promissory notes, endorsements, cheques and orders for money or goods purporting to be signed by or on behalf of the company, and in all bills of parcels, invoices, receipts and letters of credit of the company; 4(c) of 151(I) of 2000. (i) the name of the company; (ii) the number of registration of the company; (iii) whether it concerns a private or a public company; (iv) the registered office of the company; (v) if in the documents mention is made of the capital of the 97 company, the reference must mention the allotted and paid capital; (vi) if there is good reason, the stage of the liquidation in which the company finds itself. 3(a) of 71(I) of 2007. (1A) In case a company possesses a website, the said website, shall include items (i) to (vi) of paragraph (c) of subsection (1); and 4(d) (i)of 151(I) of 2000 4(d) (ii) of 151(I) of 2000. 4 of 166 of 1987. (2) If a company does not publish its name and does not record in the documents mentioned in paragraph (c) of subsection (1) the data enumerated in subparagraphs (i) – (vi) of paragraph (c) of subsection (1) in manner directed by this Law, the company and every officer thereof who is in default shall be liable to a fine not exceeding two hundred thirteen euros, and if a company does not keep its name painted or affixed in manner so directed, the company and every officer of the company who is in default shall be liable to a default fine. 4 of 166 of 1987. (3) If a company fails to comply with paragraph (b) or paragraph (c) of subsection (1), the company shall be liable to a fine not exceeding four hundred twenty-seven euros. (4) If an officer of a company or any person on its behalf: (a) uses or authorizes the use of any seal purporting to be a seal of the company whereon its name is not so engraved as aforesaid; or (b) issues or authorizes the issue of any business letter of the company or any notice or other official publication of the company, or signs or authorizes to be signed on behalf of the company any bill of exchange, promissory note, endorsement, cheque, or order for money or goods wherein its name is not mentioned in manner aforesaid; or (c) issues or authorizes the issue of any bill of parcels, invoice, receipt or letter of credit of the company wherein its name is not mentioned in manner aforesaid; 4 of 166 of 1987. he shall be liable to a fine not exceeding four hundred twenty-seven euros, and shall further be personally liable to the holder of the bill of exchange, promissory note, cheque or order for money or goods for the amount thereof unless it is duly paid by the company. 3(b) of 71(I) of 2007. (5) In case the website of the company does not include items (i) to (vi) of paragraph (c) of subsection (1), the said company and every officer who is responsible for the omission shall be liable to a fine not exceeding eight hundred fifty - four euros. Restrictions on Commencement of Business Restrictions on commencement of business."
}