{
  "article_number": "104",
  "title": "Restrictions on commencement of business.",
  "content": "104.- (1) Where a company having a share capital has issued a prospectus inviting the public to subscribe for its shares, the company shall not commence any business or exercise any borrowing powers 98 unless- (a) shares held subject to the payment of the whole amount thereof in cash have been allotted to an amount not less in the whole than the minimum subscription; and (b) every director of the company has paid to the company, on each of the shares taken or contracted to be taken by him and for which he is liable to pay in cash, a proportion equal to the proportion payable on application and allotment on the shares offered for public subscription; and (c) there has been delivered to the registrar of companies for registration a statutory declaration by the secretary or one of the directors, in the prescribed from, that the aforesaid conditions have been complied with. (2) Where a company having a share capital has not issued a prospectus inviting the public to subscribe for its shares, the company shall not commence any business or exercise any borrowing powers unless: (a) there has been delivered to the registrar of companies for registration a statement in lieu of prospectus; and (b) every director of the company has paid to the company, on each of the shares taken or contracted to be taken by him and for which he is liable to pay in cash, a proportion equal to the proportion payable on application and allotment on the shares payable in cash; and (c) there has been delivered to the registrar of companies for registration a statutory declaration by the secretary or one of the directors, in the prescribed form, that paragraph (b) of this subsection has been complied with. 24(a) of 70(I) of 2003. (3) (a) A company shall not be entitled to commence business activities, nor undertake loans or related obligations if it has not first been supplied with a certificate from the Registrar which confirms that the nominal value of its subscribed share capital is equal to at least the minimum amount provided for in section 4A. (b)The Registrar shall issue the above certificate, if the company delivers to him- (i) a statutory declaration from which the following is evident- (a) its nominal capital which cannot be lower than that provided in section 4A; (b) the amount of the share capital which has been paid up; (c) a budget of the initial expenses of the company, together with an account of the amount already paid and of the obligations undertaken; 99 (d) a budget of the expenses for services of registration advisors, together with an account of the amount already paid and of the relevant obligations undertaken, (ii) confirmation by a Bank, which has its registered office or its place of business in the Republic, as to the payment of an amount equal to at least the amount provided for in section 4A into an account which the company holds with such Bank. 24(b) of 70(I) of 2003. (4) The registrar of companies shall, on the delivery to him of the said statutory declarations, and, in the case of a company which is required by this section to deliver a statement in lieu of prospectus, of such a statement, certify that the company is entitled to commence business, and that certificate shall be conclusive evidence that the company is so entitled. 24(c) of 70(I) of 2003. (5) Any contract made by a company before the date at which it is entitled to commence business shall be provisional only, and shall not be binding on the company until that date, and on that date it shall become binding. 4 of 166 of 1987. (6) If any company commences business or exercises borrowing powers in contravention of this section, every person who is responsible for the contravention shall, without prejudice to any other liability, be liable to a fine not exceeding four hundred twenty seven euros for every day during which the contravention continues. (7) Nothing in this section shall apply to a private company. Register of Members Register of members."
}