{
  "article_number": "115",
  "title": "Overseas register.",
  "content": "115.- (1) An overseas register shall be deemed to be part of the company’s register of members , which in this section is called ‘the principal register”. (2) The overseas register shall be kept in the same manner, in which the principal register should be kept under the Law, with the exception that- 104 (a) the relevant advertisement, before the closure of the register, shall be inserted in a newspaper circulating in the district where the overseas register is kept, (b) any competent court at the location abroad where the register is kept, may exercise the same power to rectify the register, as it is exercised by the court pursuant to this Law, and (c) the offences of refusing inspection or providing copies of the overseas register and of authorizing or permitting such refusal may be prosecuted summarily before any court at that location, abroad. (3) Each company which keeps an overseas register- (a) shall send, to its registered office, a copy of each entry in the overseas register, immediately after the making of the entry; and (b) shall ensure that a copy of its overseas register is kept in the place where the principal register of the company is kept, and that it is from time to time duly updated and every such copy, for all purposes of this Law, shall be deemed to be part of the principal register. (4) Subject to the provisions of this section in relation to the copy of the register, the shares registered in the overseas register shall be distinguished from the shares registered in the principal register, and no action in relation to any shares registered in an overseas register shall during the continuation of that registration be registered in any other register. (5) A company may terminate the keeping of an overseas register, and immediately all entries in such register shall be transferred to another overseas register which is kept by the company at the same place abroad or in the principal register. (6) Subject to the provisions of this Law, any company may include such provisions in its articles as it may think fit in relation to the keeping of overseas registers. (7) If a company fails to comply with the provisions of subsection (3), the company as well as every one of its officers shall commit an offence and shall on conviction be liable to a default fine and, where by virtue of proviso (b) to subsection (2) of section 105, the principal register is kept at the office of a person other than the company and by reason of any default of his the company fails to comply with paragraph (b) of subsection (3) such person shall be liable to the same penalty as if he were an officer of the company who was in default. Transfer of shares registered in the overseas register. 14 of 99(I) of"
}