{
  "article_number": "118",
  "title": "Annual return to be made by company having a share capital.",
  "content": "118.- (1) Every company having a share capital shall, once at least in every year, make a return containing with respect to the registered office of the company, registers of members and debenture holders, shares and debentures, indebtedness, past and present members and directors and secretary, the matters specified in Part I of the Sixth Schedule, and the said return shall be in the form set out in Part II of that Schedule or as near thereto as circumstances admit: Provided that:- (a) a company need not make a return under this subsection either in the year of its incorporation or, if it is not required by section 125 to hold an annual general meeting during the following year, in that year; Sixth Schedule Part I. (b) where the company has converted any of its shares into stock and given notice of the conversion to the registrar of companies, the list referred to in paragraph 5 of Part I on the said Sixth Schedule must state the amount of stock held by each of the existing members instead of the amount of shares and the particulars relating to shares required by that paragraph; and (c) the return may, in any year, if the return for either of the two immediately preceding years has given, as at the date of that return, the full particulars required by the said paragraph 5, given only such of the particulars required by that paragraph as relate to persons ceasing to be or becoming members since the date of the last return and to shares transferred since that date or to changes as compared with that date in 106 the amount of stock held by a member. 18 of 99(I) of 2009. (2) In the case of a company keeping an overseas register- (a) references in proviso (c) to subsection (1) to the particulars required by the said paragraph 5 shall be taken as not including any such particulars contained in the overseas register, in so far as copies of the entries containing those particulars are not received at the registered office of the company before the date when the return in question is made; and 16 of 99(I) of 2009. (b) where an annual return is made between the date when any entries are made in the overseas register and the date when copies of those entries are received at the registered office of the company, the particulars contained in those entries, so far as relevant to an annual return, shall be included in the next or a subsequent annual return as may be appropriate having regard to the particulars included in that return with respect to the company's register of members. (3) If a company fails to comply with this section, the company and every officer of the company who is in default shall be liable to a default fine. (4) For the purposes of this section and of Part I of the Sixth Schedule, the expressions \"director\" and \"officer\" shall include any person in accordance with whose directions or instructions the directors of the company are accustomed to act. Annual return to be made by company not having a share capital."
}