{
  "article_number": "119",
  "title": "Annual return to be made by company not having a share capital.",
  "content": "119.- (1) Every company not having a share capital shall, once at least in every calendar year, make a return stating- (a) the address of the registered office of the company; (b) in a case in which the register of members is, under the provisions of this Law, kept elsewhere than at that office, the address of the place where it is kept; (c) in a case in which any register of holders of debentures of the company is, under the provisions of this Law, kept elsewhere than at the registered office of the company, the address of the place where it is kept; (d) all such particulars with respect to the persons who at the date of the return are the directors of the company and any person who at that date is secretary of the company as are by this Law required to be contained with respect to directors and the secretary respectively in the register of directors and secretaries of a company: Provided that a company need not make a return under this subsection either in the year of its incorporation or, if it is not required by section 125 to hold an annual general meeting during the following year, in that year. (2) There shall be annexed to the return a statement containing 107 particulars of the total amount of the indebtedness of the company in respect of all charges and mortgages which are required to be registered or recorded with the registrar of companies under this Law or which would have been required so to be registered if created after the 1st day of July, 1922. (3) If a company fails to comply with this section, the company and every officer of the company who is in default shall be liable to a default fine. (4) For the purposes of this section the expressions “officer” and \"director\" shall include any person in accordance with whose directions or instructions the directors of the company are accustomed to act. Time for completion of annual return."
}