{
  "article_number": "124",
  "title": "Statutory meeting and statutory report.",
  "content": "124.- (1) Every company limited by shares and every company limited by guarantee and having a share capital shall, within a period of not less than one month nor more than three months from the date at which the company is entitled to commence business, hold a general meeting of the members of the company, which shall be called the \"statutory meeting\". (2) The directors shall, at least fourteen days before the day on which the meeting is held, forward a report (in this Law referred to as the \"statutory report\") to every member of the company: Provided that if the statutory report is forwarded later than is required by this subsection, it shall, notwithstanding that fact, be deemed to have been duly forwarded if it is so agreed by all the members entitled to attend and vote at the meeting. (3) The statutory report shall be certified by not less than two directors of the company and shall state- (a) the total number of shares allotted, distinguishing shares allotted as fully paid or partly paid up otherwise than in cash, and stating in the case of shares partly paid up the extent to which they are so paid up, 109 and in either case the consideration for which they have been allotted; (b) the total amount of cash received by the company in respect of all the shares allotted, distinguished as aforesaid; (c) an abstract of the receipts of the company and of the payments made thereout, up to a date within seven days of the date of the report, exhibiting under distinctive headings the receipts of the company from shares and debentures and other sources, the payments made thereout, and particulars concerning the balance remaining in hand, and an account or estimate of the preliminary expenses of the company; (d) the names, addresses, and descriptions of the directors, auditors, if any, managers, if any, and secretary of the company; and (e) the particulars of any contract the modification of which is to be submitted to the meeting for its approval, together with the particulars of the modification or proposed modification. (4) The statutory report shall, so far as it relates to the shares allotted by the company, and to the cash received in respect of such shares, and to the receipts and payments of the company on capital account, be certified as correct by the auditors, if any, of the company. (5) The directors shall cause a copy of the statutory report, certified as required by this section, to be delivered to the registrar of companies for registration forthwith after the sending thereof to the members of the company. (6) The directors shall cause a list showing the names, descriptions and addresses of the members of the company, and the number of shares held by them respectively, to be produced at the commencement of the meeting and to remain open and accessible to any member of the company during the continuance of the meeting. (7) The members of the company present at the meeting shall be at liberty to discuss any matter relating to the formation of the company, or arising out of the statutory report, whether previous notice has been given or not, but no resolution of which notice has not been given in accordance with the articles may be passed. (8) The meeting may adjourn from time to time, and at any adjourned meeting any resolution of which notice has been given in accordance with the articles, either before or subsequently to the former meeting, may be passed, and the adjourned meeting shall have the same powers as an original meeting. 4 of 166 of 1987. (9) In the event of any default in complying with the provisions of this section, every director of the company who is knowingly and wilfully guilty of the default, or, in the case of default by the company, every officer of the company who is in default shall be liable to a fine not exceeding four 110 hundred twenty-seven euros. (10) This section shall not apply to a private company. Annual general meeting."
}