{
  "article_number": "125",
  "title": "Annual general meeting.",
  "content": "125.- (1) Every company shall in each year hold a general meeting as its annual general meeting in addition to any other meetings in that year, and shall specify the meeting as such in the notices calling it; and not more than fifteen months shall elapse between the date of one annual general meeting of a company and that of the next: Provided that, so long as a company holds its first annual general meeting within eighteen months of its incorporation, it need not hold it in the year of its incorporation or in the following year. (2) If default is made in holding a meeting of the company in accordance with subsection (1), the Council of Ministers may, on the application of any member of the company, direct the calling of a general meeting of the company, and give such ancillary or consequential directions as the Council of Ministers thinks expedient, including the directions modifying or supplementing, in relation to the calling, holding and conducting of the meeting, the operation of the company's articles; and it is hereby declared that the directions that may be given under this subsection include a direction that one member of the company present in person or by proxy shall be deemed to constitute a meeting. (3) A general meeting held in pursuance of subsection (2) shall, subject to any directions of the Council of Ministers, be deemed to be an annual general meeting of the company; but, where a meeting so held is not held in the year in which the default in holding the company's annual general meeting occurred, the meeting so held shall not be treated as the annual general meeting for the year in which it is held unless at that meeting the company resolves that it shall be so treated. (4) Where a company resolves that a meeting shall be so treated, a copy of the resolutions shall, within fifteen days after the passing thereof, be forwarded to the registrar of companies and recorded by him. 4 of 166 of 1987. 4 of 166 of 1987. (5) If default is made in holding a meeting of the company in accordance with subsection (1), or in complying with any of the directions of the Council of Ministers under subsection (2), the company and every officer of the company who is in default shall be liable to a fine not exceeding four hundred twenty seven euros, and if default is made in complying with subsection (4), the company and every officer of the company who is in default shall be liable to a default fine of forty-two euros. Convening of extraordinary general meeting on requisition."
}