{
  "article_number": "126",
  "title": "Convening of extraordinary general meeting on requisition.",
  "content": "126.- (1) The directors of a company, notwithstanding anything in its articles, shall, upon the requisition of members of the company holding at the date of the deposit of the requisition not less than one tenth of such of the paid up capital of the company as at the date of the deposit carries the right of voting at general meetings of the company or, in the case of a company not having a share capital, members of the company representing not less than one tenth of the total voting rights of all the 111 3 of 60(I) of 2010. members having at the said date a right to vote at general meetings of the company, forthwith proceed duly to convene an extraordinary general meeting of the company. (1A) Notwithstanding the provisions of subsection (1), or anything contained in its articles, the directors of a listed company in a regulated market, shall, on the requisition of members of the company who on the date of the deposit of the requisition hold not less than one twentieth of the paid up capital of the company which at the date of the deposit confers voting rights at general meetings of the company, forthwith proceed duly to convene an extraordinary general meeting of the company. (2) The requisition must state the objects of the meeting, and must be signed by the requisitionists and deposited at the registered office of the company, and may consist of several documents in like form each signed by one or more requisitionists. (3) If the directors do not, within twenty-one days from the date of the deposit of the requisition proceed duly to convene a meeting, the requisitionists, or any of them representing more than one half of the total voting rights of all of them, may themselves convene a meeting, but any meeting so convened shall not be held after the expiration of three months from the said date. (4) A meeting convened under this section by the requisitionists shall be convened in the same manner, as nearly as possible, as that in which meetings are to be convened by directors. (5) Any reasonable expenses incurred by the requisitionists by reason of the failure of the directors duly to convene a meeting shall be repaid to the requisitionists by the company, and any sum so repaid shall be retained by the company out of any sums due or to become due from the company by way of fees or other remuneration in respect of their services to such of the directors as were in default. (6) For the purposes of this section the directors shall, in the case of a meeting at which a resolution is to be proposed as a special resolution, be deemed not to have duly convened the meeting if they do not give such notice thereof as is required by section 135. Equal treatment of shareholders. 4 of 60(I) of 2010."
}