{
  "article_number": "127",
  "title": "Length of notice for calling meetings.",
  "content": "127.- (1) Any provision of a company's articles shall be void in so far as it provides for the calling of a meeting of the company, other than an adjourned meeting, by a shorter notice than- 5 (1) of 60(I) of 2010. (a) in the case of the annual general meeting, twenty-one days’ notice in writing; 112 5(2) of 60(I) of 2010. 5 (3) of 60(I) of 2010. 41 (I) of 2007 47 (I) of 2009. (b) in the case of a meeting other than an annual general meeting or a meeting for the passing of a special resolution, fourteen days’ notice in writing; and (c) without prejudice to subsection (4) of section 35 of the Public Takeover Bids Laws and of the corresponding provisions of other member states that were enacted in order to comply with articles 9(4) and 11(4) of Directive 2004/25/EC in the case of a company listed in a regulated market: (i) in the case of an annual general meeting, twenty-one days’ of written notice; and (ii) in the case of a general meeting (other than an annual general meeting or a meeting for the approval of a special resolution) fourteen days of written notice where- (a) the company listed in a regulated market offers technical facilitation to its members in order to vote through electronic means, which is accessible to all members holding shares carrying voting rights at general meetings; and (b) a special resolution, that shortens the notice period to fourteen days, has been approved in the immediately preceding annual general meeting, or at a general meeting that was conducted after that meeting. (2) Save in so far as the articles of a company make other provision in that behalf, not being a provision avoided by subsection (1), a meeting of the company, other than an adjourned meeting, may be called: (a) in the case of the annual general meeting, by twenty-one days’ notice in writing; and 5 (4) of 60(I) of 2010. (b) in the case of a meeting other than an annual general meeting or a meeting for the passing of a special resolution, by fourteen days' notice in writing. (c) Without prejudice to subsection (4) of section 35 of the Public Takeover Bids Laws in the case of a company listed in a regulated market: (i) in the case of an annual general meeting, twenty-one days of written notice; and (ii) in the case of a general meeting (other than an annual general meeting or a meeting for the approval of a special resolution) fourteen days of written notice where:- (a) the company listed in a regulated market offers technical facilitation to its members in order to vote through electronic 113 means, which is accessible to all members holding shares carrying voting rights at general meetings; and (b) a special resolution, that shortens the notice period to fourteen days, has been approved in the immediately preceding annual general meeting, or at a general meeting that was conducted after that meeting. 5 (5) of 60(I) of 2010. (3) A meeting of a company other than a company listed in a regulated market shall, notwithstanding that it is called by shorter notice than that specified in subsection (2) or in the company's articles, as the case may be, be deemed to have been duly called if it is so agreed: (a) in the case of a meeting called as the annual general meeting, by all the members entitled to attend and vote thereat; and (b) in the case of any other meeting, by a majority in number of the members having a right to attend and vote at the meeting, being a majority together holding not less than ninety-five per cent in nominal value of the shares giving a right to attend and vote at the meeting, or, in the case of a company not having a share capital, together representing not less than ninety-five per cent of the total voting rights at that meeting of all the members. Information prior to the general meeting. 6 of 60(I) of 2010."
}