{
  "article_number": "127A",
  "title": "Information prior to the general meeting",
  "content": "127A.- (1) Notwithstanding the provisions of section 10 or anything contained in its articles, the following provisions shall apply with regard to a company listed in a regulated market. (2) A notice for the calling of a general meeting shall be issued, free of charge, in a manner ensuring fast access to it on a non-discriminatory basis, using such media as may reasonably be relied upon for the effective dissemination of information to the public throughout the member states. (3)The notice for the calling of the general meeting pursuant to paragraph (c) of subsection (1) and paragraph (c) of subsection (2) of section 133 shall indicate: (a) when and where the general meeting is to take place and the proposed agenda for the general meeting; (b) a clear and precise description of any procedures that shareholders must comply with in order to be able to participate and to vote in the meeting, including- (i) the right of the member to add items on the agenda of the general meeting, to table draft resolutions pursuant to section 127B and to ask questions related to items on the agenda of the general meeting pursuant to section 128C and the deadlines by which those rights may be exercised; (ii) the right of a member who is entitled to participate, to speak, 114 ask questions and vote, to appoint a proxy pursuant to section 130, including a proxy who is not a member, through electronic means or otherwise or, where permitted, to appoint one or more proxies, each one in order for them to participate, speak, ask questions and vote in the member’s place; (iii) the right to ask questions and the obligation to answer are subject to the measures that may be taken by the Republic or are allowed to be taken by companies, in order to ensure the identification of shareholders, the good order of general meetings and their preparation and the protection of confidentiality and business interests of companies listed in a regulated market. Companies listed in a regulated market may provide one overall answer to questions having the same content. Companies listed in a regulated market shall be deemed to have given an answer if the relevant information is already available on the website of a company listed in a regulated market in a question and answer format; (iv) the procedure for voting by proxy pursuant to section 130, including the forms to be used and the means by which the company listed in a regulated market is prepared to accept electronic notification of the appointment of the proxy; (v) where applicable, the procedure that will be followed pursuant to sections 128B and 132 for electronic voting or voting by correspondence, respectively ; (c) the record date which will state that only those who are members on the record date shall have the right to participate and vote in the general meeting; (d) where and how the full and complete text of the documents and draft resolutions referred to in paragraphs (c) and (d) of subsection (4) may be obtained; and (e) the address of the website on which the information referred to in subsection (4) will be made available. (4) A company listed in a regulated market shall make available to its members on its website, for a continuous period beginning not later than the twenty-first day before the day of the general meeting, including the day of the meeting, the following- (a) the notice pursuant to subsection (2) of section 127A; (b) the total number of shares and voting rights at the date of the notice; (c) the documents to be submitted to the general meeting; (d) copies of the draft resolutions or where no resolution is proposed to be adopted, comments from the directors for each item on the 115 Right to put items on the agenda of the general meeting and to table draft resolutions. 6 of 60(I) of 2010. proposed agenda of the general meeting; (e) copies of the forms to be used by a proxy to vote and copies of the forms to be used to vote by correspondence, unless these forms have been sent directly to each member. (5) The company listed in a regulated market shall make available, on its website the draft resolutions tabled by members as soon as practicable after it has received same. (6) Where the forms referred to in paragraph (e) of subsection (4) cannot, for technical reasons, be made available on the website of the company listed in a regulated market, the company listed in a regulated market shall indicate on its website that the forms can be obtained on paper, and the company listed in a regulated market shall be required to send the forms by post and free of charge to every member who so requests. (7) Where the notice of the general meeting is issued later than the twenty-first day before the meeting pursuant to subparagraph (ii), of paragraph (c), of subsection (1) of section 127 or of subparagraph (ii), of paragraph (c), of subsection (2) of section 127 or of subsection (4) of section 35 of the Public Takeover Bids Laws, the period specified in subsection (4) shall be shortened accordingly."
}