{
  "article_number": "128",
  "title": "General provisions as to meetings and votes.",
  "content": "128.- (1) Subject to the provisions of subsection (2) the following provisions shall have effect in so far as the articles of the company do not make other provision in that behalf:- (a) notice of the meeting of a company shall be served on every member of the company in the manner in which notices are required to be served by Table A, and for the purpose of this paragraph the expression \"Table A\" means that Table as for the time being in force: Provided that, notice for the calling of a meeting of a public company listed on the Cyprus Stock Exchange, may be done by an announcement by the company on its website and in that case by publication also in the daily press: Provided further that, for any further related explanation or information, the publication in the daily press may direct the shareholders of the company to the company itself or to its website; (b) two or more members holding not less than one tenth of the issued share capital, or, if the company has not a share capital, not less than five per cent in number of the members of the company may call a meeting; 6(c) of 2(I) of 2000. (c) in the case of a private company with more than one members, and in the case of any other company three members, personally present shall be a quorum; (d) any member elected by the members present at a meeting may be chairman thereof; (e) in the case of a company originally having a share capital, every member shall have one vote in respect of each share or each seventeen euros of stock held by him, and in any other case every member shall have one vote. 6(d) of 2(I) of (2) In the case of a private company with one and only member, the 117 2000. Requirements for participation and voting in the general meeting. 7 of 60(I) of 2010. Participation in the general meeting by electronic means. 7 of 60(I) of 2010. member shall exercise all the powers of the general meeting, pursuant to this Law, provided always that the decisions taken by the member in general meeting shall be minuted or made in writing."
}