{
  "article_number": "130",
  "title": "Proxies.",
  "content": "130.- (1) Any member of a company entitled to attend and vote at a meeting of the company shall be entitled to appoint another person, whether a member or not, as his proxy to attend and vote instead of him, and a proxy appointed to attend and vote instead of a member of a private company shall also have the same right as the member to speak at the meeting: Provided that, unless the articles otherwise provide- (a) this subsection shall not apply in the case of a company not having a share capital; and (b) a member of a private company shall not be entitled to appoint more than one proxy to attend on the same occasion; and (c) a proxy shall not be entitled to vote except on a poll. 8 (1)of 60(I) of 2010. (1A) (a) The provisions of this subsection shall apply to a company listed in a regulated market. (b) The appointed proxy may be either a natural or a legal person (whether a member or not) and shall act in accordance with the instructions issued by the appointing member. (c) The proxy shall be appointed by written notice to the company listed in a regulated market or by electronic means. (d) A member shall be permitted to:- (i) appoint a proxy by electronic means, at the address designated by the company listed in a regulated market; (ii) to have its notification of the appointment by electronic means accepted by the company listed in a regulated market; (iii) be offered at least one effective method of notification by electronic means, by the company listed in a regulated market. (e) The appointment of a proxy and the notification of the appointment of a proxy to the company listed in a regulated market and the issuance of instructions to a proxy to vote may only be subject to such formal conditions as are necessary to ensure the identity of the member or of the proxy or the possibility of verifying the content of the relevant voting instructions, if any, and only to the extent that those conditions are proportionate to achieving those objectives. (2) In every notice calling a meeting of a company having a share capital there shall appear with reasonable prominence a statement that a 120 4 of 166 of 1987. 8 (2)of 60(I) of 2010. member entitled to attend and vote is entitled to appoint a proxy, or, where that is allowed, one or more proxies to attend and vote instead of him, and that a proxy need not also be a member; and if default is made in complying with this subsection as respects any meeting, every officer of the company who is in default shall be liable to a fine not exceeding four hundred twenty-seven euros. (2A) Notwithstanding the provisions of subsection (2) or anything contained in its articles, in the case of a company listed in a regulated market- (a) no limitation may be imposed on the rights of a member to appoint more than one proxy to be present and vote at a general meeting as regards shares held in different securities accounts; and (b) subject to the provisions of paragraph (a), a member shall not be allowed to appoint more than one proxy to attend and vote at the same meeting, provided however that a member acting as an intermediary on behalf of a client shall not be prevented from appointing each one of his clients or any other third person indicated by the client as proxy. (3) Any provision contained in the articles of a company listed in a regulated market shall be void in so far as it would have the effect of requiring the instrument appointing a proxy, or any other document necessary to show the validity of or otherwise relating to the appointment of a proxy, to be received by the company or any other person more than forty-eight hours before a meeting or adjourned meeting in order that the appointment may be effective thereat. 4 of 166 of 1987. (4) If for the purpose of any meeting of a company invitations to appoint as proxy a person or one of a number of persons specified in the invitations are issued at the company's expense to some only of the members entitled to be sent a notice of the meeting and to vote thereat by proxy, every officer of the company who knowingly and wilfully authorizes or permits their issue as aforesaid shall be liable to a fine not exceeding eight hundred fifty four euros: 8(3) of 60(I) of 2010. Provided that an officer shall not be liable under this subsection by reason only of the issue to a member at his request in writing of a form of appointment naming the proxy or of a list of persons willing to act as proxy if the form or list is available on request in writing to every member entitled to vote at the meeting by proxy. (4A) Any provision contained in the articles of a company listed in a regulated market, apart from the condition that the person to be appointed as proxy holder possess legal capacity, shall be void to the degree that it affects the eligibility of a person to be appointed as a proxy. (5) This section shall apply to meetings of any class of members of a company as it applies to general meetings of the company. 121 Right to demand a poll."
}