{
  "article_number": "135",
  "title": "Extraordinary and special resolutions.",
  "content": "135.-(1) A resolution shall be an extraordinary resolution when it has been passed by a majority of not less than three-fourths of such members as, being entitled so to do, vote in person or, where proxies are allowed, by proxy, at a general meeting of which notice specifying the intention to propose the resolution as an extraordinary resolution has been duly given. (2) A resolution shall be a special resolution when it has been passed by such a majority as is required for the passing of an extraordinary resolution and at a general meeting of which not less than twenty-one days' notice, specifying the intention to propose the resolution as a special resolution, has been duly given: Provided that, if it is so agreed by a majority in number of the members having the right to attend and vote at any such meeting, being a majority together holding not less than ninety-five per cent in nominal value of the shares giving that right, or, in the case of a company not having a share capital, together representing not less than ninety-five per cent of the total voting rights at that meeting of all the members, a resolution may be proposed and passed as a special resolution at a meeting of which less than twenty-one days' notice has been given. (3) At any meeting at which an extraordinary resolution or a special resolution is submitted to be passed, a declaration of the chairman that the resolution is carried shall, unless a poll is demanded, be conclusive evidence of the fact without proof of the number or proportion of the votes recorded in favour of or against the resolution. (4) In computing the majority on a poll demanded on the question that an extraordinary resolution or a special resolution be passed, reference shall be had to the number of votes cast for and against the resolution. (5) For the purposes of this section, notice of a meeting shall be deemed to be duly given and the meeting to be duly held when the notice is given and the meeting held in manner provided by this Law or the articles. Resolutions requiring special notice."
}