{
  "article_number": "137",
  "title": "Registration and copies of certain resolutions and agreements.",
  "content": "137.- (1) A printed copy of every resolution or agreement to which this section applies shall, within fifteen days after the passing or making thereof, be forwarded to the registrar of companies and recorded by him: Provided that an exempt private company need not forward a printed copy of any such resolution or agreement if instead it forwards to the registrar of companies a copy in some other form approved by him. (2) Where articles have been registered, a copy of every such resolution or agreement for the time being in force shall be embodied in or annexed to every copy of the articles issued after the passing of the resolution or the making of the agreement. (3) Where articles have not been registered, a printed copy of every such resolution or agreement shall be forwarded to any member at his request on payment of 0,0854 euros or such less sum as the company may direct. (4) This section shall apply to- (a) special resolutions; (b) extraordinary resolutions; (c) resolutions which have been agreed to by all the members of a company, but which, if not so agreed to, would not have been effective for their purpose unless, as the case may be, they had been passed as special resolutions or as extraordinary resolutions; (d) resolutions or agreements which have been agreed to by all the members of some class of shareholders but which, if not so agreed to, would not have been effective for their purpose unless they had been passed by some particular majority or otherwise in some particular manner, and all resolutions or agreements which effectively bind all the members of any class of shareholders though not agreed to by all those members; (e) resolutions requiring a company to be wound up voluntarily, passed 126 under paragraph (a) of subsection (1) of section 261. 4 of 166 of 1987. (5) If a company fails to comply with subsection (1), the company and every officer of the company who is in default shall be liable to a default fine of forty-two euros. 4 of 166 of 1987. (6) If a company fails to comply with subsection (2) or subsection (3) of this section, the company and every officer of the company who is in default shall be liable to a fine not exceeding forty-two euros for each copy in respect of which default is made. (7) For the purposes of subsections (5) and (6), a liquidator of the company shall be deemed to be an officer of the company. Resolutions passed at adjourned meetings."
}