{
  "article_number": "141",
  "title": "Keeping of books of account.",
  "content": "141.- (1) The directors shall cause to be kept books of account and records, which are considered necessary for the preparation of financial statements, in accordance with this Law and which shall correctly explain all the transactions and enable the determination of the financial position of the company with reasonable accuracy at any given time and include supporting documents (including contracts and invoices), which shall disclose: (a) all sums of money received and expended by the company as well as the matters in respect of which the respective receipt and respective expenditure takes place; (b) all sales and purchases and any transactions; (c) the assets and liabilities of the company. (2) For the purposes of subsection (1), proper books of account and records shall not be deemed to be kept, if the books and records which are kept are not sufficient for the presentation of an accurate and fair picture of the affairs of the company as well as an explanation as to its transactions. (3) The books of account and records shall be kept at the registered office of the company or at such other place as the directors think fit, for a period of six (6) years after the end of the calendar year to which these refer to, and shall at all times be open to inspection by the directors: Provided that if books of account and records are kept at a place outside the Republic, there shall be sent to, and kept at a place in, the Republic and be at all times open to inspection by the directors such accounts and returns with respect to the business dealt with in the books of account and records so kept as will disclose with reasonable accuracy the financial position of that business at intervals not exceeding six (6) months and will enable to be prepared in accordance with the present Law, the company's balance sheet, its profit and loss account or income and expenditure account, and any document annexed to any of those documents giving information which is required by this present Law and is thereby allowed to be so given. 6(b) of 167(I) of 2003. (4) If a director of a company fails to take all reasonable steps to secure compliance with the provisions of this section, he shall commit a criminal offence and on conviction thereof be liable to imprisonment not exceeding one year or to a fine not exceeding one thousand, seven hundred and eight euros or to both such imprisonment and fine: 6(c) of 167(I) of 2003. Provided that in any proceedings against a person in respect of an offence under this section consisting of a failure to take reasonable 129 steps to secure compliance by the company with the requirements of this section, it shall be a defence to prove that he had reasonable ground to believe and did believe that a competent and reliable person was charged with the duty of seeing that those requirements were complied with and was in a position to discharge that duty. Annual and consolidated financial statements. 7 of 167(I) of 2003. 2 of 157(I) of 2011."
}