{
  "article_number": "142",
  "title": "Annual and consolidated financial statements.",
  "content": "142.- (1) (a) The directors shall cause to be made, for every company, a complete set of financial statements, as this set is prescribed by the International Accounting Standards. (b) Without prejudice to the provisions of section 142A, each company which has subsidiaries, shall consolidate its financial statements with the financial statements of its subsidiaries as prescribed by the International Accounting Standards, and the said consolidated financial statements shall be presented before the general meeting of the parent company. (c) In addition to the information requirements imposed by the International Accounting Standards, in the financial statements, and, preferably in the notes thereto, information shall also be presented in relation to: (i) the data required by sections 183 to 189; 3 of 41 (I) of 2009. (ii) the fees of the auditors, as well as any expenditures incurred in relation to their expenses. The total fees charged during the financial year by the auditor or the audit firm for carrying out the statutory audit of annual and consolidated accounts, the total fees charged for other assurance services, the total fees charged for tax advisory services and the total fees charged for other non-audit services shall be separately presented . 3 of 131(I) of 2007. (d) Small sized groups shall be exempt from the obligation to prepare consolidated financial statements, referred to in paragraph (b) of this subsection. 3 of 131(I) of 2007. (e) For the purposes of this subsection, the term ‘small sized group’ means a group of companies, of which the companies subject to consolidation– (i) are not public; (ii) the preparation of their consolidated financial statements is not governed by any other legislation; and (iii) they satisfy, in their entirety, at the date of closing of the balance sheet of the parent company, two of the following three criteria: 2 (a)(i) of 88(I) of 2010. (aa) The total of the assets appearing in the balance sheet (and without deducting the liabilities) does not exceed the amount of 17.500.000 (seventeen million five hundred thousand) Euros; 2 (a)(ii)of 88(I) of 2010. (bb) The net level of the turnover does not exceed the amount of 35.000.000 (thirty five million) Euros, and 130 (cc) The average number of employees at the relevant period does not exceed two hundred fifty. 3 of 131(I) of 2007. (f) Groups of companies of which the ultimate subsidiary or parent companies publish consolidated financial statements on the basis of Generally Recognized Accounting Principles shall be exempt from the obligation to prepare consolidated financial statements. (2) (a) Financial statements shall be presented at the latest eighteen months after the incorporation of the company and subsequently once at least in every calendar year. (b) In case the dates of preparation of the financial statements of the parent company and the subsidiary or subsidiaries, do not correspond, the adjustments set out in the International Accounting Standards must be made. (c) The preparation and presentation of periodical statements shall be permitted, provided that all the relevant provisions of the International Accounting Standards are complied with. (3) In the preparation of the financial statements- (a) In the “reserve” the amounts which have been written off or been reserved for write off or for the creation of predictions shall not be included. Provided that in the case where any amount is reserved as a write off or prediction and it is proven later (in the opinion of the directors) that such amount is greater than what is reasonably required for such purpose, this excess amount shall be considered to be the reserve. (b) in the “capital reserve” no amount which was considered as available for distribution is included; (c) every reserve except for the capital reserve shall be considered to be “income reserve”; (d) reference to “prediction” is made giving the term the meaning given to it by the International Accounting Standards. 2 (b)of 88(I) of 2010. (4) (a) The directors of every company shall have a collective duty towards it to ensure that the annual financial statements and, as the case may be, the annual consolidated financial statements shall be prepared and published in accordance with the requirements of this Law and in accordance with the International Accounting Standards. (b) Without prejudice to the collective civil liability of directors towards the company which exists in case of breach of the duty referred to in paragraph (a), if a director of a company fails to take all reasonable steps to comply with the duty referred to in paragraph (a), shall commit 131 an offence and shall be subject, on conviction, to imprisonment not exceeding one year or to a fine not exceeding one thousand and seven hundred euros or to both such penalties: Provided that, subject to the provisions of any other special law, in any proceedings against a person in respect of an offence provided for in this paragraph, it shall be a defence to prove that such person had reasonable ground to believe and did believe that a competent and reliable person, who was charged with the duty of seeing that the provisions of paragraph (a), were complied with, was in a position to discharge that duty. Exemptions relating to the keeping of consolidated financial statements."
}