{
  "article_number": "151",
  "title": "Directors’ report.",
  "content": "151.-(1)(a) There shall be attached to the financial statements a report by the directors in relation to the status and the foreseeable development of the affairs of the company or the group. (b)The directors’ report shall provide information in relation to, at least, the following:- (i) any change during the financial year in the nature of the business of the company or in its subsidiaries or in the classes of business in which the company has an interest, whether as a member of another company or otherwise, and especially in any takeover or merger which has been realized or intended, whether active or passive; (ii) any change to the share capital; (iii) any significant change to the structure, the allocation of responsibilities, or the compensation of the board of directors; (iv) any activities in the area of research and development to the extent that the relevant data do not already arise from the financial statements; 4(a) of 130(I) of 2005. (v) any important event that occurred after the expiry of usage; (vi) the foreseeable development of the company, (vii) the existence of branches of the company; (viii) a fair review of the development and progress of the activities of the company and its position, as well a description of the main risks and uncertainties it is facing; 4(b) of 130(I) of 2005. (bΑ) The review mentioned in subparagraph (viii) of paragraph (b) shall give a balanced and comprehensive analysis of the development and progress of the activities of the company and its position, which shall be proportionate to the size and complexity of its activities. 4 (b) of 130 (I) of 2005. (bΒ) (i) To the extent necessary for an understanding of the company’s development, progress or position, the analysis mentioned in paragraph (bΑ) above, shall include financial and economic, as well as, where appropriate, non financial and economic basic indications of progression related to the specific field of activities, including information relating to environmental and employee matters; 136 (ii) In providing its analysis the annual report shall, where appropriate, include references to and additional explanations of amounts reported in the annual accounts. 4(b) of 130(I) of 2005. (bC) Small sized private companies, as defined in subsection (2) of section 152A, the securities of which are not admitted for negotiation to a regulated market of a member state and which are not obliged pursuant to this Law to submit consolidated financial statements, shall be exempted from the obligation provided in paragraph (bΒ) above concerning the analysis of non-financial and economic information. (c) In every case, the directors’ report shall be accompanied by a reasoned recommendation in relation to the distribution of profits, the absorption of losses and the creation of predictions. 3 (a) of 88(I) of 2010. (d) Repealed. (2) (a) When the directors’ report is published in whole, it shall be published in the form in which it accompanied the financial statements which were published by the auditor, and shall be accompanied by the complete text of the report of the auditor. In every case, there must be presented all the observations, reservations and refusals to express an opinion, which may have been expressed by the auditor. (b) When the directors’ report is published in a piecemeal manner, it shall not be accompanied by the complete report of the auditor, but only by the observations, reservations and refusals to express his opinion. (c) The issuance, circulation or publication of any copy of the directors’ report without the provisions of this subsection being complied with shall constitute a criminal offence and the company and every officer of the company who is in default shall, on conviction, be subject to a fine not exceeding eight hundred fifty-four euros. 3(b) of 88(I) of 2010. 190 (I)of 2007 77(I) of 2009. (3) (a) The directors of every company shall have a collective duty towards it to ensure that: (i) the directors’ report shall be prepared and published in accordance with the requirements of this Law; (ii) in cases where the directors’ report includes a statement of corporate governance, such report shall be prepared and published in accordance with the requirements of this Law and of the Transparency Requirements (Securities Admitted to Trading on a Regulated Market) Laws 2007 and 2009 and of the Directives issued thereunder. (b) Without prejudice to the collective civil liability of directors towards the company which exists in case of breach of the duty referred to in 137 paragraph (a), if a director of a company fails to take all reasonable steps for compliance with the duty referred to in paragraph (a), shall commit an offence and shall on conviction thereof, be liable to imprisonment not exceeding one year or to a fine not exceeding seventeen thousand euros or to both such penalties: Provided that, subject to the provisions of any other special law, in any proceedings against a person in respect of an offence provided in this paragraph, it shall be a defence to prove that the person had reasonable cause to believe and did believe that an able and responsible person, was assigned with the duty of seeing that the provisions of paragraph (a), were complied with, and was in a position to exercise that duty. Right to receive copies of balance sheets and auditors’ report. 12(a) of 167(I) of 2003."
}