{
  "article_number": "152",
  "title": "Right to receive copies of balance sheets and auditors’ report.",
  "content": "152.-(1) The directors shall present to the company in general meeting- (a) the set of financial statements; (b) the directors’ report; (c) the auditors’ report attached to the above, where this is required by the Law: 2(a) of 42(I)/2010. Provided that, in the notice for calling a general meeting, in accordance with section 127, at which the above mentioned documents shall be deposited, mention shall be made as to the place and method of their distribution. 12(b) of 167(I) of 2003. 12(c) of 167(I) of 2003. 8 of 70 (I) of 2007. 2(b) of 42(I)/2010. (2) Copy of the documents referred to in subsection (1) shall be available at least twenty-one days before the date of the general meeting. Such copy may be requested and provided by the company, free of charge, either in electronic or hard form: (i) by every member of the company, irrespective of whether he is entitled to receive notices of general meetings of the company; (ii) by every holder of debentures of the company, irrespective of whether he is entitled to receive notices of general meetings of the company; (iii) by all persons, except members or holders of debentures of the company, who are entitled to receive notices of general meetings of the company: Provided that: (a) In the case of a company not having a share capital, this subsection shall not require the sending of the above- 138 mentioned documents to a member of the company who is not entitled to receive notices of general meetings of the company or to a holder of debentures of the company who is not so entitled; (b) at the Annual General Meeting of the shareholders of the company, the company shall have available for distribution to the shareholders present thereat the documents referred to in subsection (1) and it shall also be obliged to comply with its obligations relating to the publication of the documents as this is required in accordance with the provisions of any other related laws, either in the daily press or in its internet site or to any competent supervisory authorities, as well as to the Cyprus Stock Exchange, provided that the company is a public company listed on the Cyprus Stock Exchange. 12(b) of 167(I) of 2003. 2(c) of 42(I)/2010. (3) Any member of a company, whether he is or he is not entitled to have sent to him in electronic or hard form copies of the company’s balance sheets, and any holder of debentures of the company, whether he is or not so entitled, shall be entitled to be furnished on demand without charge with a copy in electronic or hard form of the last balance sheet of the company, including every document required by law to be annexed thereto, together with a copy in electronic or hard form of the auditors’ report of the balance sheet. 12(b) of 167(I) of 2003. 8 of 70(I) of 2007. 4(a) If default is made in complying with subsection (1), every director of the company who is in default shall commit a criminal offence punishable with a fine not exceeding eight thousand, five hundred and forty-three euros. (b) If default is made in complying with subsection (2), the company and every officer of the company who is in default shall commit a criminal offence punishable with a fine not exceeding five thousand, one hundred and twenty five euros. (c)If, when a person requests any document that he is entitled to receive pursuant to subsection (3), an omission to comply with the said subsection within seven days from the submission of the application, the company and every officer of the company who is in default shall commit a criminal offence punishable with a fine not exceeding eight hundred fifty-four euros. Compulsory auditing of financial statements and directors’ report by auditors. 13 of 167(I) of 2003."
}