{
  "article_number": "153",
  "title": "Appointment and remuneration of auditors.",
  "content": "153.- (1) Every company shall at each annual general meeting appoint an auditor or auditors to hold office from the conclusion of that, until the conclusion of the next annual general meeting. (2) At any annual general meeting a retiring auditor, however appointed, shall be re-appointed without any resolution being passed unless- (a) he is not qualified for re-appointment; or (b) a resolution has been passed at that meeting appointing somebody instead of him or providing expressly that he shall not be re- appointed; or (c) he has given the company notice in writing of his unwillingness to be re-appointed: 140 Provided that where notice is given of an intended resolution to appoint some person or persons in place of a retiring auditor, and by reason of the death, incapacity or disqualification of that person or of all those persons, as the case may be, the resolution cannot be proceeded with, the retiring auditor shall not be automatically re- appointed by virtue of this subsection. (3) Where at an annual general meeting no auditors are appointed or re-appointed, the Council of Ministers may appoint a person to fill the vacancy. (4) The company shall, within one week of the Council of Ministers’ power under subsection (3) becoming exercisable, give him notice of that fact, and, if a company fails to give notice as required by this subsection, the company and every officer of the company who is in default shall be liable to a default fine. (5) Subject as hereinafter provided, the first auditors of a company may be appointed by the directors at any time before the first annual general meeting, and auditors so appointed shall hold office until the conclusion of that meeting: Provided that- (a) the company may at a general meeting remove any such auditors and appoint in their place any other persons who have been nominated for appointment by any member of the company and of whose nomination notice has been given to the members of the company not less than fourteen days before the date of the meeting; and (b) if the directors fail to exercise their powers under this subsection, the company in general meeting may appoint the first auditors, and thereupon the said powers of the directors shall cease. (6) The directors may fill any casual vacancy in the office of auditor, but while any such vacancy continues, the surviving or continuing auditor or auditors, if any, may act. (7) The remuneration of the auditors of a company- (a) in the case of an auditor appointed by the directors or by the Council of Ministers, may be fixed by the directors or by the Council of Ministers, as the case may be; (b) subject to paragraph (a) of this subsection, shall be fixed by the company in general meeting or in such manner as the company in general meeting may determine. For the purposes of this subsection, any sums paid by the company in respect of the auditors' expenses shall be deemed to be included in the expression \"remuneration\". 5 of 41 (I) of (8) The provisions of this section shall apply subject to the provisions of 141 2009. sections 31, 43 and 44 of the Auditors and Statutory Audits of Annual and Consolidated Accounts Law, 2009. Provisions as to resolutions relating to appointment and removal of auditors."
}