{
  "article_number": "154",
  "title": "Provisions as to resolutions relating to appointment and removal of auditors.",
  "content": "154.- (1) Special notice shall be required for a resolution at a company's annual general meeting appointing as auditor a person other than a retiring auditor or providing expressly that a retiring auditor shall not be re-appointed. (2) On receipt of notice of such an intended resolution as aforesaid, the company shall forthwith send a copy thereof to the retiring auditor, if any. (3) Where notice is given of such an intended resolution as aforesaid and the retiring auditor makes with respect to the intended resolution representations in writing to the company (not exceeding a reasonable length) and requests their notification to members of the company, the company shall, unless the representations are received by it too late for it to do so,- (a) in any notice of the resolution given to members of the company, state the fact of the representations having been made; and (b) send a copy of the representations to every member of the company to whom notice of the meeting is sent (whether before or after receipt of the representations by the company), and if a copy of the representations is not sent as aforesaid because received too late or because of the company's default, the auditor may, without prejudice to his right to be heard orally, require that the representations shall be read out at the meeting: Provided that copies of the representations need not be sent out and the representations need not be read out at the meeting if, on the application either of the company or of any other person who claims to be aggrieved, the Court is satisfied that the rights conferred by this section are being abused to secure needless publicity for defamatory matter; and the Court may order the company’s costs on an application under this section to be paid in whole or in part by the auditor, notwithstanding that he is not a party to the application. (4) Subsection (3) shall apply to a resolution to remove the first auditors by virtue of subsection (5) of section 153 as it applies in relation to a resolution that a retiring auditor shall not be re-appointed. Qualifications for appointment as auditor. 2 of 76(I) of 2001. 4 of 133(I) of 2007. 6 of 41 (I) of"
}