{
  "article_number": "161",
  "title": "Production of documents, and evidence, on investigation.",
  "content": "161.- (1) It shall be the duty of all officers and agents of the company and of all officers and agents of any other body corporate whose affairs are investigated by virtue of section 160 to produce to the inspectors all books and documents of or relating to the company or, as the case may be, the other body corporate which are in their custody or power and otherwise to give to the inspectors all assistance in connection with the investigation which they are reasonably able to give. (2) An inspector may examine on oath the officers and agents of the company or other body corporate in relation to its business, and may administer an oath accordingly. (3) If any officer or agent of the company or other body corporate refuses to produce to the inspectors any book or document which it is his duty under this section so to produce, or refuses to answer any question which is put to him by the inspectors with respect to the affairs of the company or other body corporate, as the case may be, the inspectors may certify the refusal under their hand to the Court, and the Court may thereupon inquire into the case, and after hearing any witnesses who may be produced against or on behalf of the alleged offender and after hearing any statement which may be offered in defence, punish the offender in like manner as if he had been guilty of contempt of the Court. 144 (4) If an inspector thinks it necessary for the purpose of his investigation that a person whom he has no power to examine on oath should be so examined, he may apply to the Court and the Court may if it sees fit order that person to attend and be examined on oath before it on any matter relevant to the investigation, and on any such examination- (a) the inspector may take part therein either personally or by an advocate; (b) the Court may put such questions to the person examined as the Court thinks fit; (c) the person examined shall answer all such questions as the Court may put or allow to be put to him, but may at his own cost employ an advocate who shall be at liberty to put to him such questions as the Court may deem just for the purpose of enabling him to explain or qualify any answers given by him, and notes of the examination shall be taken down in writing, and shall be read over to or by, and signed by, the person examined, and may thereafter be used in evidence against him: Provided that, notwithstanding anything in paragraph (c) of this subsection, the Court may allow the person examined such costs as in its discretion it may think fit, and any costs so allowed shall be paid as part of the expenses of the investigation. (5) In this section, any reference to officers or to agents shall include past, as well as present, officers or agents, as the case may be, and for the purposes of this section the expression “agents\", in relation to a company or other body corporate shall include the bankers and advocates of the company or other body corporate and any persons employed by the company or other body corporate as auditors, whether those persons are or are not officers of the company or other body corporate. Inspectors’ report."
}