{
  "article_number": "163",
  "title": "Proceedings on inspectors’ report.",
  "content": "163.- (1) If from any report made under section 162 it appears to the Council of Ministers that any person has, in relation to the company or to any other body corporate whose affairs have been investigated by virtue of section 160, been guilty of any offence for which he is criminally liable, the Council of Ministers shall refer the matter to the Attorney-General. (2) If, where any matter is referred to the Attorney-General under this section, he considers that the case is one in which a prosecution ought to be instituted, he shall institute proceedings accordingly, and it shall be the duty of all officers and agents of the company or other body corporate as aforesaid, as the case may be, other than the defendant in the proceedings, to give him all assistance in connection with the prosecution which they are reasonably able to give. Subsection (5) of section 161 shall apply for the purposes of this subsection as it applies for the purposes of that section. (3) If, in the case of any body corporate liable to be wound up under this Law, it appears to the Council of Ministers, from any such report as aforesaid that it is expedient so to do by reason of any such circumstances as are referred to in sub-paragraph (i) or (ii) of paragraph (b) of section 159, the Council of Ministers may, unless the body corporate is already being wound up by the Court, cause a petition to be presented for it to be so wound up if the Court thinks it just and equitable that it should be wound up or a petition for an order under section 202 or both. (4) If from any such report as aforesaid it appears to the Council of Ministers that proceedings ought in the public interest to be brought by any body corporate dealt with by the report for the recovery of damages in respect of any fraud, misfeasance or other misconduct in connection with the promotion or formation of that body corporate or the management of its affairs, or for the recovery of any property of the body corporate which has been misapplied or wrongfully retained, he may cause proceedings for that purpose to be brought in the name of the body corporate. (5) The Council of Ministers shall indemnify the body corporate against any costs or expenses incurred by it in or in connection with any proceedings brought by virtue of subsection (4). 146 Expenses of investigation of company’s affairs. 3(a) of 129(I) of 2005. 3(c) of 129(I) of 2005."
}