{
  "article_number": "166",
  "title": "Appointment and powers of inspectors to investigate ownership of company.",
  "content": "166.- (1) Where it appears to the Council of Ministers that there is good reason so to do, he may appoint one or more competent inspectors to investigate and report on the membership of any company and otherwise with respect to the company for the purpose of determining the true persons who are or have been financially interested in the success or failure, real or apparent, of the company or able to control or materially to influence the policy of the company. (2) The appointment of an inspector under this section may define the scope of his investigation, whether as respects the matters or the period to which it is to extend or otherwise, and in particular may limit the investigation to matters connected with particular shares or debentures. (3) Where an application for an investigation under this section with respect to particular shares or debentures of a company is made to the Council of Ministers by members of the company, and the number of applicants or the amount of the shares held by them is not less than that required for an application for the appointment of an inspector under section 158, the Council of Ministers shall appoint an inspector to conduct the investigation unless he is satisfied that the application is vexatious, and the inspector's appointment shall not exclude from the scope of his investigation any matter which the application seeks to have included therein, except in so far as the Council of Ministers is satisfied that it is unreasonable for that matter to be investigated. (4) Subject to the terms of an inspector's appointment his powers shall extend to the investigation of any circumstances suggesting the existence of an arrangement or understanding which, though not legally binding, is or was observed or likely to be observed in practice and which is relevant to the purposes of his investigation. 147 (5) For the purposes of any investigation under this section, sections 160 to 162 shall apply with the necessary modifications of references to the affairs of the company or to those of any other body corporate, so, however, that- (a) the said sections shall apply in relation to all persons who are or have been, or whom the inspector has reasonable cause to believe to be or have been, financially interested in the success or failure or the apparent success or failure of the company or any other body corporate whose membership is investigated with that of the company, or able to control or materially to influence the policy thereof, including persons concerned only on behalf of others, as they apply in relation to officers and agents of the company or of the other body corporate, as the case may be; and (b) the Council of Ministers shall not be bound to furnish the company or any other person with a copy of any report by an inspector appointed under this section or with a complete copy thereof if he is of opinion that there is good reason for not divulging the contents of the report or of parts thereof, but shall cause to be kept by the registrar a copy of any such report or, as the case may be, the parts of any such report, as respects which he is not of that opinion. (6) The expenses of any investigation under this section shall be defrayed by the Council of Ministers out of the public revenue. Power to require information as to persons interested in shares or debentures."
}