{
  "article_number": "168",
  "title": "Power to impose restrictions on shares or debentures.",
  "content": "168.-(1) Where in connection with an investigation under section 166 or 167 it appears to the Council of Ministers that there is difficulty in finding out the relevant facts about any shares (whether issued or to be issued), and that the difficulty is due wholly or mainly to the unwillingness of the persons concerned or any of them to assist the investigation as required by this Law, the Council of Ministers may by order direct that the shares shall until further order be subject to the restrictions imposed by this section. (2) So long as any shares are directed to be subject to the restrictions imposed by this section- (a) any transfer of those shares, or in the case of unissued shares any transfer of the right to be issued therewith and any issue thereof, shall be void; (b) no voting rights shall be exercisable in respect of those shares; (c) no further shares shall be issued in right of those shares or in pursuance of any offer made to the holder thereof; (d) except in a liquidation, no payment shall be made of any sums due from the company on those shares, whether in respect of capital or otherwise. (3) Where the Council of Ministers makes an order directing that shares shall be subject to the said restrictions, or refuses to make an order directing that shares shall cease to be subject thereto, any person aggrieved thereby may apply to the Court, and the Court may, if it sees fit, direct that the shares shall cease to be subject to the said restrictions. (4) Any order, whether of the Council of Ministers or of the Court, directing that shares shall cease to be subject to the said restrictions which is expressed to be made with a view to permitting a transfer of those shares may continue the restrictions mentioned in paragraphs (c) and (d) of subsection (2), either in whole or in part, so far as they relate to any right acquired or offer made before the transfer. (5) Any person who- (a) exercises or purports to exercise any right to dispose of any shares which, to his knowledge, are for the time being subject to the said restrictions or of any right to be issued with any such shares; or 149 (b) votes in respect of any such shares, whether as holder or proxy, or appoints a proxy to vote in respect thereof; or 3 of 166 of 1987. (c) being the holder of any such shares, fails to notify of their being subject to the said restrictions any person whom he does not know to be aware of that fact but does know to be entitled, apart from the said restrictions, to vote, in respect of those shares whether as holder or proxy, shall be liable to imprisonment not exceeding one year or to a fine not exceeding one thousand, seven hundred and eight euros or to both such imprisonment and fine. 4 of 166 of 1987. (6) Where shares in any company are issued in contravention of the said restrictions, the company and every officer of the company who is in default shall be liable to a fine not exceeding one thousand, seven hundred and eight euros. (7) A prosecution shall not be instituted under this section except by or with the consent of the Attorney-General. (8) This section shall apply in relation to debentures as it applies in relation to shares. Saving for advocates and bankers."
}