{
  "article_number": "169A",
  "title": "Distribution of capital of public company.  When it is permitted.",
  "content": "169A. 14(c) of 70(I) of 2003 6(c) of 87(I) of 2008. (e) The company can only acquire its own shares which have been fully paid up. 14(c) of 70(I) of 2003. (f) In case of a company the shares of which are listed on the Stock Exchange, the intention of the board of directors of the company to take a decision for the convening of a general meeting, for the ultimate purpose of taking a decision for the acquisition by the company of its own shares, in support of their price in cases where it is considered that the said price is substantially lower than the price which corresponds to the market conditions and to the financial situation and prospects of the company is notified immediately to the Board of the Stock Exchange and the Cyprus Securities and Exchange Commission: Provided that the relevant resolution of the general meeting shall be notified to the Board of the Stock Exchange and the 69 Cyprus Securities and Exchange Commission before the commencement of the Stock Exchange sessions which follows the relevant resolution. 14(c) of 70(I) of 2003. (g) The resolution of the general meeting for the acquisition by the company of its own shares shall be published at least ten days before the commencement of the relevant acquisition, in at least two daily newspapers of wide circulation and the relevant publication must include the basic terms of the transaction and specify the time period during which the company intends to proceed with the acquisitions: Provided that the relevant publication must be repeated every time the company implements the decision of the general meeting for the acquisition of its own shares. 14(c) of 70(I) of 2003. (h) The board of directors of the company shall have an obligation to prepare forthwith a list of the shareholders from whom the relevant shares were acquired, and such list shall be notified, in case of a company the shares of which are listed on the Stock Exchange, to the Cyprus Securities and Exchange Commission and the Board of the Stock Exchange and shall be communicated to the shareholders at the first general meeting that follows the period of acquisition: Provided that the board of directors of the company, in carrying out the above announcement, duly substantiates its decision for the acquisition of its own shares from the company, proving- (a) The diminishing tendency of the price of the share at the time of the acquisition, and (b) by producing an auditors` certificate that this price is substantially lower than the price that corresponds to the actual value of the relevant share. 14(c) of 70(I) of 2003. (i) The act by which the acquisition by a company of its own shares is concluded shall be notified to the Registrar of Companies and Official Receiver within fourteen days with a statement by the company itself, signed by one director and its secretary, and is liable to a fee, in accordance with the provisions of this Law for the time being in force. 6(d) of 87(I) of 2008. (j) The acquisition by the company of its own shares shall not affect the satisfaction of the claims of its creditors. (2) In case the acquisition by a company of its own shares becomes urgently necessary, in order to avoid imminent serious damage to the company, such as, inter alia, the decline of the market price of the share below its actual value, as determined by the certified auditors, the company may proceed with an acquisition of its own shares without the prior approval of the general meeting, provided that its board of directors will inform the shareholders of the company, at an 70 extraordinary general meeting, which must be convened within two months at the latest from the date that the relevant resolution is taken, of the reasons for which the particular acquisition or purchase of the relevant shares took place, the number and nominal value of the shares acquired, the part of the issued and fully paid-up capital they represent and of the value of the said shares: Provided that in case of a company listed in the Stock Exchange, the resolution of the Board of Directors shall be notified, duly reasoned, to the Board of the Stock Exchange and the Cyprus Securities and Exchange Commission within two days from the taking of the said resolution. Exemptions. 2 of 135(I) of 2000. 57B.-(1) Acts by which the company acquires its own shares, shall be exempt from the provisions of section 57A, provided that: (a) The shares were acquired in carrying out a decision to reduce capital on the basis of the relevant provisions of this Law or in case those were acquired on the basis of section 57 of this Law, (b) The shares were acquired after a complete transfer of all the assets of the company, (c) The shares were acquired free of charge and have been fully paid-up or have been acquired by banks or other credit institutions as purchasing commission, (d) The shares were acquired by virtue of a legal obligation, resulting from a court judgment, for the purpose of protecting the minority shareholders in case of a merger, change of object or the type of the company, transfer abroad of its registered office or the imposition of restrictions on the transfer of its shares, (e) The shares were acquired from a shareholder, if the latter has not paid them up, (f) The shares were acquired in order to indemnify minority shareholders in associated companies, (g) The shares have been fully paid-up and acquired by auction following compulsory execution which had the purpose of satisfying a claim of the company against the owner of the relevant shares. (2) A company that acquires shares in the cases mentioned in sub- paragraphs (b) to (f) of paragraph (1) of this section proceeds with their transfer within a time limit of three years at the latest from the time of their acquisition, except if the nominal value of the shares which have been acquired in this way, including the shares that the company has acquired from a person acting in his name, but on the company’s 71 behalf, does not exceed ten per cent (10%) of the subscribed capital. (3) In case the shares in question have not been transferred within the time-limit specified in paragraph (2) above, these are cancelled by reducing the subscribed capital by the corresponding amount: 7 of 87(I) of 2008. Provided that this reduction is necessary to the extent that the acquisition of the shares which must be cancelled had the result of reducing the net assets of the company to an amount lower than that of the subscribed capital, increased by the stock of which this Law does not allow distribution. The amount of the aforementioned subscribed share capital shall be reduced by the amount of the share capital that has been covered, but has not yet been contributed when the former does not appear in the balance sheet. Obligation of company to transfer shares acquired in contravention of this Law. 2 of 135(I) of 2000. 57C. A company that acquires shares in contravention of the provisions of sections 57A and 57B shall have the obligation to transfer them within a time limit of a year at the latest from the date of completion of the act of their acquisition: Provided that if the shares in question are not transferred within that time-limit, then the provisions of sub-paragraph (3) of section 57B shall apply. Conditions to be met for the company to hold its own shares. 2 of 135(I) of 2000. 57D.-(1) When a company proceeds to aquire its own shares, either directly or through a person acting in his own name, but on its behalf, the possession of those shares shall be subject to the following conditions: (a) The voting rights and rights of payment of dividends of the shares acquired in that manner shall be suspended. (b) If those shares are registered in the assets of the balance sheet, then an equivalent amount of undistributed reserved funds shall be included among the liabilities. 2 of 130(I) of 2005. (2) When a company acquires its own shares either directly or through a person acting in his own name, but on its behalf, the following must be mentioned in the report of the directors of the company: (a) The reasons for which the acts in question were carried out during the financial year. (b) The number and nominal value of the shares acquired and transferred during the course of the financial year, as well as the part of the subscribed capital they represent. (c) In case of acquisition or disposal for a monetary value, the consideration for the shares. (d) The number and nominal value of the shares acquired 72 and held by the company, as well as the proportion of the subscribed capital they represent. Right of a company to pledge its own shares. 2 of 135(I)/2000. 57E. The pledge by the company of its own shares, either by itself or by a person acting in his name, but on its behalf, shall be considered acquisition of shares in the manner mentioned in sections 57A, in paragraph (1) of section 57B and in sections 57D and 53 of this Law: Provided that the provisions of this section shall not apply to cases of pledging of a number of shares within the context of current transactions carried out by a company with banks and other credit institutions. Subscription, acquisition or holding of shares through subsidiary. 15 of 70(I) of 2003. 57F.- (1) The subscription, acquisition or holding of shares of a public company (in this section called the “first company”) by another limited liability company, local or overseas (in this section called the “other company”), which other company is a subsidiary of the first, shall, for the purposes of sections 57A to 57E, be considered to have been carried out by the first company. (2) When the subscription, acquisition or holding of the shares through the other company has been carried out under the circumstances mentioned in subsection (1) of section 57B, the provisions of subsections (2) and (3) of section 57B and section 57C shall not apply, but the following will apply: (a) The voting rights attached to the shares of the first company, which are held by the other company shall be suspended, and (b) the directors of the first company are obliged to acquire from the other company the shares mentioned in subsections (2) and (3) of section 57B and section 57C at the price at which this other company had acquired them, unless the said directors prove that the first company had no involvement in the subscription or acquisition of the said shares. (3) This section shall not apply where the said subscription, acquisition or holding is made- (a) On behalf of a person other than the person subscribing, acquiring or holding the shares and provided this person is neither the first company nor the other company, (b) by the other company acting as a professional dealer in securities and in its capacity as such, provided that it is a member of a stock exchange situated or operating in the Republic or in a member state of the European Union, or that has obtained a licence to operate or is under the supervision of 73 an authority of the Republic or a member state of the European Union, being the competent authority for the supervision of professionals dealing in securities. Miscellaneous Provisions as to Share Capital Power of company to arrange for different amounts being paid on shares. 58.- A company, if so authorized by its articles, may do any one or more of the following things- 16 of 70(I) of 2003. (a) accept from any member the whole or a part of the amount remaining unpaid on any shares held by him, although no part of that amount has been called up; 16 of 70(I) of 2003. (b) pay dividend in proportion to the amount paid up on each share where a larger amount is paid up on some shares than on others. Reserve liability of company. 59.- A company may by special resolution determine that any portion of its share capital which has not been already called up shall not be capable of being called up except in the event and for the purposes of the company being wound up, and thereupon that portion of its share capital shall not be capable of being called up except in the event and for the purposes aforesaid. Voting rules in relation to a decision of the general meeting for changes in capital. Separate voting per class of shares. Majority. 17 of 70(I) of 2003 59A- (1) Where in this Law a decision of shareholders is provided for in relation to the change of the amount or the classes of the share capital or to the rights attached to any class of shares, the following rules shall apply: (a) When the share capital of the company is divided into different classes of shares, separate voting takes place for each class of shares, the rights of which are affected by the change. (b) The decision shall be taken by a majority of two thirds of the votes corresponding either to the represented securities or to the represented issued share capital. When at least half of the issued share capital is represented, a simple majority shall be sufficient. (2) The provisions of subsection (1) shall - (a) Apply to the issuance of all the securities convertible into shares or attaching the right to undertake shares, but not to the conversion of securities and the exercise of the right of undertaking; (b) not apply to private companies. Power of company limited by 60.- (1) A company limited by shares or a company limited by guarantee and having a share capital, if so authorized by its articles, may alter the 74 shares to alter its share capital. conditions of its memorandum as follows, that is to say, it may: (a) increase its share capital by new shares of such amount as it thinks expedient; (b) consolidate and divide all or any of its share capital into shares of larger amount than its existing shares; (c) convert all or any of its paid-up shares into stock, and reconvert that stock into paid-up shares of any denomination; (d) subdivide its shares, or any of them, into shares of smaller amount than is fixed by the memorandum, so, however, that in the subdivision the proportion between the amount paid and the amount, if any, unpaid on each reduced share shall be the same as it was in the case of the share from which the reduced share is derived; (e) cancel shares which, at the date of the passing of the resolution in that behalf, have not been taken or agreed to be taken by any person, and diminish the amount of its share capital by the amount of the shares so cancelled. (2) The powers conferred by this section must be exercised by the company in general meeting. (3) A cancellation of shares in pursuance of this section shall not be deemed to be a reduction of share capital within the meaning of this Law. Increase of share capital. Rules for paying off, etc. 19 of 70(I) of 2003. 60A.- (1) The shares issued by an increase of the share capital of a public company must be paid up- (a) by a percentage of at least twenty-five per cent of their nominal value, in the case of an issuance for cash consideration. Where provision is made for an issue premium, this amount must be paid in full. (b) In the case of an issuance for a consideration in kind, they must have been paid up in full, within a timeframe of five years after the date of the resolution for the increase. 8 of 87(I) of 2008. (2) The value of considerations in kind, mentioned in paragraph (b) of subsection (1), shall be valued according to the provisions in section 47B, except where sections 47D and 47E apply: Provided that no valuation shall be required when: (a) The increase of the share capital is effected for the purpose of realizing a merger or a public offer for the purchase 75 or exchange and for the purpose of compensating the shareholders of the company which has been absorbed, or the shareholders of a company which is the subject of the public offer, purchase or exchange, or (b) the total increase- (i) has been covered by considerations in kind made from one or more companies, all the shareholders of which have agreed not to have an expert’ s report drawn up, and (ii) all the conditions of paragraph (b) of subsection (4) of section 47B are complied with. (3) If the amount of the increase of the share capital is not fully covered, the share capital shall be increased to the extent covered, only if this is expressly provided for in the terms of issue. Principle of preferring the existing shareholders during the increase of the share capital by way of cash contributions. 19 of 70(I) of 2003 60B.- (1) On the increase of the share capital of a public company by considerations in cash, the shares must be offered on a pre-emptive basis to shareholders in proportion to the percentage of the capital represented by their shares: Provided that, the right of pre-emption may not be excluded, when, in accordance with the decision for the increase of the share capital, the share issuance is made in favour of banks or other credit institutions, with a purpose of offering them thereafter to the shareholders of the company in accordance with the above-mentioned. (2) Shares to which a restricted right of participation in the distributions in the meaning of section 169A and/or in the distribution of the company assets in the case of liquidation is attached, shall not have a right of pre-emption. (3) When the company has different classes of shares, in which the right to vote or the right to participate in the distributions within the meaning of section 169A and/or in the distribution of the company’s assets in the case of liquidation are different between them, and the share capital is to be increased by the issuance of new shares of only one class of such classes, the memorandum or articles may allow the exercise of a right of pre-emption by the shareholders of the other classes only after the exercise of such right by the shareholders of the class from which the new shares are being issued. (4) (a) The offer for subscription on a pre-emptive basis, as well as the period, within which such right must be exercised, shall be published in accordance with section 365A: Provided that no publication shall be required when all the shares of the company are nominal, in which case all shareholders must be notified in writing. 76 (b) The pre-emption right must be exercised within a period which shall not be less than fourteen days from the notification of the offer or the sending out of the letters to the shareholders. (5) The pre-emption right may not be restricted or excluded from the articles, unless by way of a resolution of the general meeting. The directors shall have an obligation to present to the general meeting a written report which shall state the reasons for restriction or exclusion of the right of pre-emption and shall justify the proposed issue price. The general meeting shall decide in accordance with the regulations set out in section 59A. The decision thereof shall be published pursuant to section 365A. (6) Subsections (1) to (5) shall apply to the issuance of all securities which are convertible into shares or are accompanied by a right to undertake shares, but not to the conversion of the securities nor to the exercise of the right to subscribe. Notice to registrar of consolidation of share capital, conversion of shares into stock, etc. 61.-(1) If a company having a share capital has- (a) consolidated and divided its share capital into shares of larger amount than its existing shares; or (b) converted any shares into stock; or (c) reconverted stock into shares; or (d) subdivided its shares or any of them; or (e) redeemed any redeemable preference shares; or 10 (a) of 99(I) of 2009. (f) cancelled any shares, otherwise than in connection with a reduction of share capital under section 64 of this Law or, 10 (b) of 99(I) of 2009. (g) converted any shares belonging to a certain class of shares into another class of shares, such conversion either being made through a resolution or automatically on the basis of the conditions of issue of the relevant shares, it shall be obliged within one month after so doing to give notice thereof to the registrar of companies specifying, as the case may be, the shares, consolidated, divided, converted, subdivided, redeemed or cancelled, or the stock reconverted. (2) If default is made in complying with this section, the company and every officer of the company who is in default shall be liable to a default fine. Notice of increase of share capital. 62.-(1) Where a company having a share capital whether its shares have or have not been converted into stock, has increased its share capital beyond the registered capital, it shall, within fifteen days after the passing of the resolution authorizing the increase, give to the registrar of 77 4 of 76 of 1977. companies notice of the increase, and the registrar shall record the increase. (2) The notice to be given as aforesaid shall include such particulars as may be prescribed with respect to the classes of shares affected and the conditions subject to which the new shares have been or are to be issued, and there shall be forwarded to the registrar of companies together with the notice a printed copy of the resolution authorizing the increase: 4 of 70(I) of 2007. Provided that in case the resolution of the general meeting for the increase of capital grants authority to the directors to issue and allot new shares, this authority shall have a maximum duration of five years, and may be renewed one or more times by the general meeting, for a period of time of maximum five years for each renewal. (3) If default is made in complying with this section, the company and every officer of the company who is in default shall be liable to a default fine. Power of company to pay interest out of capital in certain cases. 63.- Where any shares of a company are issued for the purpose of raising money to defray the expenses of the construction of any works or buildings or the provision of any plant which cannot be made profitable for a lengthened period, the company may pay interest on so much of that share capital as is for the time being paid up for the period and subject to the conditions and restrictions in this section mentioned, and may charge the sum so paid by way of interest to capital as part of the cost of construction of the work or building, or the provision of plant: Provided that- (a) no such payment shall be made unless it is authorized by the articles or by special resolution; (b) no such payment, whether authorized by the articles or by special resolution, shall be made without the previous sanction of the Council of Ministers; (c) before sanctioning any such payment the Council of Ministers may, at the expense of the company, appoint a person to inquire and report to him as to the circumstances of the case, and may, before making the appointment, require the company to give security for the payment of the costs of the inquiry; (d) the payment shall be made only for such period as may be determined by the Council of Ministers, and that period shall in no case extend beyond the close of the half-year next after the half-year during which the works or buildings have been actually completed or the plant provided; (e) the rate of interest shall in no case exceed four per cent per annum or such other rate as may for the time being be prescribed by order of 78 the Council of Ministers; (f) the payment of the interest shall not operate as a reduction of the amount paid up on the shares in respect of which it is paid. 20 of 70 (I) of 2003. Reduction of Share Capital and Related Transactions Special resolution for reduction of share capital. 5 of 70(I) of 2007. 64.-(1) Subject to confirmation by the Court, a company limited by shares or a company limited by guarantee and having a share capital may, if so authorized by its articles, by special resolution notified to the registrar of companies and published pursuant to section 365A reduce its share capital in any way, and in particular, without prejudice to the generality of the foregoing power, may- (a) extinguish or reduce the liability on any of its shares in respect of share capital not paid up; or (b) either with or without extinguishing or reducing liability on any of its shares, cancel any paid-up share capital which is lost or unrepresented by available assets; or 2(a) of 198(I) of 2011. (c) either with or without extinguishing or reducing liability on any of its shares, pay off any paid-up share capital which is in excess of the wants of the company; or 2(b) of 198(I) of 2011. (d) cancel paid up share capital for the purpose of writing off losses of the company; or 2(b) of 198(I) of 2011. (e) cancel paid up share capital by the creation of a reserve, to be called “the capital reduction reserve fund” which will be subject to the same treatment as the share premium account as prescribed in section 55, the provisions of which shall apply in this respect, and may, if so far as is necessary, alter its memorandum by reducing the amount of its share capital and of its shares accordingly. (2) A special resolution under this section is in this Law referred to as a “resolution for reducing share capital”. 21 of 70(I) of 2003. (3) In the case of a public company the subscribed capital may not be reduced to an amount below the minimum capital provided for in section 4A, unless the decision for the reduction simultaneously provides for an increase of the capital to an amount at least equal to the prescribed minimum. Application to Court for confirming order, objections by creditors, and settlement of list of 65.- (1) Where a company has passed a resolution for reducing share capital, it may apply to the Court for an order confirming the reduction. (2) Where the proposed reduction of share capital involves either diminution of liability in respect of unpaid share capital or the payment to any shareholder of any paid-up share capital, and in any other case 79 objecting creditors. if the Court so directs, the following provisions shall have effect, subject nevertheless to subsection (3):- 9 of 87(I) of 2008. (a) every creditor of the company who at the date fixed by the Court is entitled to any debt or claim which, if that date were the commence- ment of the winding up of the company, would be admissible in proof against the company, and who can prove that there is a reasonable chance that the proposed reduction of the share capital will endanger the repayment of the debt or the satisfaction of his claim from the company, and that there are no sufficient guarantees in place by the company, shall be entitled to object to the reduction; (b) the Court shall settle a list of creditors so entitled to object, and for that purpose shall ascertain, as far as possible without requiring an application from any creditor, the names of those creditors and the nature and amount of their debts or claims, and may publish notices fixing a day or days within which creditors not entered on the list are to claim to be so entered or are to be excluded from the right of objecting to the reduction; (c) where a creditor entered on the list whose debt or claim is not discharged or has not determined does not consent to the reduction, the Court may, if it thinks fit, dispense with the consent of that creditor, on the company securing payment of his debt or claim by appropriating, as the Court may direct, the following amount:- (i) if the company admits the full amount of the debt or claim, or, though not admitting it, is willing to provide for it, then the full amount of the debt or claim; (ii) if the company does not admit and is not willing to provide for the full amount of the debt or claim, or if the amount is contingent or not ascertained, then an amount fixed by the Court after the like inquiry and adjudication as if the company were being wound up by the Court. (3) Where a proposed reduction of share capital involves either the diminution of any liability in respect of unpaid share capital or the payment to any shareholder of any paid-up share capital, the Court may, if, having regard to any special circumstances of the case, it thinks proper so to do, direct that subsection (2) shall not apply as regards any class or any classes of creditors. Order confirming reduction and powers of Court on making such order. 66.-(1) The Court, if satisfied, with respect to every creditor of the company who under section 65, is entitled to object to the reduction, that either his consent to the reduction has been obtained or his debt or claim has been discharged or has determined, or has been secured, may make an order confirming the reduction on such terms and conditions as it thinks fit. (2) Where the Court makes any such order, it may- 80 (a) if for any special reason it thinks proper so to do, make an order directing that the company shall, during such period, commencing on or at any time after the date of the order, as is specified in the order, add to its name as the last words thereof the words \"and reduced\"; and (b) make an order requiring the company to publish as the Court directs the reasons for reduction or such other information in regard thereto as the Court may think expedient with a view to giving proper information to the public, and, if the Court thinks fit, the causes which led to the reduction. (3) Where a company is ordered to add to its name the words \"and reduced,\" those words shall, until the expiration of the period specified in the order, be deemed to be part of the name of the company. Registration of order and minute of reduction. 67.- (1) The registrar of companies, on production to him of an order of the Court confirming the reduction of the share capital of a company, and the delivery to him of a copy of the order and of a minute approved by the Court showing, with respect to the share capital of the company as altered by the order, the amount of the share capital, the number of shares into which it is to be divided, and the amount of each share, and the amount, if any, at the date of the registration deemed to be paid up on each share, shall register the order and minute. (2) On the registration of the order and minute, and not before, the resolution for reducing share capital as confirmed by the order so registered shall take effect. (3) Notice of the registration shall be published in such manner as the Court may direct. (4) The registrar shall certify under his hand the registration of the order and minute, and his certificate shall be conclusive evidence that all the requirements of this Law with respect to reduction of share capital have been complied with, and that the share capital of the company is such as is stated in the minute. (5) The minute when registered shall be deemed to be substituted for the corresponding part of the memorandum, and shall be valid and alterable as if it had been originally contained therein. (6) The substitution of any such minute as aforesaid for part of the memorandum of the company shall be deemed to be an alteration of the memorandum within the meaning of section 26. Liability of members in respect of reduced shares. 68.-(1) In the case of a reduction of share capital, a member of the company, past or present, shall not be liable in respect of any share to any call or contribution exceeding in amount the difference, if any, between the amount of the share as fixed by the minute and the amount paid, or the reduced amount, if any, which is to be deemed to have been paid, on the share, as the case may be: 81 Provided that, if any creditor, entitled in respect of any debt or claim to object to the reduction of share capital, is, by reason of his ignorance of the proceedings for reduction, or of their nature and effect with respect to his claim, not entered on the list of creditors, and, after the reduction, the company is unable, within the meaning of the provisions of this Law with respect to winding up by the Court, to pay the amount of his debt or claim, then- (a) every person who was a member of the company at the date of the registration of the order for reduction and minute, shall be liable to contribute for the payment of that debt or claim an amount not exceeding the amount which he would have been liable to contribute if the company had commenced to be wound up on the day before the said date; and (b) if the company is wound up, the Court, on the application of any such creditor and proof of his ignorance as aforesaid, may, if it thinks fit, settle accordingly a list of persons so liable to contribute, and make and enforce calls and orders on the contributories settled on the list, as if they were ordinary contributories in a winding up. (2) Nothing in this section shall affect the rights of the contributories among themselves. Penalty for concealing name of creditor, etc. 69. If any officer of the company- (a) wilfully conceals the name of any creditor entitled to object to the reduction; or (b) wilfully misrepresents the nature or amount of the debt or claim of any creditor; or (c) aids, abets or is privy to any such concealment or misrepresentation as aforesaid, 3 of 166 of 1987. he shall be guilty of an offence and shall on conviction thereof be liable to imprisonment not exceeding two years or to a fine not exceeding two thousand five hundred and sixty-two euros or to both such imprisonment and fine. 22 of 70(I) of 2003. Rights of Shareholders and Variation thereof Equal treatment of shareholders of the same class. 23 of 70(I) of 2003. 69A. The shareholders of a public company, who hold shares of the same class, shall be treated equally by the company. Provisions to the contrary in the memorandum or the articles or the decisions of the general meeting shall be void. Rights of holders of special classes of 70.-(1) If, in the case of a company the share capital of which is divided into different classes of shares, provision is made by the memorandum or articles for authorizing the variation of the rights attached to any class of shares in the company, subject to the consent of any specified proportion 82 shares. of the holders of the issued shares of that class or the sanction of a resolution passed at a separate meeting of the holders of those shares, and in pursuance of the said provision the rights attached to any such class of shares are at any time varied, the holders of not less in the aggregate than fifteen per cent of the issued shares of that class, being persons who did not consent to or vote in favour of the resolution for the variation, may apply to the Court to have the variation cancelled, and, where any such application is made, the variation shall not have effect unless and until it is confirmed by the Court. (2) An application under this section must be made within twenty-one days after the date on which the consent was given or the resolution was passed, as the case may be, and may be made on behalf of the shareholders entitled to make the application by such one or more of their number as they may appoint in writing for the purpose. (3) On any such application the Court, after hearing the applicant and any other persons who apply to the Court to be heard and appear to the Court to be interested in the application, may, if it is satisfied, having regard to all the circumstances of the case, that the variation would unfairly prejudice the shareholder of the class represented by the applicant, disallow the variation and shall, if not so satisfied, confirm the variation. (4) The decision of the Court on any such application shall be final. (5) The company shall within fifteen days after the making of an order by the Court on any such application forward a copy of the order to the registrar of companies, and, if default is made in complying with this provision, the company and every officer of the company who is in default shall be liable to a default fine. (6) The expression \"variation\" in this section includes abrogation and the expression \"varied\" shall be construed accordingly. Transfer of Shares and Debentures, Evidence of Title, etc. Nature of shares. 71. The shares or other interest of any member in a company shall be personal estate, transferable in manner provided by the articles of the company, and shall not be of the nature of real estate. Numbering of shares. 72. Each share in a company having a share capital shall be distinguished by its appropriate number: Provided that, if at any time all the issued shares in a company or all the issued shares therein of a particular class, are fully paid up and rank pari passu for all purposes, none of those shares need thereafter have a distinguishing number so long as it remains fully paid up and ranks pari passu for all purposes with all shares of the same class for the time being issued and fully paid up. Transfer not 73. Notwithstanding anything in the articles of a company, it shall not be 83 to be registered except on production of instrument of transfer. 11 of 99(I) of 2009 lawful for the company to register a transfer of shares in or debentures of the company unless a proper instrument of transfer has been delivered to the company: Providing that nothing in this section shall prejudice any power of the company to register as shareholder or debenture holder any person to whom the right to any shares in or debentures of the company has been transmitted by operation of law: Provided, further, that in the case of any public company the shares or other securities or transferable securities of which have been negotiated in a foreign market, the registration of a transfer of shares or debentures of the company shall be lawful for the company even if an appropriate instrument of transfer is not delivered to the company, provided that the transfer has taken place in accordance with the law or the regulations governing the operation of the relevant market. Transfer by personal representative. 74. A transfer of the share or other interest of a deceased member of a company made by his personal representative shall, although the personal representative is not himself a member of the company, be as valid as if he had been such a member at the time of the execution of the instrument of transfer. Registration of transfer at request of transferor. 75. On the application of the transferor of any share or interest in a company, the company shall enter in its register of members the name of the transferee in the same manner and subject to the same conditions as if the application for the entry were made by the transferee. Notice of refusal to register transfer. 76.-(1) If a company refuses to register a transfer of any shares or debentures, the company shall, within two months after the date on which the transfer was lodged with the company, send to the transferee notice of the refusal. (2) If default is made in complying with this section, the company and every officer of the company who is in default shall be liable to a default fine. Certification of transfers. 77.- (1) The certification by a company of any instrument of transfer of shares in or debentures of the company shall be taken as a representation by the company to any person acting on the faith of the certification that there have been produced to the company such documents as on the face of them show a prima facie title to the shares or debentures in the transferor named in the instrument of transfer, but not as a representation that the transferor has any title to the shares or debentures. (2) Where any person acts on the faith of a false certification by a company made negligently, the company shall be under the same liability to him as if the certification had been made fraudulently. (3) For the purposes of this section- 84 (a) an instrument of transfer shall be deemed to be certificated if it bears the words \"certificate lodged\" or words to the like effect; (b) the certification of an instrument of transfer shall be deemed to be made by a company if- (i) the person issuing the instrument is a person authorized to issue certificated instruments of transfer on the company's behalf; and (ii) the certification is signed by a person authorized to certificate transfers on the company's behalf or by any officer or servant either of the company or of a body corporate so authorized; (c) a certification shall be deemed to be signed by any person if- (i) it purports to be authenticated by his signature or initials, whether handwritten or not; and (ii) it is not shown that the signature or initials was or were placed there neither by himself nor by any person authorized to use the signature or initials for the purpose of certificating transfers on the company's behalf. Duties of company with respect to issue of certificates. 78.-(1) Every company shall, within two months after the allotment of any of its shares, debentures or debenture stock and within two months after the date on which a transfer of any such shares, debentures or debenture stock is lodged with the company, complete and have ready for delivery the certificates of all shares, the debentures and the certificates of all debenture stock allotted or transferred, unless the conditions of issue of the shares, debentures or debenture stock otherwise provide. The expression \"transfer\" for the purposes of this subsection means a transfer duly stamped and otherwise valid, and does not include such a transfer as the company is for any reason entitled to refuse to register and does not register. (2) If default is made in complying with this section, the company and every officer of the company who is in default shall be liable to a default fine. (3) If any company on which a notice has been served requiring the company to make good any default in complying with the provisions of subsection (1) fails to make good the default within ten days after the service of the notice, the Court may, on the application of the person entitled to have the certificates or the debentures delivered to him, make an order directing the company and any officer of the company to make good the default within such time as may be specified in the order, and any such order may provide that all costs of and incidental to the application shall be borne by the company or by any officer of the company responsible for the default. 85 Certificate to be evidence of title. 79. A certificate, under the common seal of the company, specifying any shares held by any member, shall be prima facie evidence of the title of the member to the shares. Evidence of grant of probate. 80. The production to a company of any document which is by law sufficient evidence of probate of the will, or letters of administration of the estate, or confirmation as executor, of a deceased person having been granted to some person shall be accepted by the company, notwithstanding anything in its articles, as sufficient evidence of the grant. Issue and effect of share warrants to bearer. 2 of 203(I) of 2012 81.-(1) A company limited by shares, which is an admitted company in a regulated market, if so authorized by its articles, may, with respect to any fully paid-up shares, issue under its common seal a warrant stating that the bearer of the warrant is entitled to the shares therein specified, and may provide, by coupons or otherwise, for the payment of the future dividends on the shares included in the warrant. (2) Such a warrant as aforesaid is in this Law termed a “share warrant.\" (3) A share warrant shall entitle the bearer thereof to the shares therein specified, and the shares may be transferred by delivery of the warrant. Penalty for personation of shareholder. 82. If any person falsely and deceitfully personates any owner of any share or interest in any company, or of any share warrant or coupon, issued in pursuance of this Law, and thereby obtains or endeavours to obtain any such share or interest or share warrant or coupon, or receives or endeavours to receive any money due to any such owner, as if the offender were the true and lawful owner, he shall be guilty of an offence, and shall on conviction thereof be liable to imprisonment not exceeding five years. Special Provisions as to Debentures Register of debenture holders. 83. Every company shall keep at its registered office a register of holders of debentures of the company: Provided that a company may keep such register at any other of its offices at which the work of making it up is done or, if the company arranges with some other person for the making up of the register on its behalf at the office of that other person at which the work is done, but in every such case the company shall send a notice to the registrar of companies of the place where the register is kept and of any change in that place. Rights of inspection of register of debenture holders and to copies of register and trust deed. 84.-(1) Every register of holders of debentures of a company shall, except when duly closed (but subject to such reasonable restrictions as the company may in general meeting impose, so that not less than two hours in each day shall be allowed for inspection), be open to the inspec- tion of the registered holder of any such debentures or any holder of shares in the company without fee, and of any other person on payment of a fee of 0,0854 euros or such less sum as may be prescribed by the company. 86 (2) Any such registered holder of debentures or holder of shares as aforesaid or any other person may require a copy of the register of the holders of debentures of the company or any part thereof on payment of 0,0427 euros for every hundred words required to be copied. (3) A copy of any trust deed for securing any issue of debentures shall be forwarded to every holder of any such debentures at his request on payment in the case of a printed trust deed of the sum of 0,0854 euros or such less sum as may be prescribed by the company, or where the trust deed has not been printed, on payment of 0,0427 euros for every hundred words required to be copied. 4 of 166 of 1987. 4 of 166 of 1987. (4) If inspection is refused, or a copy is refused or not forwarded, the company and every officer of the company who is in default shall be liable to a fine not exceeding forty-two euros, and further shall be liable to a default fine of forty-two euros. (5) Where a company is in default as aforesaid, the Court may by order compel an immediate inspection of the register or direct that the copies required shall be sent to the person requiring them. (6) For the purposes of this section, a register shall be deemed to be duly closed if closed in accordance with provisions contained in the articles or in the debentures or, in the case of debenture stock, in the stock certificates, or in the trust deed or other document securing the debentures or debenture stock, during such period or periods, not exceeding in the whole thirty days in any year, as may be therein specified. Liability of trustees for debenture holders. 85.-(1) Subject to the following provisions of this section, any provision contained in a trust deed for securing an issue of debentures, or in any contract with the holders of debentures secured by a trust deed, shall be void in so far as it would have the effect of exempting a trustee thereof from or indemnifying him against liability for breach of trust where he fails to show the degree of care and diligence required of him as trustee, having regard to the provisions of the trust deed conferring on him any powers, authorities or discretions. (2) Subsection (1) shall not invalidate- (a) any release otherwise validly given in respect of anything done or omitted to be done by a trustee before the giving of the release; or (b) any provision enabling such a release to be given- (i) on the agreement thereto of a majority of not less than three-fourths in value of the debenture holders present and voting in person or, where proxies are permitted, by proxy at a meeting summoned for the purpose; and (ii) either with respect to specific acts or omissions or on the trustee 87 dying or ceasing to act. (3) Subsection (1) shall not operate- (a) to invalidate any provision in force at the commencement of this Law so long as any person then entitled to the benefit of that provision or afterwards given the benefit thereof under subsection (4) remains a trustee of the deed in question; or (b) to deprive any person of any exemption or right to be indemnified in respect of anything done or omitted to be done by him while any such provision was in force. (4) While any trustee of a trust deed remains entitled to the benefit of a provision saved by subsection (3), the benefit of that provision may be given either- (a) to all trustees of the deed, present and future; or (b) to any named trustees or proposed trustees thereof, by a resolution passed by a majority of not less than three-fourths in value of the debenture holders present in person or, where proxies are permitted, by proxy at a meeting summoned for the purpose in accordance with the provisions of the deed or, if the deed makes no provision for summoning meetings, a meeting summoned for the purpose in any manner approved by the Court. Perpetual debentures. 86. A condition contained in any debentures or in any deed for securing any debentures, shall not be invalid by reason only that the debentures are thereby made irredeemable or redeemable only on the happening of a contingency, however remote, or on the expiration of a period, however long, any rule of equity to the contrary notwithstanding. Power to reissue redeemed debentures in certain cases. 87.- (1) Where a company has redeemed any debentures previously issued, then: (a) unless any provision to the contrary, whether express or implied, is contained in the articles or in any contract entered into by the company; or (b) unless the company has, by passing a resolution to that effect or by some other act, manifested its intention that the debentures shall be cancelled, the company shall have, and shall be deemed always to have had, power to re-issue the debentures, either by re-issuing the same debentures or by issuing other debentures in their place. (2) On a re-issue of redeemed debentures the person entitled to the debentures shall have, and shall be deemed always to have had, the same priorities as if the debentures had never been redeemed. 88 (3) Where a company has deposited any of its debentures to secure advances from time to time on current account or otherwise, the debentures shall not be deemed to have been redeemed by reason only of the account of the company having ceased to be in debit whilst the debentures remained so deposited. (4) The re-issue of a debenture or the issue of another debenture in its place under the power by this section given to, or deemed to have been possessed by, a company, shall be treated as the issue of a new debenture for the purposes of stamp duty, but it shall not be so treated for the purposes of any provision limiting the amount or number of debentures to be issued: Provided that any person lending money on the security of a debenture re-issued under this section which appears to be duly stamped may give the debenture in evidence in any proceedings for enforcing his security without payment of the stamp duty or any penalty in respect thereof, unless he had notice or, but for his negligence, might have dis- covered, that the debenture was not duly stamped, but in such case the company shall be liable to pay the proper stamp duty and penalty. Specific performance of contracts to take up debentures. 88. A contract with a company to take up and pay for any debentures of the company may be enforced by an order for specific performance. Payment of certain debts out of assets subject to floating charge in priority to claims under the charge. 89.-(1) Where either a receiver is appointed on behalf of the holders of any debentures of the company secured by a floating charge, or possession is taken by or on behalf of those debenture holders of any property comprised in or subject to the charge, then, if the company is not at the time in course of being wound up, the debts which in every winding up are under the provisions of Part V relating to preferential payments to be paid in priority to all other debts, shall be paid out of any assets coming to the hands of the receiver or other person taking possession as aforesaid in priority to any claim for principal or interest in respect of the debentures. (2) In the application of the said provisions, section 300 shall be construed as if the provision for payment of accrued holiday remuneration becoming payable on the termination of employment before or by the effect of the winding-up order or resolution were a provision for payment of such remuneration becoming payable on the termination of employment before or by the effect of the appointment of the receiver or possession being taken as aforesaid. (3) The periods of time mentioned in the said provisions of Part V shall be reckoned from the date of the appointment of the receiver or of possession being taken as aforesaid, as the case may be. (4) Any payments made under this section shall be recouped as far as may be out of the assets of the company available for payment of general creditors. 89 PART III. CHARGES AND MORTGAGES Registration of Charges and recording of Mortgages Registration of charges created by companies registered in the Republic. 12 (a) of 99(I) of 2009. 90.- (1) Subject to the provisions of this Part every charge as well as every amendment, assignment or other change to it created after the fixed date by a company registered in the Republic and being a charge to which this section applies shall, so far as any security on the company's property or undertaking is conferred thereby, be void against the liquidator and any creditor of the company, unless the prescribed particulars of the charge together with the instrument, if any, duly stamped by which the charge is created or evidenced, are delivered to or received by the registrar of companies for registration in manner required by this Law within twenty one days after the date of its creation, but without prejudice to any contract or obligation for repayment of the money thereby secured, and when a charge becomes void under this section the money secured thereby shall immediately become payable. (2) This section applies to the following charges:- (a) a charge for the purpose of securing any issue of debentures; (b) a charge on uncalled share capital of the company; (c) a charge on book debts of the company; (d) a floating charge on the undertaking or property of the company; (e) a charge on calls made but not paid; (f) a charge on a ship or any share in a ship; (g) a charge on goodwill, on a patent or a licence under a patent, on a trade mark or on a copyright or a license under a copyright; (h) a charge on any other movable property created or evidenced by an instrument, where the company retains possession of such property; (i) a charge on immovable property, wherever situate, or any interest therein; 12 (b) of 99(I) of 2009. 43(I) of 2004. Provided that, the cases, to which this section shall not apply, shall include cases of- (a) pledge of shares in companies and all the rights emanating from it, (b) agreements for the provision of financial collaterals within the meaning of the Financial Collateral Arrangements Law, as may be amended and apply from time to time. 90 (3) In the case of a charge created out of the Republic comprising property situate outside the Republic, the delivery to and the receipt by the registrar of a copy verified in the prescribed manner of the instrument by which the charge is created or evidenced shall have the same effect for the purposes of this section as the delivery and receipt of the instrument itself, and twenty- one days after the date on which the instrument or copy could, in due course of post, and if despatched with due diligence, have been received in the Republic shall be substituted for twenty one days after the date of the creation of the charge as the time within which the particulars and instrument or copy are to be delivered to the registrar. (4) Where a charge is created in the Republic but comprises property outside the Republic, the instrument creating or purporting to create the charge may be sent for registration under this section notwithstanding that further proceedings may be necessary to make the charge valid or effectual according to the law of the country in which the property is situate. (5) Where a negotiable instrument has been given to secure the payment of any book debts of a company the deposit of the instrument for the purpose of securing an advance to the company shall not, for the purposes of this section, be treated as a charge on those book debts. (6) The holding of debentures entitling the holder to a charge on immovable property shall not for the purposes of this section be deemed to be an interest in immovable property. (7) Where a series of debentures containing, or giving by reference to any other instrument, any charge to the benefit of which the debenture holders of that series are entitled pari passu is created by a company, it shall, for the purposes of this section, be sufficient if there are delivered to or received by the registrar, within twenty-one days after the execution of the deed containing the charge or, if there is no such deed, after the execution of any debentures of the series, the following particulars:- (a) the total amount secured by the whole series; and (b) the dates of the resolutions authorizing the issue of the series and the date of the covering deed, if any, by which the security is created or defined; and (c) a general description of the property charged; and (d) the names of the trustees, if any, for the debenture holders, together with the deed containing the charge, or, if there is no such deed, one of the debentures of the series: Provided that, where more than one issue is made of debentures in the 91 series, there shall be sent to the registrar for entry in the register particulars of the date and amount of each issue, but an omission to do this shall not affect the validity of the debentures issued. (8) Where any commission, allowance or discount has been paid or made either directly or indirectly by a company to any person in consideration of his subscribing or agreeing to subscribe, whether absolutely or conditionally, for any debentures of the company, or procuring or agreeing to procure subscriptions, whether absolute or conditional, for any such debentures, the particulars required to be sent for registration under this section shall include particulars as to the amount or rate per cent of the commission, discount or allowance so paid or made, but omission to do this shall not affect the validity of the debentures issued: Provided that the deposit of any debentures as security for any debt of the company shall not, for the purposes of this subsection, be treated as the issue of the debentures at a discount. (9) In this Part- 2 of 53 (I) of 2011. 130 (I) of 2010. (a) the expression “charge\" does not include any mortgage of immovable property effected under any Law relating to the registration of mortgages of immovable property in force for the time being and any cover pool as from the coming into force and in accordance with the provisions of the Covered Bonds Law, as amended or substituted for the time being; (b) the expression “the fixed date” means in relation to the charges specified in paragraphs (h) and (i) of subsection (2), the 1st day of July, 1922, and in relation to the charges specified in paragraphs (a) to (g), both inclusive, of the said subsection, the date of the commencement of this Law. Duty of company with regard to charges and mortgages created by company. 91.- (1) It shall be the duty of a company to send to the registrar of companies for registration the particulars of every charge created by the company and of the issues of debentures of a series requiring registration under section 90, but registration of any such charge may be effected on the application of any person interested therein. (2) Where registration is effected on the application of some person other than the company, that person shall be entitled to recover from the company the amount of any fees properly paid by him to the registrar on the registration. (3) It shall be the duty of a company to send to the registrar of companies within twenty one days after the date of every mortgage effected by the company on its immovable property under any Law relating to the registration of mortgages of immovable property in force for the time being, particulars thereof for recording, as well as particulars of any cancellation thereof in whole or in part, within twenty one days after the date of such cancellation. 92 (4) If any company makes default- (a) in sending to the registrar for registration the particulars of any charge created by the company or of the issues of debentures of a series requiring registration as aforesaid, unless the registration has been effected on the application of some other person; or (b) in sending to the registrar for recording the particulars of any mortgage effected or cancelled under subsection (3), 4 of 166 of 1987. then the company and every officer of the company who is in default shall be liable to a default fine of four hundred twenty-seven euros. Duty of company to register charges existing on property acquired. 92.- (1) Where a company registered in the Republic acquires any property which is subject to a charge of any such kind as would, if it had been created by the company after the acquisition of the property, have been required to be registered under this Part, the company shall cause the prescribed particulars of the charge, together with a copy (certified in the prescribed manner to be a correct copy) of the instrument, if any, by which the charge was created or is evidenced, to be delivered to the registrar of companies for registration in manner required by this Law within twenty-one days after the date on which the acquisition is completed: Provided that, if the property is situate and the charge was created outside the Republic, twenty one days after the date on which the copy of the instrument could in due course of post, and if despatched with due diligence, have been received in the Republic shall be substituted for twenty-one days after the completion of the acquisition as the time within which the particulars and the copy of the instrument are to be delivered to the registrar. 4 of 166 of 1987. (2) If default is made in complying with this section, the company and every officer of the company who is in default shall be liable to a default fine of four hundred twenty-seven euros. Register of charges to be kept by registrar of companies. 93.- (1) The registrar of companies shall keep, with respect to each company, a register and a record in the prescribed form of all the charges requiring registration and of all the mortgages requiring recording respectively, under this Part, and shall, on payment of such fee as may be specified by regulations made by the Council Ministers, enter in the register and record with respect to such charges and mortgages the following particulars:- (a) in the case of a charge to the benefit of which the holders of a series of debentures are entitled, such particulars as are specified in subsection (7) of section 90; (b) in the case of any mortgage- (i) the date and description of the instrument creating or 93 evidencing the mortgage; and (ii) the number and date on the certificate of mortgage; and (iii) the amount secured by the mortgage; and (iv) short particulars of the property mortgaged; and (v) the persons entitled to the mortgage; (c) in the case of any other charge- (i) if the charge is a charge created by the company, the date of its creation, and if the charge was a charge existing on property acquired by the company, the date of the acquisition of the property; and (ii) the amount secured by the charge; and (iii) short particulars of the property charged; and (iv) the persons entitled to the charge. (2) The registrar shall give a certificate under his hand of the registration of any charge registered in pursuance of this Part, stating the amount thereby secured, and the certificate shall be conclusive evidence that the requirements of this Part as to registration have been complied with. 5 of 76 of 1977. (3) The register and record kept in pursuance of this section shall be open to inspection by any person on payment of such fee, as may be specified by regulations made by the Council of Ministers. Endorsement of certificate of registration on debentures. 94.-(1) The company shall cause a copy of every certificate of registration given under section 93 to be endorsed on every debenture or certificate of debenture stock which is issued by the company and the payment of which is secured by the charge so registered: Provided that nothing in this subsection shall be construed as requiring a company to cause a certificate of registration of any charge so given to be endorsed on any debenture or certificate of debenture stock issued by the company before the charge was created. 4 of 166 of 1987. (2) If any person knowingly and wilfully authorizes or permits the delivery of any debenture or certificate of debenture stock which under the provisions of this section is required to have endorsed on it a copy of a certificate of registration without the copy being so endorsed upon it, he shall, without prejudice to any other liability, be liable to a fine not exceeding eight hundred fifty-four euros. Entries of satisfaction 95. The registrar of companies, on evidence being given to his satisfaction with respect to any registered charge- 94 and release of property from charge. (a) that the debt for which the charge was given has been paid or satisfied in whole or in part; or (b) that part of the property or undertaking charged has been released from the charge or has ceased to form part of the company's property or undertaking, may enter on the register a memorandum of satisfaction in whole or in part, or of the fact that part of the property or undertaking has been released from the charge or has ceased to form part of the company's property or undertaking, as the case may be, and where he enters a memorandum of satisfaction in whole he shall, if required, furnish the company with a copy thereof. Rectification of register of charges or record of mortgages. 96.- The Court, on being satisfied that the omission to register a charge or to record a mortgage within the time required by this Law or that the omission or misstatement of any particular with respect to any such charge or mortgage or in a memorandum of satisfaction or cancellation of mortgage, was accidental, or due to inadvertence or to some other sufficient cause, or is not of a nature to prejudice the position of creditors or shareholders of the company, or that on other grounds it is just and equitable to grant relief, may, on the application of the company or any person interested, and on such terms and conditions as seem to the Court just and expedient, order that the time for registration or recording shall be extended, or, as the case may be, that the omission or mis- statement shall be rectified. Registration of enforcement of security. 97.- (1) If any person obtains an order for the appointment of a receiver or manager of the property of a company, or appoints such a receiver or manager under any powers contained in any instrument, he shall, within seven days from the date of the order or of the appointment under the said powers, give notice of the fact to the registrar of companies, and the registrar shall, on payment of such fee as may be specified by regulations made by the Council of Ministers, enter the fact in the register of charges. (2) Where any person appointed receiver or manager of the property of a company under the powers contained in any instrument ceases to act as such receiver or manager, he shall, on so ceasing, give the registrar of companies notice to that effect, and the registrar shall enter the notice in the register of charges. 4 of 166 of 1987. (3) If any person makes default in complying with the requirements of this section, he shall be liable to a fine not exceeding two hundred thirteen euros for every day during which the default continues. Provisions as to Company's Register of Charges and Book of Mortgages and as to Copies of Instruments creating Charges and Mortgages Copies of instruments 98. Every company shall cause a copy of every instrument creating any 95 creating charges and mortgages to be kept by company. charge requiring registration or any mortgage requiring recording under this Part to be kept at the registered office of the company: Provided that, in the case of a series of uniform debentures, a copy of one debenture of the series shall be sufficient. Company’s register of charges and book of mortgages. 99.- (1) Every company shall keep at the registered office of the company a register of charges and enter therein all charges specifically affecting property of the company and all floating charges on the undertaking or any property of the company, giving in each case a short description of the property charged, the amount of the charge, and, except in the case of securities to bearer, the names of the persons entitled thereto and a book wherein to record particulars of every mortgage on the company's immovable property effected under any Law relating to the registration of mortgages of immovable property in force for the time being. 4 of 166 of 1987. (2) If any officer of the company knowingly and wilfully authorizes or permits the omission of any entry required to be made in pursuance of this section, he shall be liable to a fine not exceeding four hundred twenty-seven euros. Right to inspect. 100.- (1) The copies or instruments creating any charge requiring registration and the particulars of mortgages requiring recording under this Part with the registrar of companies, and the register of charges and book of mortgages kept in pursuance of section 99, shall be open during business hours (but subject to such reasonable restrictions as the company in general meeting may impose, so that not less than two hours in each day shall be allowed for inspection) to the inspection of any creditor or member of the company without fee, and the register of charges and book of mortgages shall also be open to the inspection of any other person on payment of such fee, not exceeding 0,0854 euros for each inspection, as the company may prescribe. 4 of 166 of 1987. (2) If inspection of the said copies or register or book is refused, every officer of the company who is in default shall be liable to a fine not exceeding forty-two euros and a further fine not exceeding forty-two euros for every day during which the refusal continues. (3) If any such refusal occurs in relation to a company registered in the Republic, the Court may by order compel an immediate inspection of the copies, register or book. Application of Part III to Companies incorporated outside the Republic Application of Part III to charges and mortgages created, etc., by company incorporated outside the 101. The provisions of this Part shall extend to charges and mortgages on property in the Republic which are created or effected, and to charges on property in the Republic which is acquired, by a company (whether a company within the meaning of this Law or not) incorporated outside the Republic which has an established place of business in the Republic and has been registered as an overseas company pursuant to the provisions of section 347. 96 Republic. 13 (a) of 99(I) of 2009 13(b) of 99 (I) of 2009. PART IV. MANAGEMENT AND ADMINISTRATION 3 of 151(I) 2000. Registered Office, Publication of Name and Recording of Data in Commercial Documents Registered office of company. 102.- (1) A company shall, as from the day on which it begins to carry on business or as from the fourteenth day after the date of its incorporation, whichever is the earlier, have a registered office in the Republic to which all communications and notices may be addressed. (2) Notice of the situation of the registered office, and of any change therein, shall be given within fourteen days after the date of the incorporation of the company or of the change, as the case may be, to the registrar of companies, who shall record the same. The inclusion in the annual return of a company of a statement as to the address of its registered office shall not be taken to satisfy the obligation imposed by this subsection. (3) If default is made in complying with this section, the company and every officer of the company who is in default shall be liable to a default fine. Publication of name by recording of data in commercial documents. 4(a) of 151(I) of 2000. 103.- (1) Every company- (a) shall paint or affix, and keep painted or affixed, its name on the outside of every office or place in which its business is carried on, in a conspicuous position, in letters easily legible; (b) shall have its name engraven in legible characters on its seal; 4(b) of 151(I) of 2000. (c) shall have mentioned in legible characters in all business letters of the company and in all notices and other official publications of the company, and in all bills of exchange, promissory notes, endorsements, cheques and orders for money or goods purporting to be signed by or on behalf of the company, and in all bills of parcels, invoices, receipts and letters of credit of the company; 4(c) of 151(I) of 2000. (i) the name of the company; (ii) the number of registration of the company; (iii) whether it concerns a private or a public company; (iv) the registered office of the company; (v) if in the documents mention is made of the capital of the 97 company, the reference must mention the allotted and paid capital; (vi) if there is good reason, the stage of the liquidation in which the company finds itself. 3(a) of 71(I) of 2007. (1A) In case a company possesses a website, the said website, shall include items (i) to (vi) of paragraph (c) of subsection (1); and 4(d) (i)of 151(I) of 2000 4(d) (ii) of 151(I) of 2000. 4 of 166 of 1987. (2) If a company does not publish its name and does not record in the documents mentioned in paragraph (c) of subsection (1) the data enumerated in subparagraphs (i) – (vi) of paragraph (c) of subsection (1) in manner directed by this Law, the company and every officer thereof who is in default shall be liable to a fine not exceeding two hundred thirteen euros, and if a company does not keep its name painted or affixed in manner so directed, the company and every officer of the company who is in default shall be liable to a default fine. 4 of 166 of 1987. (3) If a company fails to comply with paragraph (b) or paragraph (c) of subsection (1), the company shall be liable to a fine not exceeding four hundred twenty-seven euros. (4) If an officer of a company or any person on its behalf: (a) uses or authorizes the use of any seal purporting to be a seal of the company whereon its name is not so engraved as aforesaid; or (b) issues or authorizes the issue of any business letter of the company or any notice or other official publication of the company, or signs or authorizes to be signed on behalf of the company any bill of exchange, promissory note, endorsement, cheque, or order for money or goods wherein its name is not mentioned in manner aforesaid; or (c) issues or authorizes the issue of any bill of parcels, invoice, receipt or letter of credit of the company wherein its name is not mentioned in manner aforesaid; 4 of 166 of 1987. he shall be liable to a fine not exceeding four hundred twenty-seven euros, and shall further be personally liable to the holder of the bill of exchange, promissory note, cheque or order for money or goods for the amount thereof unless it is duly paid by the company. 3(b) of 71(I) of 2007. (5) In case the website of the company does not include items (i) to (vi) of paragraph (c) of subsection (1), the said company and every officer who is responsible for the omission shall be liable to a fine not exceeding eight hundred fifty - four euros. Restrictions on Commencement of Business Restrictions on commencement of business. 104.- (1) Where a company having a share capital has issued a prospectus inviting the public to subscribe for its shares, the company shall not commence any business or exercise any borrowing powers 98 unless- (a) shares held subject to the payment of the whole amount thereof in cash have been allotted to an amount not less in the whole than the minimum subscription; and (b) every director of the company has paid to the company, on each of the shares taken or contracted to be taken by him and for which he is liable to pay in cash, a proportion equal to the proportion payable on application and allotment on the shares offered for public subscription; and (c) there has been delivered to the registrar of companies for registration a statutory declaration by the secretary or one of the directors, in the prescribed from, that the aforesaid conditions have been complied with. (2) Where a company having a share capital has not issued a prospectus inviting the public to subscribe for its shares, the company shall not commence any business or exercise any borrowing powers unless: (a) there has been delivered to the registrar of companies for registration a statement in lieu of prospectus; and (b) every director of the company has paid to the company, on each of the shares taken or contracted to be taken by him and for which he is liable to pay in cash, a proportion equal to the proportion payable on application and allotment on the shares payable in cash; and (c) there has been delivered to the registrar of companies for registration a statutory declaration by the secretary or one of the directors, in the prescribed form, that paragraph (b) of this subsection has been complied with. 24(a) of 70(I) of 2003. (3) (a) A company shall not be entitled to commence business activities, nor undertake loans or related obligations if it has not first been supplied with a certificate from the Registrar which confirms that the nominal value of its subscribed share capital is equal to at least the minimum amount provided for in section 4A. (b)The Registrar shall issue the above certificate, if the company delivers to him- (i) a statutory declaration from which the following is evident- (a) its nominal capital which cannot be lower than that provided in section 4A; (b) the amount of the share capital which has been paid up; (c) a budget of the initial expenses of the company, together with an account of the amount already paid and of the obligations undertaken; 99 (d) a budget of the expenses for services of registration advisors, together with an account of the amount already paid and of the relevant obligations undertaken, (ii) confirmation by a Bank, which has its registered office or its place of business in the Republic, as to the payment of an amount equal to at least the amount provided for in section 4A into an account which the company holds with such Bank. 24(b) of 70(I) of 2003. (4) The registrar of companies shall, on the delivery to him of the said statutory declarations, and, in the case of a company which is required by this section to deliver a statement in lieu of prospectus, of such a statement, certify that the company is entitled to commence business, and that certificate shall be conclusive evidence that the company is so entitled. 24(c) of 70(I) of 2003. (5) Any contract made by a company before the date at which it is entitled to commence business shall be provisional only, and shall not be binding on the company until that date, and on that date it shall become binding. 4 of 166 of 1987. (6) If any company commences business or exercises borrowing powers in contravention of this section, every person who is responsible for the contravention shall, without prejudice to any other liability, be liable to a fine not exceeding four hundred twenty seven euros for every day during which the contravention continues. (7) Nothing in this section shall apply to a private company. Register of Members Register of members. 105.- (1) Every company shall keep a register of its members and enter therein the following particulars:- (a) the names and addresses of the members, and in the case of a company having a share capital, a statement of the shares held by each member, distinguishing each share by its number so long as the share has a number, and of the amount paid or agreed to be considered as paid on the shares of each member; (b) the date at which each person was entered in the register as a member; (c) the date at which any person ceased to be a member: Provided that, where the company has converted any of its shares into stock and given notice of the conversion to the registrar of companies, the register shall show the amount of stock held by each member instead of the amount of shares and the particulars relating to shares specified in paragraph (a) of this subsection. (2) The register of members shall be kept at the registered office of the 100 company: Provided that- (a) if the work of making it up is done at another office of the company, it may be kept at that other office; and (b) if the company arranges with some other person for the making up of the register to be undertaken on behalf of the company by that other person, it may be kept at the office of that other person at which the work is done, so, however, that it shall not be kept, in the case of a company registered in the Republic, at a place outside the Republic. (3) Every company shall send notice to the registrar of companies of the place where its register of members is kept and of any change in that place: Provided that a company shall not be bound to send notice under this subsection where the register has, at all times since it came into existence, or, in the case of a register in existence at the commencement of this Law, at all times since then, been kept at the registered office of the company. (4) Where a company makes default in complying with subsection (1) or makes default for fourteen days in complying with subsection (3), the company and every officer of the company who is in default shall be liable to a default fine. Index of members. 106.- (1) Every company having more than fifty members shall, unless the register of members is in such a form as to constitute in itself an index, keep an index of the names of the members of the company and shall, within fourteen days after the date on which any alteration is made in the register of members, make any necessary alteration in the index. (2) The index shall in respect of each member contain a sufficient indication to enable the account of that member in the register to be readily found. (3) The index shall be at all times kept at the same place as the register of members. (4) If default is made in complying with this section, the company and every officer of the company who is in default shall be liable to a default fine. Provisions as to entries in register in relation to share warrants. 107.- (1) On the issue of a share warrant the company shall strike out of its register of members the name of the member then entered therein as holding the shares specified in the warrant as if he had ceased to be a member, and shall enter in the register the following particulars, namely:- (a) the fact of the issue of the warrant; 101 (b) a statement of the shares included in the warrant, distinguishing each share by its number so long as the share has a number; and (c) the date of the issue of the warrant. (2) The bearer of a share warrant shall, subject to the articles of the company, be entitled, on surrendering it for cancellation, to have his name entered as a member in the register of members. (3) The company shall be responsible for any loss incurred by any person by reason of the company entering in the register the name of a bearer of a share warrant in respect of the shares therein specified without the warrant being surrendered and cancelled. (4) Until the warrant is surrendered, the particulars specified in subsection (1) shall not be deemed to be the particulars required by this Law to be entered in the register of members, and, on the surrender, the date of the surrender must be entered. (5) Subject to the provisions of this Law, the bearer of a share warrant may, if the articles of the company so provide, be deemed to be a member of the company within the meaning of this Law, either to the full extent or for any purposes defined in the articles. Inspection of register and index. 6(a) of 76 of 1977. 108.- (1) Except when the register of members is closed under the provisions of this Law, the register, and index of the names of the members of a company shall, during business hours (subject to such reasonable restrictions as the company in general meeting may impose, so that not less than two hours in each day be allowed for inspection) be open to the inspection of any member without charge and of any other person on payment of 0,3416 euros, or such less sum as the company may prescribe, for each inspection. 6(b) of 76 of 1977. (2) Any member or other person may require a copy of the register, or of any part thereof, on payment of 0.0854 euros, or such less sum as the company may prescribe, for every hundred words or part thereof required to be copied. The company shall cause any copy so required by any person to be sent to that person within a period of ten days commencing on the day next after the day on which the requirement is received by the company. 4 of 166 of 1987. 4 of 166 of 1987. (3) If any inspection required under this section is refused or if any copy required under this section is not sent within the proper period, the company and every officer of the company who is in default shall be liable in respect of each offence to a fine not exceeding forty-two euros and further to a default fine of forty-two euros. (4) In the case of any such refusal or default, the Court may by order compel an immediate inspection of the register and index or direct that the copies required shall be sent to the persons requiring them. 102 Consequences of failure to comply with requirements as to register owing to agent’s default. 109. Where, by virtue of proviso (b) to subsection (2) of section 105, the register of members is kept at the office of some person other than the company, and by reason of any default of his the company fails to comply with subsection (3) of that section, subsection (3) of section 106, or section 108 or with any requirements of this Law as to the production of the register, that other person shall be liable to the same penalties as if he were an officer of the company who was in default, and the power of the Court under subsection (4) of section 108 shall extend to the making of orders against that other person and his officers and servants. Power to close register. 110. A company may, on giving notice by advertisement in some newspaper circulating in the district in which the registered office of the company is situate, close the register of members for any time or times not exceeding in the whole thirty days in each year. Power of Court to rectify register. 111.- (1) If- (a) the name of any person is, without sufficient cause, entered in or omitted from the register of members of a company; or (b) default is made or unnecessary delay takes place in entering on the register the fact of any person having ceased to be a member, the person aggrieved, or any member of the company, or the company, may apply to the Court for rectification of the register. (2) Where an application is made under this section, the Court may either refuse the application or may order rectification of the register and payment by the company of any damages sustained by any party aggrieved. (3) On an application under this section the Court may decide any question relating to the title of any person who is a party to the application to have his name entered in or omitted from the register, whether the question arises between members or alleged members, or between members or alleged members on the one hand and the company on the other hand, and generally may decide any question necessary or expedient to be decided for rectification of the register. (4) In the case of a company required by this Law to send a list of its members to the registrar of companies, the Court, when making an order for rectification of the register shall by its order direct notice of the rectification to be given to the registrar. Trusts not to be entered on register in the Republic. 112. No notice of any trust, expressed, implied or constructive, shall be entered on the register, or be receivable by the registrar, in the case of companies registered in the Republic. Register to be evidence. 113. The register of members shall be prima facie evidence of any matters by this Law directed or authorized to be inserted therein. 103 Notification of transfer of shares. 2 of 15(I) of 1995. 113A.- (1)Any transfer of shares of a private company with a share capital shall be notified to the Registrar of Companies in the form determined by the Registrar, within fourteen days from the registration of this transfer in its register of members. (2) The said notification shall include the following: (a) The names and addresses of the old and new members; (b) the number of shares held by the members existing at the date of the notification; and (c) details of the shares which have been transferred from- (i) persons which continue to be members; and (ii) persons which have ceased to be members, meaning the number of shares and the date of the registration of the transfer. 18 of 99(I) of 2009. Overseas Register Power of a company to keep overseas register. 14 of 99(I) of 2009. 114.- (1) A company with a share capital, the objects of which include the transaction of business in any place outside the Republic or the shares of which are negotiated in a foreign market , and/or the members of which reside in any place outside the Republic, may cause to be kept in such place, in which it transacts business or in which the relevant market is situated or in which its members reside, a branch register of members (in this Law called an “overseas register”). (2) The company shall give to the registrar of companies notice, of the situation of the office where any overseas register is kept and of any change in its situation and, if it is discontinued of its discontinuance, and any such notice shall be given within fourteen (14) days from the date of the commencement of the operation of the office or of the change or of the discontinuance, as the case may be. 99 (I) of 2009. (3) References to a colonial register or to a dominion register occuring in any articles, registered before the commencement of application of the Companies (Amendment) (No.3) Law, 2009, shall be construed as references to an overseas register. Overseas register. 14 of 99(I) of 2009. 115.- (1) An overseas register shall be deemed to be part of the company’s register of members , which in this section is called ‘the principal register”. (2) The overseas register shall be kept in the same manner, in which the principal register should be kept under the Law, with the exception that- 104 (a) the relevant advertisement, before the closure of the register, shall be inserted in a newspaper circulating in the district where the overseas register is kept, (b) any competent court at the location abroad where the register is kept, may exercise the same power to rectify the register, as it is exercised by the court pursuant to this Law, and (c) the offences of refusing inspection or providing copies of the overseas register and of authorizing or permitting such refusal may be prosecuted summarily before any court at that location, abroad. (3) Each company which keeps an overseas register- (a) shall send, to its registered office, a copy of each entry in the overseas register, immediately after the making of the entry; and (b) shall ensure that a copy of its overseas register is kept in the place where the principal register of the company is kept, and that it is from time to time duly updated and every such copy, for all purposes of this Law, shall be deemed to be part of the principal register. (4) Subject to the provisions of this section in relation to the copy of the register, the shares registered in the overseas register shall be distinguished from the shares registered in the principal register, and no action in relation to any shares registered in an overseas register shall during the continuation of that registration be registered in any other register. (5) A company may terminate the keeping of an overseas register, and immediately all entries in such register shall be transferred to another overseas register which is kept by the company at the same place abroad or in the principal register. (6) Subject to the provisions of this Law, any company may include such provisions in its articles as it may think fit in relation to the keeping of overseas registers. (7) If a company fails to comply with the provisions of subsection (3), the company as well as every one of its officers shall commit an offence and shall on conviction be liable to a default fine and, where by virtue of proviso (b) to subsection (2) of section 105, the principal register is kept at the office of a person other than the company and by reason of any default of his the company fails to comply with paragraph (b) of subsection (3) such person shall be liable to the same penalty as if he were an officer of the company who was in default. Transfer of shares registered in the overseas register. 14 of 99(I) of 116. The transfer of a share, registered in an overseas register, shall be considered as a transfer of the company’s property situate out of the Republic. 105 2009. Branch registers kept in the Republic. 14 of 99(I) of 2009. 117. If, pursuant to the law applicable in any place outside the Republic, companies incorporated under that law have the power to keep branch registers of their members which reside in the Republic, the Council of Ministers may, with an order published in the Official Gazette of the Republic, order that subsection (2) of section 105, excluding its proviso, and sections 108 and 111, shall, subject to any alterations and adjustments defined in the said order, apply to and in relation to such branch registers which are kept in the Republic, as they apply to and in relation to registers of members within the meaning of this Law. Keeping of a register of members by certain public companies. 15 of 99(I) of 2009. 117A. (1) In case of any public company the shares or other securities or transferrable securities of which are listed in a foreign market, such company shall be considered as complying with the provisions of this Law in relation to the keeping of a register of members, as long as the relevant rules of the relevant market are complied with. Cap. 149. 22(I) of 1995. (2) In the cases referred to in subsection (1) above, the provisions of the Contract Law for the pledge of share certificates shall not apply, but, in relation to the pledge of such shares, the rules of the relevant market will apply. Annual Return Annual return to be made by company having a share capital. Sixth Schedule. 118.- (1) Every company having a share capital shall, once at least in every year, make a return containing with respect to the registered office of the company, registers of members and debenture holders, shares and debentures, indebtedness, past and present members and directors and secretary, the matters specified in Part I of the Sixth Schedule, and the said return shall be in the form set out in Part II of that Schedule or as near thereto as circumstances admit: Provided that:- (a) a company need not make a return under this subsection either in the year of its incorporation or, if it is not required by section 125 to hold an annual general meeting during the following year, in that year; Sixth Schedule Part I. (b) where the company has converted any of its shares into stock and given notice of the conversion to the registrar of companies, the list referred to in paragraph 5 of Part I on the said Sixth Schedule must state the amount of stock held by each of the existing members instead of the amount of shares and the particulars relating to shares required by that paragraph; and (c) the return may, in any year, if the return for either of the two immediately preceding years has given, as at the date of that return, the full particulars required by the said paragraph 5, given only such of the particulars required by that paragraph as relate to persons ceasing to be or becoming members since the date of the last return and to shares transferred since that date or to changes as compared with that date in 106 the amount of stock held by a member. 18 of 99(I) of 2009. (2) In the case of a company keeping an overseas register- (a) references in proviso (c) to subsection (1) to the particulars required by the said paragraph 5 shall be taken as not including any such particulars contained in the overseas register, in so far as copies of the entries containing those particulars are not received at the registered office of the company before the date when the return in question is made; and 16 of 99(I) of 2009. (b) where an annual return is made between the date when any entries are made in the overseas register and the date when copies of those entries are received at the registered office of the company, the particulars contained in those entries, so far as relevant to an annual return, shall be included in the next or a subsequent annual return as may be appropriate having regard to the particulars included in that return with respect to the company's register of members. (3) If a company fails to comply with this section, the company and every officer of the company who is in default shall be liable to a default fine. (4) For the purposes of this section and of Part I of the Sixth Schedule, the expressions \"director\" and \"officer\" shall include any person in accordance with whose directions or instructions the directors of the company are accustomed to act. Annual return to be made by company not having a share capital. 119.- (1) Every company not having a share capital shall, once at least in every calendar year, make a return stating- (a) the address of the registered office of the company; (b) in a case in which the register of members is, under the provisions of this Law, kept elsewhere than at that office, the address of the place where it is kept; (c) in a case in which any register of holders of debentures of the company is, under the provisions of this Law, kept elsewhere than at the registered office of the company, the address of the place where it is kept; (d) all such particulars with respect to the persons who at the date of the return are the directors of the company and any person who at that date is secretary of the company as are by this Law required to be contained with respect to directors and the secretary respectively in the register of directors and secretaries of a company: Provided that a company need not make a return under this subsection either in the year of its incorporation or, if it is not required by section 125 to hold an annual general meeting during the following year, in that year. (2) There shall be annexed to the return a statement containing 107 particulars of the total amount of the indebtedness of the company in respect of all charges and mortgages which are required to be registered or recorded with the registrar of companies under this Law or which would have been required so to be registered if created after the 1st day of July, 1922. (3) If a company fails to comply with this section, the company and every officer of the company who is in default shall be liable to a default fine. (4) For the purposes of this section the expressions “officer” and \"director\" shall include any person in accordance with whose directions or instructions the directors of the company are accustomed to act. Time for completion of annual return. 120.- (1) The annual return must be completed within forty-two days after the annual general meeting for the year, whether or not that meeting is the first or only ordinary general meeting, or the first or only general meeting, of the company in the year, and the company must forthwith forward to the registrar of companies a copy signed both by a director and by the secretary of the company. 6(a) of 70(I) of 2007. (2) If a company fails to comply with this section, the company and every officer of the company who is in default shall commit a criminal offence, and, on conviction thereof shall be liable to a default fine. For the purposes of this subsection the expression \"officer\" shall include any person in accordance with whose directions or instructions the directors of the company are accustomed to act. 6(b) of 70(I) of 2007. (3)In addition and notwithstanding the provisions of subsection (2), if the company omits to comply with this section, the registrar of companies may impose on it an administrative fine not exceeding eight thousand, five hundred and forty-three euros. Documents to be annexed to annual return. 3(a) of167(I) of 2003. 121.- (1) (a) Subject to the provisions of this Law, and without prejudice to paragraph (b), there shall be annexed to the annual return copies of all documents presented to the general meeting of the company in accordance with subsection (1) of section 152. (b)The obligation to annex in accordance with paragraph (a), shall not apply- (i) to any optional statements presented by the company; and (ii) to the directors’ report, but only if a copy thereof is available to the public. 3(b) of 167(I) of 2003. (2) Deleted. 7(a) of 70(I) of 2007. (3) If a company fails to comply with this section, the company and 108 every officer of the company who is in default shall commit a criminal offence and, on conviction thereof shall be liable to a default fine. For the purposes of this subsection, the expression ‘’officer’’ shall include any person in accordance with whose directions or instructions the directors of the company are accustomed to act. 7(b) of 70(I) of 2007. (3A) In addition and notwithstanding the provisions of subsection (3), if the company omits to comply with this section, the registrar of companies may impose on it an administrative fine not exceeding eight thousand, five hundred and forty three euros.(€8,543) Fifth Table. 61 of 27 of 1967. (4) This section shall not apply to an insurance company that has complied with the provisions of subsection (4) of section 26 of the Insurance Companies Law of 1967. Certificates to be sent by private company with annual return. 122. A private company shall send with the annual return required by section 118 a certificate signed both by a director and by the secretary of the company that the company has not, since the date of the last return, or, in the case of a first return, since the date of the incorporation of the company, issued any invitation to the public to subscribe for any shares or debentures of the company, and, where the annual return discloses the fact that the number of members of the company exceeds 50, also a certificate so signed that the excess consists wholly of persons who under paragraph (b) of subsection (1) of section 29 are not to be included in reckoning the number of fifty. 4 of 167 (I) of 2003. 123. Repealed. Meetings and Proceedings Statutory meeting and statutory report. 124.- (1) Every company limited by shares and every company limited by guarantee and having a share capital shall, within a period of not less than one month nor more than three months from the date at which the company is entitled to commence business, hold a general meeting of the members of the company, which shall be called the \"statutory meeting\". (2) The directors shall, at least fourteen days before the day on which the meeting is held, forward a report (in this Law referred to as the \"statutory report\") to every member of the company: Provided that if the statutory report is forwarded later than is required by this subsection, it shall, notwithstanding that fact, be deemed to have been duly forwarded if it is so agreed by all the members entitled to attend and vote at the meeting. (3) The statutory report shall be certified by not less than two directors of the company and shall state- (a) the total number of shares allotted, distinguishing shares allotted as fully paid or partly paid up otherwise than in cash, and stating in the case of shares partly paid up the extent to which they are so paid up, 109 and in either case the consideration for which they have been allotted; (b) the total amount of cash received by the company in respect of all the shares allotted, distinguished as aforesaid; (c) an abstract of the receipts of the company and of the payments made thereout, up to a date within seven days of the date of the report, exhibiting under distinctive headings the receipts of the company from shares and debentures and other sources, the payments made thereout, and particulars concerning the balance remaining in hand, and an account or estimate of the preliminary expenses of the company; (d) the names, addresses, and descriptions of the directors, auditors, if any, managers, if any, and secretary of the company; and (e) the particulars of any contract the modification of which is to be submitted to the meeting for its approval, together with the particulars of the modification or proposed modification. (4) The statutory report shall, so far as it relates to the shares allotted by the company, and to the cash received in respect of such shares, and to the receipts and payments of the company on capital account, be certified as correct by the auditors, if any, of the company. (5) The directors shall cause a copy of the statutory report, certified as required by this section, to be delivered to the registrar of companies for registration forthwith after the sending thereof to the members of the company. (6) The directors shall cause a list showing the names, descriptions and addresses of the members of the company, and the number of shares held by them respectively, to be produced at the commencement of the meeting and to remain open and accessible to any member of the company during the continuance of the meeting. (7) The members of the company present at the meeting shall be at liberty to discuss any matter relating to the formation of the company, or arising out of the statutory report, whether previous notice has been given or not, but no resolution of which notice has not been given in accordance with the articles may be passed. (8) The meeting may adjourn from time to time, and at any adjourned meeting any resolution of which notice has been given in accordance with the articles, either before or subsequently to the former meeting, may be passed, and the adjourned meeting shall have the same powers as an original meeting. 4 of 166 of 1987. (9) In the event of any default in complying with the provisions of this section, every director of the company who is knowingly and wilfully guilty of the default, or, in the case of default by the company, every officer of the company who is in default shall be liable to a fine not exceeding four 110 hundred twenty-seven euros. (10) This section shall not apply to a private company. Annual general meeting. 125.- (1) Every company shall in each year hold a general meeting as its annual general meeting in addition to any other meetings in that year, and shall specify the meeting as such in the notices calling it; and not more than fifteen months shall elapse between the date of one annual general meeting of a company and that of the next: Provided that, so long as a company holds its first annual general meeting within eighteen months of its incorporation, it need not hold it in the year of its incorporation or in the following year. (2) If default is made in holding a meeting of the company in accordance with subsection (1), the Council of Ministers may, on the application of any member of the company, direct the calling of a general meeting of the company, and give such ancillary or consequential directions as the Council of Ministers thinks expedient, including the directions modifying or supplementing, in relation to the calling, holding and conducting of the meeting, the operation of the company's articles; and it is hereby declared that the directions that may be given under this subsection include a direction that one member of the company present in person or by proxy shall be deemed to constitute a meeting. (3) A general meeting held in pursuance of subsection (2) shall, subject to any directions of the Council of Ministers, be deemed to be an annual general meeting of the company; but, where a meeting so held is not held in the year in which the default in holding the company's annual general meeting occurred, the meeting so held shall not be treated as the annual general meeting for the year in which it is held unless at that meeting the company resolves that it shall be so treated. (4) Where a company resolves that a meeting shall be so treated, a copy of the resolutions shall, within fifteen days after the passing thereof, be forwarded to the registrar of companies and recorded by him. 4 of 166 of 1987. 4 of 166 of 1987. (5) If default is made in holding a meeting of the company in accordance with subsection (1), or in complying with any of the directions of the Council of Ministers under subsection (2), the company and every officer of the company who is in default shall be liable to a fine not exceeding four hundred twenty seven euros, and if default is made in complying with subsection (4), the company and every officer of the company who is in default shall be liable to a default fine of forty-two euros. Convening of extraordinary general meeting on requisition. 126.- (1) The directors of a company, notwithstanding anything in its articles, shall, upon the requisition of members of the company holding at the date of the deposit of the requisition not less than one tenth of such of the paid up capital of the company as at the date of the deposit carries the right of voting at general meetings of the company or, in the case of a company not having a share capital, members of the company representing not less than one tenth of the total voting rights of all the 111 3 of 60(I) of 2010. members having at the said date a right to vote at general meetings of the company, forthwith proceed duly to convene an extraordinary general meeting of the company. (1A) Notwithstanding the provisions of subsection (1), or anything contained in its articles, the directors of a listed company in a regulated market, shall, on the requisition of members of the company who on the date of the deposit of the requisition hold not less than one twentieth of the paid up capital of the company which at the date of the deposit confers voting rights at general meetings of the company, forthwith proceed duly to convene an extraordinary general meeting of the company. (2) The requisition must state the objects of the meeting, and must be signed by the requisitionists and deposited at the registered office of the company, and may consist of several documents in like form each signed by one or more requisitionists. (3) If the directors do not, within twenty-one days from the date of the deposit of the requisition proceed duly to convene a meeting, the requisitionists, or any of them representing more than one half of the total voting rights of all of them, may themselves convene a meeting, but any meeting so convened shall not be held after the expiration of three months from the said date. (4) A meeting convened under this section by the requisitionists shall be convened in the same manner, as nearly as possible, as that in which meetings are to be convened by directors. (5) Any reasonable expenses incurred by the requisitionists by reason of the failure of the directors duly to convene a meeting shall be repaid to the requisitionists by the company, and any sum so repaid shall be retained by the company out of any sums due or to become due from the company by way of fees or other remuneration in respect of their services to such of the directors as were in default. (6) For the purposes of this section the directors shall, in the case of a meeting at which a resolution is to be proposed as a special resolution, be deemed not to have duly convened the meeting if they do not give such notice thereof as is required by section 135. Equal treatment of shareholders. 4 of 60(I) of 2010. 126A. A company listed in a regulated market shall ensure equal treatment for all members who are in the same position with regard to the exercise of voting rights and participation in a general meeting. Length of notice for calling meetings. 127.- (1) Any provision of a company's articles shall be void in so far as it provides for the calling of a meeting of the company, other than an adjourned meeting, by a shorter notice than- 5 (1) of 60(I) of 2010. (a) in the case of the annual general meeting, twenty-one days’ notice in writing; 112 5(2) of 60(I) of 2010. 5 (3) of 60(I) of 2010. 41 (I) of 2007 47 (I) of 2009. (b) in the case of a meeting other than an annual general meeting or a meeting for the passing of a special resolution, fourteen days’ notice in writing; and (c) without prejudice to subsection (4) of section 35 of the Public Takeover Bids Laws and of the corresponding provisions of other member states that were enacted in order to comply with articles 9(4) and 11(4) of Directive 2004/25/EC in the case of a company listed in a regulated market: (i) in the case of an annual general meeting, twenty-one days’ of written notice; and (ii) in the case of a general meeting (other than an annual general meeting or a meeting for the approval of a special resolution) fourteen days of written notice where- (a) the company listed in a regulated market offers technical facilitation to its members in order to vote through electronic means, which is accessible to all members holding shares carrying voting rights at general meetings; and (b) a special resolution, that shortens the notice period to fourteen days, has been approved in the immediately preceding annual general meeting, or at a general meeting that was conducted after that meeting. (2) Save in so far as the articles of a company make other provision in that behalf, not being a provision avoided by subsection (1), a meeting of the company, other than an adjourned meeting, may be called: (a) in the case of the annual general meeting, by twenty-one days’ notice in writing; and 5 (4) of 60(I) of 2010. (b) in the case of a meeting other than an annual general meeting or a meeting for the passing of a special resolution, by fourteen days' notice in writing. (c) Without prejudice to subsection (4) of section 35 of the Public Takeover Bids Laws in the case of a company listed in a regulated market: (i) in the case of an annual general meeting, twenty-one days of written notice; and (ii) in the case of a general meeting (other than an annual general meeting or a meeting for the approval of a special resolution) fourteen days of written notice where:- (a) the company listed in a regulated market offers technical facilitation to its members in order to vote through electronic 113 means, which is accessible to all members holding shares carrying voting rights at general meetings; and (b) a special resolution, that shortens the notice period to fourteen days, has been approved in the immediately preceding annual general meeting, or at a general meeting that was conducted after that meeting. 5 (5) of 60(I) of 2010. (3) A meeting of a company other than a company listed in a regulated market shall, notwithstanding that it is called by shorter notice than that specified in subsection (2) or in the company's articles, as the case may be, be deemed to have been duly called if it is so agreed: (a) in the case of a meeting called as the annual general meeting, by all the members entitled to attend and vote thereat; and (b) in the case of any other meeting, by a majority in number of the members having a right to attend and vote at the meeting, being a majority together holding not less than ninety-five per cent in nominal value of the shares giving a right to attend and vote at the meeting, or, in the case of a company not having a share capital, together representing not less than ninety-five per cent of the total voting rights at that meeting of all the members. Information prior to the general meeting. 6 of 60(I) of 2010. 127A.- (1) Notwithstanding the provisions of section 10 or anything contained in its articles, the following provisions shall apply with regard to a company listed in a regulated market. (2) A notice for the calling of a general meeting shall be issued, free of charge, in a manner ensuring fast access to it on a non-discriminatory basis, using such media as may reasonably be relied upon for the effective dissemination of information to the public throughout the member states. (3)The notice for the calling of the general meeting pursuant to paragraph (c) of subsection (1) and paragraph (c) of subsection (2) of section 133 shall indicate: (a) when and where the general meeting is to take place and the proposed agenda for the general meeting; (b) a clear and precise description of any procedures that shareholders must comply with in order to be able to participate and to vote in the meeting, including- (i) the right of the member to add items on the agenda of the general meeting, to table draft resolutions pursuant to section 127B and to ask questions related to items on the agenda of the general meeting pursuant to section 128C and the deadlines by which those rights may be exercised; (ii) the right of a member who is entitled to participate, to speak, 114 ask questions and vote, to appoint a proxy pursuant to section 130, including a proxy who is not a member, through electronic means or otherwise or, where permitted, to appoint one or more proxies, each one in order for them to participate, speak, ask questions and vote in the member’s place; (iii) the right to ask questions and the obligation to answer are subject to the measures that may be taken by the Republic or are allowed to be taken by companies, in order to ensure the identification of shareholders, the good order of general meetings and their preparation and the protection of confidentiality and business interests of companies listed in a regulated market. Companies listed in a regulated market may provide one overall answer to questions having the same content. Companies listed in a regulated market shall be deemed to have given an answer if the relevant information is already available on the website of a company listed in a regulated market in a question and answer format; (iv) the procedure for voting by proxy pursuant to section 130, including the forms to be used and the means by which the company listed in a regulated market is prepared to accept electronic notification of the appointment of the proxy; (v) where applicable, the procedure that will be followed pursuant to sections 128B and 132 for electronic voting or voting by correspondence, respectively ; (c) the record date which will state that only those who are members on the record date shall have the right to participate and vote in the general meeting; (d) where and how the full and complete text of the documents and draft resolutions referred to in paragraphs (c) and (d) of subsection (4) may be obtained; and (e) the address of the website on which the information referred to in subsection (4) will be made available. (4) A company listed in a regulated market shall make available to its members on its website, for a continuous period beginning not later than the twenty-first day before the day of the general meeting, including the day of the meeting, the following- (a) the notice pursuant to subsection (2) of section 127A; (b) the total number of shares and voting rights at the date of the notice; (c) the documents to be submitted to the general meeting; (d) copies of the draft resolutions or where no resolution is proposed to be adopted, comments from the directors for each item on the 115 Right to put items on the agenda of the general meeting and to table draft resolutions. 6 of 60(I) of 2010. proposed agenda of the general meeting; (e) copies of the forms to be used by a proxy to vote and copies of the forms to be used to vote by correspondence, unless these forms have been sent directly to each member. (5) The company listed in a regulated market shall make available, on its website the draft resolutions tabled by members as soon as practicable after it has received same. (6) Where the forms referred to in paragraph (e) of subsection (4) cannot, for technical reasons, be made available on the website of the company listed in a regulated market, the company listed in a regulated market shall indicate on its website that the forms can be obtained on paper, and the company listed in a regulated market shall be required to send the forms by post and free of charge to every member who so requests. (7) Where the notice of the general meeting is issued later than the twenty-first day before the meeting pursuant to subparagraph (ii), of paragraph (c), of subsection (1) of section 127 or of subparagraph (ii), of paragraph (c), of subsection (2) of section 127 or of subsection (4) of section 35 of the Public Takeover Bids Laws, the period specified in subsection (4) shall be shortened accordingly. 127B.- (1) A member of a company listed in a regulated market, shall have the right through the use of electronic means or postal services, at the address designated by the listed company in a regulated market, to: (a) put items on the agenda of the annual general meeting, provided that each such item is accompanied by reasons which justify its inclusion or a draft resolution to be adopted in the general meeting; and (b) table draft resolutions as an item on the agenda of a general meeting, provided that the member or members in question hold at least five per cent (5%) of the issued share capital representing at least five per cent (5%) of the total voting rights of all members who have a right to vote at the general meeting with which this application is related to. (2) An application by a member to put items on the agenda or to table draft resolutions pursuant to paragraph (a) of subsection (1) must be received by the company listed in a regulated market in paper or electronic form at least forty-two days prior to the meeting to which the application relates to. (3) Where the exercise of the right conferred by paragraph (a) of subsection (1), entails a modification of the agenda for the annual general meeting, in cases where the agenda has already been communicated to the members, and only in those circumstances, the 116 company shall make available a revised agenda in the same manner as the previous agenda in advance of the applicable record date or, if no such record date applies, sufficiently in advance of the date of the annual general meeting so as to enable other members to appoint a proxy or, where applicable, to vote by correspondence. (4) In order to facilitate the member to take advantage of paragraph (a) of subsection (1), the company listed in a regulated market shall ensure that the date of its next annual general meeting is made available on its website:- (a) from the end of the previous financial year; or (b) not later than forty-five days prior to the annual general meeting, whichever is sooner. General provisions as to meetings and votes. 6(a) of 2(I) of 2000 6(b) of 2(I) of 2000 2(a) of 98(I) of 2012. 2(b) of 98(I) of 2012. 128.- (1) Subject to the provisions of subsection (2) the following provisions shall have effect in so far as the articles of the company do not make other provision in that behalf:- (a) notice of the meeting of a company shall be served on every member of the company in the manner in which notices are required to be served by Table A, and for the purpose of this paragraph the expression \"Table A\" means that Table as for the time being in force: Provided that, notice for the calling of a meeting of a public company listed on the Cyprus Stock Exchange, may be done by an announcement by the company on its website and in that case by publication also in the daily press: Provided further that, for any further related explanation or information, the publication in the daily press may direct the shareholders of the company to the company itself or to its website; (b) two or more members holding not less than one tenth of the issued share capital, or, if the company has not a share capital, not less than five per cent in number of the members of the company may call a meeting; 6(c) of 2(I) of 2000. (c) in the case of a private company with more than one members, and in the case of any other company three members, personally present shall be a quorum; (d) any member elected by the members present at a meeting may be chairman thereof; (e) in the case of a company originally having a share capital, every member shall have one vote in respect of each share or each seventeen euros of stock held by him, and in any other case every member shall have one vote. 6(d) of 2(I) of (2) In the case of a private company with one and only member, the 117 2000. Requirements for participation and voting in the general meeting. 7 of 60(I) of 2010. Participation in the general meeting by electronic means. 7 of 60(I) of 2010. member shall exercise all the powers of the general meeting, pursuant to this Law, provided always that the decisions taken by the member in general meeting shall be minuted or made in writing. 128A.- (1) The provisions of this section shall apply to a company listed in a regulated market. (2) A person shall be entered as a member in the relevant register of members (including the overseas register) at the latest by the record date so that it may be able to exercise its right to participate and vote at the general meeting and any alteration in the entries to the relevant register after the record date shall not be taken into consideration in the determination of any person to participate and vote at the meeting. (3) The right of a member to participate in a general meeting and to vote with respect to its shares, shall not be subject to any requirement that his shares be deposited with, or transferred to, or registered in the name of another person before the general meeting. (4) A member shall be free to sell or otherwise transfer shares in a company listed in a regulated market at any time during the period between the record date and the general meeting to which it applies, if the right to sell will not have been otherwise subject to such a restriction. (5) Proof of qualification as a member may only be subject to such conditions as are necessary to ensure the identification of members and only to the extent that such conditions are proportionate to achieving that objective. 128B.- (1) A company listed in a regulated market may offer participation in the general meeting by electronic means, including- (a) mechanisms for casting votes, whether before or during the meeting, and the mechanisms adopted shall not oblige the member to be physically present at the meeting and shall not oblige the member to appoint a proxy who shall be physically present at the meeting, (b) real-time transmission of the general meeting, (c) real-time two-way communication enabling members to address the general meeting from a remote location. (2)(a) The use of electronic means pursuant to subsection (1) may be subject only to such conditions and restrictions as are necessary to ensure the identity of those participating and the security of the electronic communication, and only to the extent that such conditions and restrictions are proportionate to achieving those objectives. (b) The members shall be informed of any conditions and restrictions which shall be enforced by a company listed in a regulated market 118 Right to ask questions. 7 of 60(I) of 2010. pursuant to paragraph (a). (c) A company listed in a regulated market which provides electronic means for the participation of its members at a general meeting, shall ensure, so far as that is practically possible, that such means- (i) ensure the safety of any electronic communication by the member; (ii) minimise the risk of data alteration and unauthorised access; (iii) provide verification of the origin of the electronic communication; (iv) are remedied as soon as practically possible, in the event of any discontinuance or disconnection. 128C.- (1) Subject to any measures that a company listed in a regulated market may take to ensure the identity of the member, a member of a company listed in a regulated market shall have a right to ask questions related to items on the agenda of the general meeting and to receive answers to those questions by the company listed in a regulated market. (2) There is no obligation to answer a question submitted pursuant to subsection (1) where- (a) the answer would improperly interfere with the preparation of the meeting or confidentiality, or with the business interests of the company listed in a regulated market; (b) the answer has already been given on the website of the company listed in a regulated market in a specially designed question and answer format; or (c) according to the judgment of the chairman of the meeting, it would be undesirable for the preservation of the good order of the meeting for the question to be answered. Power of Court to order meeting. 129.- (1) If for any reason it is impracticable to call a meeting of a company in any manner in which meetings of that company may be called, or to conduct the meeting of the company in manner prescribed by the articles or this Law, the Court may, either of its own motion or on the application of any director of the company or of any member of the company who would be entitled to vote at the meeting, order a meeting of the company to be called, held and conducted in such manner as the Court thinks fit, and where any such order is made may give such ancillary or consequential directions as it thinks expedient; and it is hereby declared that the directions that may be given under this subsection include a direction that one member of the company present in person or by proxy shall be deemed to constitute a meeting. 119 (2) Any meeting called, held and conducted in accordance with an order under subsection (1) shall for all purposes be deemed to be a meeting of the company duly called, held and conducted. Proxies. 130.- (1) Any member of a company entitled to attend and vote at a meeting of the company shall be entitled to appoint another person, whether a member or not, as his proxy to attend and vote instead of him, and a proxy appointed to attend and vote instead of a member of a private company shall also have the same right as the member to speak at the meeting: Provided that, unless the articles otherwise provide- (a) this subsection shall not apply in the case of a company not having a share capital; and (b) a member of a private company shall not be entitled to appoint more than one proxy to attend on the same occasion; and (c) a proxy shall not be entitled to vote except on a poll. 8 (1)of 60(I) of 2010. (1A) (a) The provisions of this subsection shall apply to a company listed in a regulated market. (b) The appointed proxy may be either a natural or a legal person (whether a member or not) and shall act in accordance with the instructions issued by the appointing member. (c) The proxy shall be appointed by written notice to the company listed in a regulated market or by electronic means. (d) A member shall be permitted to:- (i) appoint a proxy by electronic means, at the address designated by the company listed in a regulated market; (ii) to have its notification of the appointment by electronic means accepted by the company listed in a regulated market; (iii) be offered at least one effective method of notification by electronic means, by the company listed in a regulated market. (e) The appointment of a proxy and the notification of the appointment of a proxy to the company listed in a regulated market and the issuance of instructions to a proxy to vote may only be subject to such formal conditions as are necessary to ensure the identity of the member or of the proxy or the possibility of verifying the content of the relevant voting instructions, if any, and only to the extent that those conditions are proportionate to achieving those objectives. (2) In every notice calling a meeting of a company having a share capital there shall appear with reasonable prominence a statement that a 120 4 of 166 of 1987. 8 (2)of 60(I) of 2010. member entitled to attend and vote is entitled to appoint a proxy, or, where that is allowed, one or more proxies to attend and vote instead of him, and that a proxy need not also be a member; and if default is made in complying with this subsection as respects any meeting, every officer of the company who is in default shall be liable to a fine not exceeding four hundred twenty-seven euros. (2A) Notwithstanding the provisions of subsection (2) or anything contained in its articles, in the case of a company listed in a regulated market- (a) no limitation may be imposed on the rights of a member to appoint more than one proxy to be present and vote at a general meeting as regards shares held in different securities accounts; and (b) subject to the provisions of paragraph (a), a member shall not be allowed to appoint more than one proxy to attend and vote at the same meeting, provided however that a member acting as an intermediary on behalf of a client shall not be prevented from appointing each one of his clients or any other third person indicated by the client as proxy. (3) Any provision contained in the articles of a company listed in a regulated market shall be void in so far as it would have the effect of requiring the instrument appointing a proxy, or any other document necessary to show the validity of or otherwise relating to the appointment of a proxy, to be received by the company or any other person more than forty-eight hours before a meeting or adjourned meeting in order that the appointment may be effective thereat. 4 of 166 of 1987. (4) If for the purpose of any meeting of a company invitations to appoint as proxy a person or one of a number of persons specified in the invitations are issued at the company's expense to some only of the members entitled to be sent a notice of the meeting and to vote thereat by proxy, every officer of the company who knowingly and wilfully authorizes or permits their issue as aforesaid shall be liable to a fine not exceeding eight hundred fifty four euros: 8(3) of 60(I) of 2010. Provided that an officer shall not be liable under this subsection by reason only of the issue to a member at his request in writing of a form of appointment naming the proxy or of a list of persons willing to act as proxy if the form or list is available on request in writing to every member entitled to vote at the meeting by proxy. (4A) Any provision contained in the articles of a company listed in a regulated market, apart from the condition that the person to be appointed as proxy holder possess legal capacity, shall be void to the degree that it affects the eligibility of a person to be appointed as a proxy. (5) This section shall apply to meetings of any class of members of a company as it applies to general meetings of the company. 121 Right to demand a poll. 131.- (1) Any provision contained in a company's articles shall be void in so far as it would have the effect either: (a) of excluding the right to demand a poll at a general meeting on any question other than the election of the chairman of the meeting or the adjournment of the meeting; or (b) of making ineffective a demand for a poll on any such question which is made either: (i) by not less than five members having the right to vote at the meeting; or (ii) by a member or members representing not less than one-tenth of the total voting rights of all the members having the right to vote at the meeting; or (iii) by a member or members holding shares in the company conferring a right to vote at the meeting, being shares on which an aggregate sum has been paid up equal to not less than one-tenth of the total sum paid up on all the shares conferring that right. (2) The instrument appointing a proxy to vote at a meeting of a company shall be deemed also to confer authority to demand or join in demanding a poll, and for the purposes of subsection (1) a demand by a person as proxy for a member shall be the same as a demand by the member. Removal of certain impediments to the effective exercise of voting rights. 9 of 60(I) of 2010. 132.- (1) On a poll taken at the general meeting of a company listed in a regulated market or a meeting of any class of members of a company listed in a regulated market, a member present either in person or through a proxy and who is entitled to more than one vote, need not, if he votes, use all his votes or cast all the votes he uses in the same way. (2) A company listed in a regulated market, may include, with regard to a vote cast pursuant to subsection (1), a vote that was cast in advance by correspondence, subject only to such conditions and restrictions which are necessary to ensure the identity of the person who is voting and to ensure proportionately the achievement of that objective. (3) A company listed in a regulated market shall only be obliged to count the votes cast in advance by correspondence pursuant to subsection (2), where such votes were cast prior to the date and time set by the company, provided that such date and time do not exceed twenty-four hours prior to the conclusion of the poll. Representation of corporations at meetings of companies and of 133.- (1) A corporation, whether a company within the meaning of this Law or not, may: 122 creditors. 10(1) of 60(I) of 2010. (a) if it is a member of another corporation, being a company within the meaning of this Law, by resolution of its directors or other governing body, authorize such person as it thinks fit to act as its representative at any meeting of the company or at any meeting of any class of members of the company; 10 (2) of 60(I) of 2010. 10 (3) of 60(I) of 2010. (b) if it is a creditor, including a holder of debentures, of another corporation, being a company within the meaning of this Law, by resolution of its directors or other governing body authorize such person as it thinks fit to act as its representative at any meeting of any creditors of the company held in pursuance of this Law or of any rules made thereunder, or in pursuance of the provisions contained in any debenture or trust deed, as the case may be; (c) if it has been appointed as a proxy to participate and vote on behalf of a member of a company listed in a regulated market at a general meeting of a company listed in a regulated market, by a resolution of its directors or other governing body, to authorize such person as it thinks fit to act as its proxy at any general meeting of the company listed in a regulated market or at any meeting of any class of members of the company listed in a regulated market, for the purpose of such appointment. (2) A person authorised as aforesaid shall be entitled to exercise the same powers on behalf of the corporation which he represents as that corporation could exercise if it were an individual shareholder, creditor, or holder of debentures of that other company. Circulation of members’ resolutions, etc. 134. -(1) Subject to the following provisions of this section it shall be the duty of a company, on the requisition in writing of such number of members as is hereinafter specified and, unless the company otherwise resolves, at the expense of the requisitionists,- (a) to give to members of the company entitled to receive notice of the next annual general meeting notice of any resolution which may properly be moved and is intended to be moved at that meeting; (b) to circulate to members entitled to have notice of any general meeting sent to them any statement of not more than one thousand words with respect to the matter referred to in any proposed resolution or the business to be dealt with at that meeting. (2) The number of members necessary for a requisition under subsection (1) shall be- (a) any number of members representing not less than one twentieth of the total voting rights of all the members having at the date of the requisition a right to vote at the meeting to which the requisition relates; or (b) not less than one hundred members holding shares in the company 123 on which there has been paid up an average sum, per member, of not less than one hundred seventy euros. (3) Notice of any such resolution shall be given, and any such statement shall be circulated, to members of the company entitled to have notice of the meeting sent to them by serving a copy of the resolution or statement on each such member in any manner permitted for service of notice of the meeting, and notice of any such resolution shall be given to any other member of the company by giving notice of the general effect of the resolution in any manner permitted for giving him notice of meetings of the company: Provided that the copy shall be served, or notice of the effect of the resolution shall be given, as the case may be, in the same manner and, so far as practicable, at the same time as notice of the meeting and, where it is not practicable for it to be served or given at that time, it shall be served or given as soon as practicable thereafter. (4) A company shall not be bound under this section to give notice of any resolution or to circulate any statement unless- (a) a copy of the requisition signed by the requisitionists (or two or more copies which between them contain the signatures of all of the requisitionists) is deposited at the registered office of the company- (i) in the case of a requisition requiring notice of a resolution, not less than six weeks before the meeting; and (ii) in the case of any other requisition, not less than one week before the meeting; and (b) there is deposited or tendered with the requisition a sum reasonably sufficient to meet the company's expenses in giving effect thereto: Provided that it, after a copy of a requisition requiring notice of a resolution has been deposited at the registered office of the company, an annual general meeting is called for a date six weeks or less after the copy has been deposited, the copy though not deposited within the time required by this subsection shall be deemed to have been properly deposited for the purposes thereof. (5) The company shall also not be bound under this section to circulate any statement if, on the application either of the company or of any other person who claims to be aggrieved, the Court is satisfied that the rights conferred by this section are being abused to secure needless publicity for defamatory matter; and the Court may order the company's costs on an application under this section to be paid in whole or in part by the requisitionists, notwithstanding that they are not parties to the application. (6) Notwithstanding anything in the company's articles, the business which may be dealt with at an annual general meeting shall include any 124 resolution of which notice is given in accordance with this section, and for the purposes of this subsection, notice shall be deemed to have been so given notwithstanding the accidental omission, in giving it, of one or more members. 4 of 166 of 1987. (7) In the event of any default in complying with the provisions of this section, every officer of the company who is in default shall be liable to a fine not exceeding one thousand, two hundred and eighty-one euros. Extraordinary and special resolutions. 135.-(1) A resolution shall be an extraordinary resolution when it has been passed by a majority of not less than three-fourths of such members as, being entitled so to do, vote in person or, where proxies are allowed, by proxy, at a general meeting of which notice specifying the intention to propose the resolution as an extraordinary resolution has been duly given. (2) A resolution shall be a special resolution when it has been passed by such a majority as is required for the passing of an extraordinary resolution and at a general meeting of which not less than twenty-one days' notice, specifying the intention to propose the resolution as a special resolution, has been duly given: Provided that, if it is so agreed by a majority in number of the members having the right to attend and vote at any such meeting, being a majority together holding not less than ninety-five per cent in nominal value of the shares giving that right, or, in the case of a company not having a share capital, together representing not less than ninety-five per cent of the total voting rights at that meeting of all the members, a resolution may be proposed and passed as a special resolution at a meeting of which less than twenty-one days' notice has been given. (3) At any meeting at which an extraordinary resolution or a special resolution is submitted to be passed, a declaration of the chairman that the resolution is carried shall, unless a poll is demanded, be conclusive evidence of the fact without proof of the number or proportion of the votes recorded in favour of or against the resolution. (4) In computing the majority on a poll demanded on the question that an extraordinary resolution or a special resolution be passed, reference shall be had to the number of votes cast for and against the resolution. (5) For the purposes of this section, notice of a meeting shall be deemed to be duly given and the meeting to be duly held when the notice is given and the meeting held in manner provided by this Law or the articles. Resolutions requiring special notice. 136. Where by any provision hereafter contained in this Law special notice is required of a resolution, the resolution shall not be effective unless notice of the intention to move it has been given to the company not less than twenty-eight days before the meeting at which it is moved, and the company shall give its members notice of any such resolution at 125 the same time and in the same manner as it gives notice of the meeting or, if that is not practicable, shall give them notice thereof, either by advertisement in a newspaper having an appropriate circulation or in any other mode allowed by the articles, not less than twenty-one days before the meeting: Provided that if, after notice of the intention to move such a resolution has been given to the company, a meeting is called for a date twenty–eight days or less after the notice has been given, the notice though not given within the time required by this section shall be deemed to have been properly given for the purposes thereof. Registration and copies of certain resolutions and agreements. 137.- (1) A printed copy of every resolution or agreement to which this section applies shall, within fifteen days after the passing or making thereof, be forwarded to the registrar of companies and recorded by him: Provided that an exempt private company need not forward a printed copy of any such resolution or agreement if instead it forwards to the registrar of companies a copy in some other form approved by him. (2) Where articles have been registered, a copy of every such resolution or agreement for the time being in force shall be embodied in or annexed to every copy of the articles issued after the passing of the resolution or the making of the agreement. (3) Where articles have not been registered, a printed copy of every such resolution or agreement shall be forwarded to any member at his request on payment of 0,0854 euros or such less sum as the company may direct. (4) This section shall apply to- (a) special resolutions; (b) extraordinary resolutions; (c) resolutions which have been agreed to by all the members of a company, but which, if not so agreed to, would not have been effective for their purpose unless, as the case may be, they had been passed as special resolutions or as extraordinary resolutions; (d) resolutions or agreements which have been agreed to by all the members of some class of shareholders but which, if not so agreed to, would not have been effective for their purpose unless they had been passed by some particular majority or otherwise in some particular manner, and all resolutions or agreements which effectively bind all the members of any class of shareholders though not agreed to by all those members; (e) resolutions requiring a company to be wound up voluntarily, passed 126 under paragraph (a) of subsection (1) of section 261. 4 of 166 of 1987. (5) If a company fails to comply with subsection (1), the company and every officer of the company who is in default shall be liable to a default fine of forty-two euros. 4 of 166 of 1987. (6) If a company fails to comply with subsection (2) or subsection (3) of this section, the company and every officer of the company who is in default shall be liable to a fine not exceeding forty-two euros for each copy in respect of which default is made. (7) For the purposes of subsections (5) and (6), a liquidator of the company shall be deemed to be an officer of the company. Resolutions passed at adjourned meetings. 138.- Where a resolution is passed at an adjourned meeting of: (a) a company; (b) the holders of any class of shares in a company; (c) the directors of a company, the resolution shall for all purposes be treated as having been passed on the date on which it was in fact passed, and shall not be deemed to have been passed on any earlier date. Minutes of proceedings of meetings of company and of directors and managers. 139.- (1) Every company shall cause minutes of all proceedings of general meetings, all proceedings at meetings of its directors and, where there are managers, all proceedings at meetings of its managers to be entered in books kept for that purpose. (2) Any such minute if purporting to be signed by the chairman of the meeting at which the proceedings were had, or by the chairman of the next succeeding meeting, shall be evidence of the proceedings. (3) Where minutes have been made in accordance with the provisions of this section of the proceedings at any general meeting of the company or meeting of directors or managers, then, until the contrary is proved, the meeting shall be deemed to have been duly held and convened, and all proceedings had thereat to have been duly had, and all appointments of directors, managers or liquidators shall be deemed to be valid. Voting results. 11 of 60(I) of 2010. (4) If a company fails to comply with subsection (1), the company and every officer of the company who is in default shall be liable to a default fine. 139A.- (1) The provisions of this section shall apply to a company listed in a regulated market. (2) Where a member requests a full account of the voting before or 127 during the announcement of the voting in a general meeting, then the company listed in a regulated market, with regard to each resolution proposed at a general meeting shall announce- (a) the number of shares for which votes have been validly cast; (b) the proportion of the issued share capital of the company listed in a regulated market represented by those votes, at the end of business on the day prior to the general meeting; (c) the total number of votes validly cast; (d) the number of votes cast in favour of and against each proposed resolution and, if counted, the number of abstentions. (3) Where no member requests a full account of the voting prior or during the announcement of the voting at the general meeting, it shall be sufficient for a company listed in a regulated market to announce the voting results only to the extent needed to ensure that the required majority is reached for each resolution. (4) The company listed in a regulated market shall ensure that the voting result which was announced pursuant to subsection (3), is published on its website, not later than at the end of the fourteenth day after the date of the meeting at which the voting result was obtained. Inspection of minute books. 140.- (1) The books containing the minutes of proceedings of any general meeting of a company shall be kept at the registered office of the company, and shall during business hours (subject to such reasonable restrictions as the company may by its articles or in general meeting impose, so that not less than two hours in each day be allowed for inspection) be open to the inspection of any member without charge. 7 of 76 of 1977. (2) Any member shall be entitled to be furnished within seven days after he has made a request in that behalf to the company with a copy of any such minutes as aforesaid at a charge not exceeding 0,0854 euros for every hundred words. 4 of 166 of 1987. 4 of 166 of 1987. (3) If any inspection required under this section is refused or if any copy required under this section is not sent within the proper time, the company and every officer of the company who is in default shall be liable in respect of each offence to a fine not exceeding forty-two euros and further to a default fine of forty-two euros. (4) In the case of any such refusal or default, the Court may by order compel an immediate inspection of the books in respect of all proceedings of general meetings or direct that the copies required shall be sent to the persons requiring them. 128 5 of167 (I) of 2003. Financial Statements and Audit Keeping of books of account. 2 of 90(I) of 2013 141.- (1) The directors shall cause to be kept books of account and records, which are considered necessary for the preparation of financial statements, in accordance with this Law and which shall correctly explain all the transactions and enable the determination of the financial position of the company with reasonable accuracy at any given time and include supporting documents (including contracts and invoices), which shall disclose: (a) all sums of money received and expended by the company as well as the matters in respect of which the respective receipt and respective expenditure takes place; (b) all sales and purchases and any transactions; (c) the assets and liabilities of the company. (2) For the purposes of subsection (1), proper books of account and records shall not be deemed to be kept, if the books and records which are kept are not sufficient for the presentation of an accurate and fair picture of the affairs of the company as well as an explanation as to its transactions. (3) The books of account and records shall be kept at the registered office of the company or at such other place as the directors think fit, for a period of six (6) years after the end of the calendar year to which these refer to, and shall at all times be open to inspection by the directors: Provided that if books of account and records are kept at a place outside the Republic, there shall be sent to, and kept at a place in, the Republic and be at all times open to inspection by the directors such accounts and returns with respect to the business dealt with in the books of account and records so kept as will disclose with reasonable accuracy the financial position of that business at intervals not exceeding six (6) months and will enable to be prepared in accordance with the present Law, the company's balance sheet, its profit and loss account or income and expenditure account, and any document annexed to any of those documents giving information which is required by this present Law and is thereby allowed to be so given. 6(b) of 167(I) of 2003. (4) If a director of a company fails to take all reasonable steps to secure compliance with the provisions of this section, he shall commit a criminal offence and on conviction thereof be liable to imprisonment not exceeding one year or to a fine not exceeding one thousand, seven hundred and eight euros or to both such imprisonment and fine: 6(c) of 167(I) of 2003. Provided that in any proceedings against a person in respect of an offence under this section consisting of a failure to take reasonable 129 steps to secure compliance by the company with the requirements of this section, it shall be a defence to prove that he had reasonable ground to believe and did believe that a competent and reliable person was charged with the duty of seeing that those requirements were complied with and was in a position to discharge that duty. Annual and consolidated financial statements. 7 of 167(I) of 2003. 2 of 157(I) of 2011. 142.- (1) (a) The directors shall cause to be made, for every company, a complete set of financial statements, as this set is prescribed by the International Accounting Standards. (b) Without prejudice to the provisions of section 142A, each company which has subsidiaries, shall consolidate its financial statements with the financial statements of its subsidiaries as prescribed by the International Accounting Standards, and the said consolidated financial statements shall be presented before the general meeting of the parent company. (c) In addition to the information requirements imposed by the International Accounting Standards, in the financial statements, and, preferably in the notes thereto, information shall also be presented in relation to: (i) the data required by sections 183 to 189; 3 of 41 (I) of 2009. (ii) the fees of the auditors, as well as any expenditures incurred in relation to their expenses. The total fees charged during the financial year by the auditor or the audit firm for carrying out the statutory audit of annual and consolidated accounts, the total fees charged for other assurance services, the total fees charged for tax advisory services and the total fees charged for other non-audit services shall be separately presented . 3 of 131(I) of 2007. (d) Small sized groups shall be exempt from the obligation to prepare consolidated financial statements, referred to in paragraph (b) of this subsection. 3 of 131(I) of 2007. (e) For the purposes of this subsection, the term ‘small sized group’ means a group of companies, of which the companies subject to consolidation– (i) are not public; (ii) the preparation of their consolidated financial statements is not governed by any other legislation; and (iii) they satisfy, in their entirety, at the date of closing of the balance sheet of the parent company, two of the following three criteria: 2 (a)(i) of 88(I) of 2010. (aa) The total of the assets appearing in the balance sheet (and without deducting the liabilities) does not exceed the amount of 17.500.000 (seventeen million five hundred thousand) Euros; 2 (a)(ii)of 88(I) of 2010. (bb) The net level of the turnover does not exceed the amount of 35.000.000 (thirty five million) Euros, and 130 (cc) The average number of employees at the relevant period does not exceed two hundred fifty. 3 of 131(I) of 2007. (f) Groups of companies of which the ultimate subsidiary or parent companies publish consolidated financial statements on the basis of Generally Recognized Accounting Principles shall be exempt from the obligation to prepare consolidated financial statements. (2) (a) Financial statements shall be presented at the latest eighteen months after the incorporation of the company and subsequently once at least in every calendar year. (b) In case the dates of preparation of the financial statements of the parent company and the subsidiary or subsidiaries, do not correspond, the adjustments set out in the International Accounting Standards must be made. (c) The preparation and presentation of periodical statements shall be permitted, provided that all the relevant provisions of the International Accounting Standards are complied with. (3) In the preparation of the financial statements- (a) In the “reserve” the amounts which have been written off or been reserved for write off or for the creation of predictions shall not be included. Provided that in the case where any amount is reserved as a write off or prediction and it is proven later (in the opinion of the directors) that such amount is greater than what is reasonably required for such purpose, this excess amount shall be considered to be the reserve. (b) in the “capital reserve” no amount which was considered as available for distribution is included; (c) every reserve except for the capital reserve shall be considered to be “income reserve”; (d) reference to “prediction” is made giving the term the meaning given to it by the International Accounting Standards. 2 (b)of 88(I) of 2010. (4) (a) The directors of every company shall have a collective duty towards it to ensure that the annual financial statements and, as the case may be, the annual consolidated financial statements shall be prepared and published in accordance with the requirements of this Law and in accordance with the International Accounting Standards. (b) Without prejudice to the collective civil liability of directors towards the company which exists in case of breach of the duty referred to in paragraph (a), if a director of a company fails to take all reasonable steps to comply with the duty referred to in paragraph (a), shall commit 131 an offence and shall be subject, on conviction, to imprisonment not exceeding one year or to a fine not exceeding one thousand and seven hundred euros or to both such penalties: Provided that, subject to the provisions of any other special law, in any proceedings against a person in respect of an offence provided for in this paragraph, it shall be a defence to prove that such person had reasonable ground to believe and did believe that a competent and reliable person, who was charged with the duty of seeing that the provisions of paragraph (a), were complied with, was in a position to discharge that duty. Exemptions relating to the keeping of consolidated financial statements. 142A.(1) The consolidated financial statements which are prepared pursuant to paragraph (b) of subsection (1) of section 142 should present a true and fair picture of the assets, liabilities, financial position and of the profits or losses of all the companies which are included in the consolidation. 3 of 157(I) of 2011. (2) A company which only has subsidiary companies shall be exempted from the provisions of paragraph (b) of subsection (1) of section 142, provided that all the subsidiary companies are not, both individually and as a whole, material for the purposes of subsection (1). (3) Without prejudice to the provisions of subsection (4), the financial statements of a subsidiary company may be exempted from the obligation of the parent company to include them, pursuant to paragraph (b) of subsection (1) of section 142, in the consolidated financial statements if such subsidiary company is not material so as to affect the true and fair picture of the assets, liabilities, financial position and profits or losses of such consolidated financial statements. (4) The financial statements of two or more companies for which the exemption of provisions of subsection (3) apply, should be included in the consolidated financial statements, pursuant to paragraph (b) of subsection (2) of section 142, if as a whole such companies are material so as to affect the true and fair picture of the assets, liabilities, financial position and profits or losses of such consolidated financial statements. (5) The financial statements of a subsidiary company may not be included in the consolidated financial statements, pursuant to paragraph (b) of subsection (2) of section 142, if: (a) strict and continuous restrictions substantially prejudice the exercise by the parent company of its rights in the property or administration of the subsidiary company, or (b) the necessary information with respect to the subsidiary company for the preparation of the consolidated financial statements cannot be collected without disproportionate costs or 132 inexcusable delays, or (c) the shares in the subsidiary company are held for the exclusive purpose of their subsequent sale. True and fair picture, true and fair presentation. 7 of 167(I) of 2003. 143.- (1) The financial statements shall present a true and fair picture of the company (hereinafter called a “true and fair picture”). (2) The presentation of a true and fair picture shall be achieved through the strict application of the International Accounting Standards, the compliance with which is obligatory for all companies. (3) Where, in the opinion of the directors, compliance with the International Accounting Standards is not sufficient for the presentation of a true and fair picture, supplementary information must be provided in the notes. (4) If the financial statements presented or published do not present a true and fair picture, a contravention of this section shall be deemed to exist. To this, the fact that each separate action which has been carried out in compliance with the provisions of this section was, in itself, lawful, or that there was no liability as to the end result of the non presentation of a true and fair picture , cannot be used as an argument. (5) If a director of a company fails to take all reasonable measures to secure compliance with the provisions of this section, as well as with other requirements of this Law in relation to the matters which must be presented in the financial statements, shall commit an offence and on conviction thereof be liable to imprisonment not exceeding one year or to a fine not exceeding seventeen thousand and eighty-six euros or to both such penalties . 8 of 167(I) of 2003. 8 of 167 (I) of 2003. 8 of 167(I) of 2003. 8 of 167 (I) of 2003. 144. Repealed. 145. Repealed. 146. Repealed. 147. Repealed. . Meaning of “holding company” and “subsidiary”. 148.- (1) For the purposes of this Law, a company shall, subject to the provisions of subsection (3), be deemed to be a subsidiary of another if, but only if- (a) that other either- 133 (i) is a member of it and controls the composition of its board of directors; or 25(a) of 70(I) of 2003. (ii) holds the majority of the voting rights in the company; or 25(b) of 70(I) of 2003. (iii) is a member of it and controls the majority of voting rights of its members by virtue of an agreement which has been entered into with its other members; (b) the first-mentioned company is a subsidiary of any company which is that other's subsidiary. (2) For the purposes of subsection (1), the composition of a company's board of directors shall be deemed to be controlled by another company if, but only if, that other company by the exercise of some power exercisable by it without the consent or concurrence of any other person can appoint or remove the holders of all or a majority of the directorships; but for the purposes of this provision that other company shall be deemed to have power to appoint to a directorship with respect to which any of the following conditions is satisfied, that is to say:- (a) that a person cannot be appointed thereto without the exercise in his favour by that other company of such a power as aforesaid; or (b) that a person's appointment thereto follows necessarily from his appointment as director of that other company; or (c) that the directorship is held by that other company itself or by a subsidiary of it. (3) In determining whether one company is a subsidiary of another- (a) any shares held or power exercisable by that other in a fiduciary capacity shall be treated as not held or exercisable by it; (b) subject to the two following paragraphs, any shares held or power exercisable- (i) by any person as a nominee for that other (except where that other is concerned only in a fiduciary capacity); or (ii) by, or by a nominee for, a subsidiary of that other, not being a subsidiary which is concerned only in a fiduciary capacity, shall be treated as held or exercisable by that other; (c) any shares held or power exercisable by any person by virtue of the provisions of any debentures of the first-mentioned company or of a trust deed for securing any issue of such debentures shall be disregarded; (d) any shares held or power exercisable by, or by a nominee for, that other or its subsidiary, not being held or exercisable as mentioned in 134 paragraph (c) of this subsection, shall be treated as not held or exercisable by that other if the ordinary business of that other or its subsidiary, as the case may be, includes the lending of money and the shares are held or power is exercisable as aforesaid by way of security only for the purposes of a transaction entered into in the ordinary course of that business. (4) For the purposes of this Law, a company shall be deemed to be another's holding company if, but only if, that other is its subsidiary. (5) In this section the expression \"company\" includes any body corporate, and the expression \"equity share capital\" means, in relation to a company, its issued share capital excluding any part thereof which, neither as respects dividends nor as respects capital, carries any right to participate beyond a specified amount in a distribution. Signing of balance sheet. 9(a) of 167 (I) of 2003. 149.- (1) The financial statements of a company shall be signed on behalf of the board by two of the directors of the company, or, if there is only one director, by that director. (2) In the case of a banking company registered after the 1st day of July, 1922, the balance sheet must be signed by the secretary or manager, if any, and where there are more than three directors of the company by at least three of those directors, and where there are not more than three directors by all the directors. 9(b) of 167 (I) of 2003. 4 of 166 of 1987. (3) If any copy of the financial statements which has not been signed as required by this section is issued, circulated or published, the company and every officer of the company who is in default shall be liable to a fine not exceeding four hundred twenty-seven euros. Publication of financial statements. 10 of 167 (I) of 2003. 150.-(1) (a) Whenever the financial statements are published in full they must be published in the form in which they were presented by the auditor and be accompanied by the complete text of his report. In every case, all the observations, reservations and refusals to express an opinion which the auditor expressed must be presented. 3 of 130(I) of 2005. (b) If the financial statements are not published in full- (i) It must be noted that the publication is synoptic; (ii) the place to which the financial statements have been submitted must be mentioned and in case they have not yet been submitted that should be provided in the publication; and (iii) the opinion of the auditors must be made known, as well as any other references worth bringing attention to, without the need for the report of the auditors to accompany the publication. (c) In every case, the financial statements must not be published, 135 separately, but as unified whole. (2) The issuance, circulation or publication of the above-mentioned statements in contravention of the provisions of subsection (1), shall constitute a criminal offence and the company and every officer of the company who is in default shall, on conviction, be subject to a fine not exceeding eight hundred fifty-four euros. Directors’ Report. 11 of 167(I) of 2003. 151.-(1)(a) There shall be attached to the financial statements a report by the directors in relation to the status and the foreseeable development of the affairs of the company or the group. (b)The directors’ report shall provide information in relation to, at least, the following:- (i) any change during the financial year in the nature of the business of the company or in its subsidiaries or in the classes of business in which the company has an interest, whether as a member of another company or otherwise, and especially in any takeover or merger which has been realized or intended, whether active or passive; (ii) any change to the share capital; (iii) any significant change to the structure, the allocation of responsibilities, or the compensation of the board of directors; (iv) any activities in the area of research and development to the extent that the relevant data do not already arise from the financial statements; 4(a) of 130(I) of 2005. (v) any important event that occurred after the expiry of usage; (vi) the foreseeable development of the company, (vii) the existence of branches of the company; (viii) a fair review of the development and progress of the activities of the company and its position, as well a description of the main risks and uncertainties it is facing; 4(b) of 130(I) of 2005. (bΑ) The review mentioned in subparagraph (viii) of paragraph (b) shall give a balanced and comprehensive analysis of the development and progress of the activities of the company and its position, which shall be proportionate to the size and complexity of its activities. 4 (b) of 130 (I) of 2005. (bΒ) (i) To the extent necessary for an understanding of the company’s development, progress or position, the analysis mentioned in paragraph (bΑ) above, shall include financial and economic, as well as, where appropriate, non financial and economic basic indications of progression related to the specific field of activities, including information relating to environmental and employee matters; 136 (ii) In providing its analysis the annual report shall, where appropriate, include references to and additional explanations of amounts reported in the annual accounts. 4(b) of 130(I) of 2005. (bC) Small sized private companies, as defined in subsection (2) of section 152A, the securities of which are not admitted for negotiation to a regulated market of a member state and which are not obliged pursuant to this Law to submit consolidated financial statements, shall be exempted from the obligation provided in paragraph (bΒ) above concerning the analysis of non-financial and economic information. (c) In every case, the directors’ report shall be accompanied by a reasoned recommendation in relation to the distribution of profits, the absorption of losses and the creation of predictions. 3 (a) of 88(I) of 2010. (d) Repealed. (2) (a) When the directors’ report is published in whole, it shall be published in the form in which it accompanied the financial statements which were published by the auditor, and shall be accompanied by the complete text of the report of the auditor. In every case, there must be presented all the observations, reservations and refusals to express an opinion, which may have been expressed by the auditor. (b) When the directors’ report is published in a piecemeal manner, it shall not be accompanied by the complete report of the auditor, but only by the observations, reservations and refusals to express his opinion. (c) The issuance, circulation or publication of any copy of the directors’ report without the provisions of this subsection being complied with shall constitute a criminal offence and the company and every officer of the company who is in default shall, on conviction, be subject to a fine not exceeding eight hundred fifty-four euros. 3(b) of 88(I) of 2010. 190 (I)of 2007 77(I) of 2009. (3) (a) The directors of every company shall have a collective duty towards it to ensure that: (i) the directors’ report shall be prepared and published in accordance with the requirements of this Law; (ii) in cases where the directors’ report includes a statement of corporate governance, such report shall be prepared and published in accordance with the requirements of this Law and of the Transparency Requirements (Securities Admitted to Trading on a Regulated Market) Laws 2007 and 2009 and of the Directives issued thereunder. (b) Without prejudice to the collective civil liability of directors towards the company which exists in case of breach of the duty referred to in 137 paragraph (a), if a director of a company fails to take all reasonable steps for compliance with the duty referred to in paragraph (a), shall commit an offence and shall on conviction thereof, be liable to imprisonment not exceeding one year or to a fine not exceeding seventeen thousand euros or to both such penalties: Provided that, subject to the provisions of any other special law, in any proceedings against a person in respect of an offence provided in this paragraph, it shall be a defence to prove that the person had reasonable cause to believe and did believe that an able and responsible person, was assigned with the duty of seeing that the provisions of paragraph (a), were complied with, and was in a position to exercise that duty. Right to receive copies of balance sheets and auditors’ report. 12(a) of 167(I) of 2003. 152.-(1) The directors shall present to the company in general meeting- (a) the set of financial statements; (b) the directors’ report; (c) the auditors’ report attached to the above, where this is required by the Law: 2(a) of 42(I)/2010. Provided that, in the notice for calling a general meeting, in accordance with section 127, at which the above mentioned documents shall be deposited, mention shall be made as to the place and method of their distribution. 12(b) of 167(I) of 2003. 12(c) of 167(I) of 2003. 8 of 70 (I) of 2007. 2(b) of 42(I)/2010. (2) Copy of the documents referred to in subsection (1) shall be available at least twenty-one days before the date of the general meeting. Such copy may be requested and provided by the company, free of charge, either in electronic or hard form: (i) by every member of the company, irrespective of whether he is entitled to receive notices of general meetings of the company; (ii) by every holder of debentures of the company, irrespective of whether he is entitled to receive notices of general meetings of the company; (iii) by all persons, except members or holders of debentures of the company, who are entitled to receive notices of general meetings of the company: Provided that: (a) In the case of a company not having a share capital, this subsection shall not require the sending of the above- 138 mentioned documents to a member of the company who is not entitled to receive notices of general meetings of the company or to a holder of debentures of the company who is not so entitled; (b) at the Annual General Meeting of the shareholders of the company, the company shall have available for distribution to the shareholders present thereat the documents referred to in subsection (1) and it shall also be obliged to comply with its obligations relating to the publication of the documents as this is required in accordance with the provisions of any other related laws, either in the daily press or in its internet site or to any competent supervisory authorities, as well as to the Cyprus Stock Exchange, provided that the company is a public company listed on the Cyprus Stock Exchange. 12(b) of 167(I) of 2003. 2(c) of 42(I)/2010. (3) Any member of a company, whether he is or he is not entitled to have sent to him in electronic or hard form copies of the company’s balance sheets, and any holder of debentures of the company, whether he is or not so entitled, shall be entitled to be furnished on demand without charge with a copy in electronic or hard form of the last balance sheet of the company, including every document required by law to be annexed thereto, together with a copy in electronic or hard form of the auditors’ report of the balance sheet. 12(b) of 167(I) of 2003. 8 of 70(I) of 2007. 4(a) If default is made in complying with subsection (1), every director of the company who is in default shall commit a criminal offence punishable with a fine not exceeding eight thousand, five hundred and forty-three euros. (b) If default is made in complying with subsection (2), the company and every officer of the company who is in default shall commit a criminal offence punishable with a fine not exceeding five thousand, one hundred and twenty five euros. (c)If, when a person requests any document that he is entitled to receive pursuant to subsection (3), an omission to comply with the said subsection within seven days from the submission of the application, the company and every officer of the company who is in default shall commit a criminal offence punishable with a fine not exceeding eight hundred fifty-four euros. Compulsory auditing of financial statements and directors’ report by auditors. 13 of 167(I) of 2003. 152A.-(1) (a) The following companies shall, in accordance with the provisions of the Auditors and Statutory Audits of Annual and Consolidated Accounts Law, 2009, submit their financial statements to an auditor for auditing: 4 of 41 (I) of 2009. 139 42 (I) of 2009. (i) every company required by this Law to prepare consolidated financial statements; (ii) every public limited-liability company ; (iii) every private limited-liability company not being a small sized company . (b) The companies mentioned in paragraph (a) shall also submit to the auditor the directors’ report for the purpose of auditing its compatibility with the submitted financial statements. (2) For the purposes of this section, the term “small sized company” means a company in which at least two of the three sizes below shall not exceed, throughout the financial year, the following prices: (i) total of assets presented in the balance sheet (and without having subtracted the liabilities ) at 34,172.029 euros; (ii) net turnover of 70,052.659 euros; (iii) average number of employees, fifty persons: Provided that the company which initially fulfils the above-mentioned conditions loses its designation as a small sized company only if it exceeds the abovementioned criteria during two consecutive financial years. (3) The financial statements and the directors’ report which have not been audited, in accordance with the provisions in this section, shall be deemed not to have been published under subsection (4) of section 142. Appointment and remuneration of auditors. 153.- (1) Every company shall at each annual general meeting appoint an auditor or auditors to hold office from the conclusion of that, until the conclusion of the next annual general meeting. (2) At any annual general meeting a retiring auditor, however appointed, shall be re-appointed without any resolution being passed unless- (a) he is not qualified for re-appointment; or (b) a resolution has been passed at that meeting appointing somebody instead of him or providing expressly that he shall not be re- appointed; or (c) he has given the company notice in writing of his unwillingness to be re-appointed: 140 Provided that where notice is given of an intended resolution to appoint some person or persons in place of a retiring auditor, and by reason of the death, incapacity or disqualification of that person or of all those persons, as the case may be, the resolution cannot be proceeded with, the retiring auditor shall not be automatically re- appointed by virtue of this subsection. (3) Where at an annual general meeting no auditors are appointed or re-appointed, the Council of Ministers may appoint a person to fill the vacancy. (4) The company shall, within one week of the Council of Ministers’ power under subsection (3) becoming exercisable, give him notice of that fact, and, if a company fails to give notice as required by this subsection, the company and every officer of the company who is in default shall be liable to a default fine. (5) Subject as hereinafter provided, the first auditors of a company may be appointed by the directors at any time before the first annual general meeting, and auditors so appointed shall hold office until the conclusion of that meeting: Provided that- (a) the company may at a general meeting remove any such auditors and appoint in their place any other persons who have been nominated for appointment by any member of the company and of whose nomination notice has been given to the members of the company not less than fourteen days before the date of the meeting; and (b) if the directors fail to exercise their powers under this subsection, the company in general meeting may appoint the first auditors, and thereupon the said powers of the directors shall cease. (6) The directors may fill any casual vacancy in the office of auditor, but while any such vacancy continues, the surviving or continuing auditor or auditors, if any, may act. (7) The remuneration of the auditors of a company- (a) in the case of an auditor appointed by the directors or by the Council of Ministers, may be fixed by the directors or by the Council of Ministers, as the case may be; (b) subject to paragraph (a) of this subsection, shall be fixed by the company in general meeting or in such manner as the company in general meeting may determine. For the purposes of this subsection, any sums paid by the company in respect of the auditors' expenses shall be deemed to be included in the expression \"remuneration\". 5 of 41 (I) of (8) The provisions of this section shall apply subject to the provisions of 141 2009. sections 31, 43 and 44 of the Auditors and Statutory Audits of Annual and Consolidated Accounts Law, 2009. Provisions as to resolutions relating to appointment and removal of auditors. 154.- (1) Special notice shall be required for a resolution at a company's annual general meeting appointing as auditor a person other than a retiring auditor or providing expressly that a retiring auditor shall not be re-appointed. (2) On receipt of notice of such an intended resolution as aforesaid, the company shall forthwith send a copy thereof to the retiring auditor, if any. (3) Where notice is given of such an intended resolution as aforesaid and the retiring auditor makes with respect to the intended resolution representations in writing to the company (not exceeding a reasonable length) and requests their notification to members of the company, the company shall, unless the representations are received by it too late for it to do so,- (a) in any notice of the resolution given to members of the company, state the fact of the representations having been made; and (b) send a copy of the representations to every member of the company to whom notice of the meeting is sent (whether before or after receipt of the representations by the company), and if a copy of the representations is not sent as aforesaid because received too late or because of the company's default, the auditor may, without prejudice to his right to be heard orally, require that the representations shall be read out at the meeting: Provided that copies of the representations need not be sent out and the representations need not be read out at the meeting if, on the application either of the company or of any other person who claims to be aggrieved, the Court is satisfied that the rights conferred by this section are being abused to secure needless publicity for defamatory matter; and the Court may order the company’s costs on an application under this section to be paid in whole or in part by the auditor, notwithstanding that he is not a party to the application. (4) Subsection (3) shall apply to a resolution to remove the first auditors by virtue of subsection (5) of section 153 as it applies in relation to a resolution that a retiring auditor shall not be re-appointed. Qualifications for appointment as auditor. 2 of 76(I) of 2001. 4 of 133(I) of 2007. 6 of 41 (I) of 155.-.No person shall be appointed as an auditor of a company unless he has previously acquired a licence pursuant to the provisions of the Auditors and Statutory Audits of Annual and Consolidated Accounts Law, 2009. 142 2009. 7 of 41(I) of 2009. 155A. Repealed. 7 of 41 (I) of 2009. 155B. Repealed. 7 of 41 (I) of 2009. 155C. Repealed. 7 of 41 (I) of 2009. 155D. Repealed. 7 of 41 (I) of 2009. 155E. Repealed. 7 of 41 (I) of 2009. 7 of 41 (I) of 2009. 155F. Repealed. 156. Repealed. 15 of 167(I) of 2003. 157. Repealed. Inspection Investigation of company’s affairs on application of members. 8(a) of 76 of 1977. 158.- (1) The Council of Ministers may appoint one or more competent inspectors to investigate the affairs of a company and to report thereon in such manner as the Council of Ministers directs- (a) in the case of a company having a share capital, on the application either of not less than two hundred members or of members holding not less than one-tenth of the shares issued; (b) in the case of a company not having a share capital, on the application of not less than one-fifth in number of the persons on the company's register of members. 8(a) of 76 of 1977 8(b) of 76 of 1977. (2) The application shall be supported by such evidence as the Council of Ministers may require for the purpose of showing that the applicants have good reason for requiring the investigation, and the Council of Ministers may, before appointing an inspector, require the applicants to give security, for such amount as the Council of Ministers may determine, for payment of the costs of the investigation. Investigation of company’s affairs in other cases. 159. Without prejudice to his powers under section 158, the Council of Ministers- (a) shall appoint one or more competent inspectors to investigate the affairs of a company and to report thereon in such manner as the Council of Ministers directs, if- (i) the company by special resolution; or (ii) the Court by order, declares that its affairs ought to be investigated by an inspector 143 appointed by the Council of Ministers; and (b) may do so if it appears to the Council of Ministers that there are circumstances suggesting- (i) that its business is being conducted with intent to defraud its creditors or the creditors of any other person or otherwise for a fraudulent or unlawful purpose or in a manner oppressive of any part of its members or that it was formed for any fraudulent or unlawful purpose; or (ii) that persons concerned with its formation or the management of its affairs have in connection therewith been guilty of fraud, misfeasance or other misconduct towards it or towards its members; or (iii) that its members have not been given all the information with respect to its affairs which they might reasonably expect. Power of inspectors to carry investigations into affairs of related companies. 160. If an inspector appointed under section 158 or 159 to investigate the affairs of a company thinks it necessary for the purposes of his investigation to investigate also the affairs of any other body corporate which is or has at any relevant time been the company's subsidiary or holding company or a subsidiary of its holding company or a holding company of its subsidiary, he shall have power so to do, and shall report on the affairs of the other body corporate so far as he thinks the results of his investigation thereof are relevant to the investigation of the affairs of the first-mentioned company. Production of documents, and evidence, on investigation. 161.- (1) It shall be the duty of all officers and agents of the company and of all officers and agents of any other body corporate whose affairs are investigated by virtue of section 160 to produce to the inspectors all books and documents of or relating to the company or, as the case may be, the other body corporate which are in their custody or power and otherwise to give to the inspectors all assistance in connection with the investigation which they are reasonably able to give. (2) An inspector may examine on oath the officers and agents of the company or other body corporate in relation to its business, and may administer an oath accordingly. (3) If any officer or agent of the company or other body corporate refuses to produce to the inspectors any book or document which it is his duty under this section so to produce, or refuses to answer any question which is put to him by the inspectors with respect to the affairs of the company or other body corporate, as the case may be, the inspectors may certify the refusal under their hand to the Court, and the Court may thereupon inquire into the case, and after hearing any witnesses who may be produced against or on behalf of the alleged offender and after hearing any statement which may be offered in defence, punish the offender in like manner as if he had been guilty of contempt of the Court. 144 (4) If an inspector thinks it necessary for the purpose of his investigation that a person whom he has no power to examine on oath should be so examined, he may apply to the Court and the Court may if it sees fit order that person to attend and be examined on oath before it on any matter relevant to the investigation, and on any such examination- (a) the inspector may take part therein either personally or by an advocate; (b) the Court may put such questions to the person examined as the Court thinks fit; (c) the person examined shall answer all such questions as the Court may put or allow to be put to him, but may at his own cost employ an advocate who shall be at liberty to put to him such questions as the Court may deem just for the purpose of enabling him to explain or qualify any answers given by him, and notes of the examination shall be taken down in writing, and shall be read over to or by, and signed by, the person examined, and may thereafter be used in evidence against him: Provided that, notwithstanding anything in paragraph (c) of this subsection, the Court may allow the person examined such costs as in its discretion it may think fit, and any costs so allowed shall be paid as part of the expenses of the investigation. (5) In this section, any reference to officers or to agents shall include past, as well as present, officers or agents, as the case may be, and for the purposes of this section the expression “agents\", in relation to a company or other body corporate shall include the bankers and advocates of the company or other body corporate and any persons employed by the company or other body corporate as auditors, whether those persons are or are not officers of the company or other body corporate. Inspectors’ report. 162.- (1) The inspectors may, and, if so directed by the Council of Ministers, shall, make interim reports to the Council of Ministers, and on the conclusion of the investigation shall make a final report to the Council of Ministers. Any such reports shall be written or printed, as the Council of Ministers directs. (2) The Council of Ministers shall- (a) forward a copy of any report made by the inspectors to the registered office of the company; (b) if the Council of Ministers thinks fit, furnish a copy thereof on request and on payment of the prescribed fee to any other person who is a member of the company or of any other body corporate dealt with in the report by virtue of section 160 or whose interests as a creditor of 145 the company or of any such other body corporate as aforesaid appear to the Council of Ministers to be effected; (c) where the inspectors are appointed under section 158, furnish, at the request of the applicants for the investigation, a copy to them; and (d) where the inspectors are appointed under section 159 in pursuance of an order of the Court, furnish a copy to the Court, and may also cause the report to be printed and published. Proceedings on inspectors’ report. 163.- (1) If from any report made under section 162 it appears to the Council of Ministers that any person has, in relation to the company or to any other body corporate whose affairs have been investigated by virtue of section 160, been guilty of any offence for which he is criminally liable, the Council of Ministers shall refer the matter to the Attorney-General. (2) If, where any matter is referred to the Attorney-General under this section, he considers that the case is one in which a prosecution ought to be instituted, he shall institute proceedings accordingly, and it shall be the duty of all officers and agents of the company or other body corporate as aforesaid, as the case may be, other than the defendant in the proceedings, to give him all assistance in connection with the prosecution which they are reasonably able to give. Subsection (5) of section 161 shall apply for the purposes of this subsection as it applies for the purposes of that section. (3) If, in the case of any body corporate liable to be wound up under this Law, it appears to the Council of Ministers, from any such report as aforesaid that it is expedient so to do by reason of any such circumstances as are referred to in sub-paragraph (i) or (ii) of paragraph (b) of section 159, the Council of Ministers may, unless the body corporate is already being wound up by the Court, cause a petition to be presented for it to be so wound up if the Court thinks it just and equitable that it should be wound up or a petition for an order under section 202 or both. (4) If from any such report as aforesaid it appears to the Council of Ministers that proceedings ought in the public interest to be brought by any body corporate dealt with by the report for the recovery of damages in respect of any fraud, misfeasance or other misconduct in connection with the promotion or formation of that body corporate or the management of its affairs, or for the recovery of any property of the body corporate which has been misapplied or wrongfully retained, he may cause proceedings for that purpose to be brought in the name of the body corporate. (5) The Council of Ministers shall indemnify the body corporate against any costs or expenses incurred by it in or in connection with any proceedings brought by virtue of subsection (4). 146 Expenses of investigation of company’s affairs. 3(a) of 129(I) of 2005. 3(c) of 129(I) of 2005. 164.-(1) Subject to the provisions of subsection (2), the expenses of and incidental to an inspector’s investigation appointed by the Council of Ministers on the basis of the preceding provisions of this Law shall be paid by the persons who requested the appointment of the inspector. 3(b) of 129(I) of 2005. 3(b) of 129(I) of 2005. (2) For the purposes of this section, any costs or expenses incurred by the Government in or in connection with proceedings brought by virtue of subsection (4) of section 163 (including expenses incurred by virtue of subsection (5) thereof) shall be treated as expenses of the investigation giving rise to the proceedings and notwithstanding the provisions of subsection (1), they shall burden the Republic. Inspectors’ report to be evidence. 165. A copy of any report of any inspectors appointed under the foregoing provisions of this Law, authenticated by the seal of the company whose affairs they have investigated, shall be admissible in any legal proceeding as evidence of the opinion of the inspectors in relation to any matter contained in the report. Appointment and powers of inspectors to investigate ownership of company. 166.- (1) Where it appears to the Council of Ministers that there is good reason so to do, he may appoint one or more competent inspectors to investigate and report on the membership of any company and otherwise with respect to the company for the purpose of determining the true persons who are or have been financially interested in the success or failure, real or apparent, of the company or able to control or materially to influence the policy of the company. (2) The appointment of an inspector under this section may define the scope of his investigation, whether as respects the matters or the period to which it is to extend or otherwise, and in particular may limit the investigation to matters connected with particular shares or debentures. (3) Where an application for an investigation under this section with respect to particular shares or debentures of a company is made to the Council of Ministers by members of the company, and the number of applicants or the amount of the shares held by them is not less than that required for an application for the appointment of an inspector under section 158, the Council of Ministers shall appoint an inspector to conduct the investigation unless he is satisfied that the application is vexatious, and the inspector's appointment shall not exclude from the scope of his investigation any matter which the application seeks to have included therein, except in so far as the Council of Ministers is satisfied that it is unreasonable for that matter to be investigated. (4) Subject to the terms of an inspector's appointment his powers shall extend to the investigation of any circumstances suggesting the existence of an arrangement or understanding which, though not legally binding, is or was observed or likely to be observed in practice and which is relevant to the purposes of his investigation. 147 (5) For the purposes of any investigation under this section, sections 160 to 162 shall apply with the necessary modifications of references to the affairs of the company or to those of any other body corporate, so, however, that- (a) the said sections shall apply in relation to all persons who are or have been, or whom the inspector has reasonable cause to believe to be or have been, financially interested in the success or failure or the apparent success or failure of the company or any other body corporate whose membership is investigated with that of the company, or able to control or materially to influence the policy thereof, including persons concerned only on behalf of others, as they apply in relation to officers and agents of the company or of the other body corporate, as the case may be; and (b) the Council of Ministers shall not be bound to furnish the company or any other person with a copy of any report by an inspector appointed under this section or with a complete copy thereof if he is of opinion that there is good reason for not divulging the contents of the report or of parts thereof, but shall cause to be kept by the registrar a copy of any such report or, as the case may be, the parts of any such report, as respects which he is not of that opinion. (6) The expenses of any investigation under this section shall be defrayed by the Council of Ministers out of the public revenue. Power to require information as to persons interested in shares or debentures. 167.- (1) Where it appears to the Council of Ministers that there is good reason to investigate the ownership of any shares in or debentures of a company and that it is unnecessary to appoint an inspector for the purpose, he may require any person whom he has reasonable cause to believe- (a) to be or to have been interested in those shares or debentures; or (b) to act or to have acted in relation to those shares or debentures as the advocate or agent of someone interested therein, to give him any information which he has or can reasonably be expected to obtain as to the present and past interests in those shares or debentures and the names and addresses of the persons interested and of any persons who act or have acted on their behalf in relation to the shares or debentures. (2) For the purposes of this section, a person shall be deemed to have an interest in a share or debenture if he has any right to acquire or dispose of the share or debenture or any interest therein or to vote in respect thereof, or if his consent is necessary for the exercise of any of the rights of other persons interested therein, or if other persons interested therein can be required or are accustomed to exercise their rights in accordance with his instructions. 148 3 of 166 of 1987. (3) Any person who fails to give any information required of him under this section, or who in giving any such information makes any statement which he knows to be false in a material particular, or recklessly makes any statement which is false in a material particular, shall be liable to imprisonment not exceeding one year or to a fine not exceeding one thousand, seven hundred and eight euros or to both such imprisonment and fine. Power to impose restrictions on shares or debentures. 168.-(1) Where in connection with an investigation under section 166 or 167 it appears to the Council of Ministers that there is difficulty in finding out the relevant facts about any shares (whether issued or to be issued), and that the difficulty is due wholly or mainly to the unwillingness of the persons concerned or any of them to assist the investigation as required by this Law, the Council of Ministers may by order direct that the shares shall until further order be subject to the restrictions imposed by this section. (2) So long as any shares are directed to be subject to the restrictions imposed by this section- (a) any transfer of those shares, or in the case of unissued shares any transfer of the right to be issued therewith and any issue thereof, shall be void; (b) no voting rights shall be exercisable in respect of those shares; (c) no further shares shall be issued in right of those shares or in pursuance of any offer made to the holder thereof; (d) except in a liquidation, no payment shall be made of any sums due from the company on those shares, whether in respect of capital or otherwise. (3) Where the Council of Ministers makes an order directing that shares shall be subject to the said restrictions, or refuses to make an order directing that shares shall cease to be subject thereto, any person aggrieved thereby may apply to the Court, and the Court may, if it sees fit, direct that the shares shall cease to be subject to the said restrictions. (4) Any order, whether of the Council of Ministers or of the Court, directing that shares shall cease to be subject to the said restrictions which is expressed to be made with a view to permitting a transfer of those shares may continue the restrictions mentioned in paragraphs (c) and (d) of subsection (2), either in whole or in part, so far as they relate to any right acquired or offer made before the transfer. (5) Any person who- (a) exercises or purports to exercise any right to dispose of any shares which, to his knowledge, are for the time being subject to the said restrictions or of any right to be issued with any such shares; or 149 (b) votes in respect of any such shares, whether as holder or proxy, or appoints a proxy to vote in respect thereof; or 3 of 166 of 1987. (c) being the holder of any such shares, fails to notify of their being subject to the said restrictions any person whom he does not know to be aware of that fact but does know to be entitled, apart from the said restrictions, to vote, in respect of those shares whether as holder or proxy, shall be liable to imprisonment not exceeding one year or to a fine not exceeding one thousand, seven hundred and eight euros or to both such imprisonment and fine. 4 of 166 of 1987. (6) Where shares in any company are issued in contravention of the said restrictions, the company and every officer of the company who is in default shall be liable to a fine not exceeding one thousand, seven hundred and eight euros. (7) A prosecution shall not be instituted under this section except by or with the consent of the Attorney-General. (8) This section shall apply in relation to debentures as it applies in relation to shares. Saving for advocates and bankers. 169. Nothing in the foregoing provisions of this Part shall require disclosure to the Council of Ministers or to an inspector appointed by them- (a) by an advocate of any privileged communication made to him in that capacity, except as respects the name and address of his client; or (b) by a company's bankers as such of any information as to the affairs of any of their customers other than the company. 26 of 70(I) of 2003. Distribution of dividends, profits and assets Distribution of capital in public companies. When it is permitted. 26 of 70 (I) of 2003. 169A.- (1) Except for cases of reduction of subscribed capital, a public company cannot make distributions to its shareholders, when, on the closing date of the last financial year, the net assets, as already presented in its annual accounts, or as could arise as a result of such distribution, are below the total of the subscribed capital and the reserves, the distribution of which the law or the articles do not allow. If part of the subscribed capital has not been called up, and the uncalled part does not appear in the assets shown in the balance sheet, then this part is not taken into account in the subscribed capital. (2) The amount of a distribution to shareholders cannot exceed the amount of the results of the last financial year, increased by the profits brought forward at the end of the last financial year and sums drawn from reserves available for this purpose, reduced however by the 150 amount of losses brought forward from previous financial years, and sums placed to reserve in accordance with the law or the articles of association. (3) The term “distribution” as used in subsections (1) and (2), includes, without restricting it to that, the payment of dividends and interest relating to shares. Non application of section 169A to investment companies with fixed capital. 26 of 70 (I) of 2003."
}