{
  "article_number": "178",
  "title": "Removal of directors.",
  "content": "178.-(1) A company may by ordinary resolution remove a director before the expiration of his period of office, notwithstanding anything in its articles or in any agreement between it and him: Provided that this subsection shall not, in the case of a private company, authorize the removal of a director holding office for life at the commencement of this Law, whether or not subject to retirement under an age limit by virtue of the articles or otherwise. (2) Special notice shall be required of any resolution to remove a director under this section or to appoint somebody instead of a director so removed at the meeting at which he is removed, and on receipt of an intended resolution to remove a director under this section the company shall forthwith send a copy thereof to the director concerned, and the director, whether or not he is a member of the company, shall be entitled to be heard on the resolution at the meeting. (3) Where notice is given of an intended resolution to remove a director under this section and the director concerned makes with respect thereto representations in writing to the company, not exceeding a reasonable length, and requests their notification to members of the company, the 155 company shall, unless the representations are received by it too late for it to do so,- (a) in any notice of the resolution given to members of the company state the fact of the representations having been made; and (b) send a copy of the representations to every member of the company to whom notice of the meeting is sent (whether before or after receipt of the representations by the company), and if a copy of the representations is not sent as aforesaid because received too late or because of the company's default, the director may, without prejudice to his right to be heard orally, require that the representations shall be read out at the meeting: Provided that copies of the representations need not be sent out and the representations need not be read out at the meeting if, on the application either of the company or of any other person who claims to be aggrieved, the Court is satisfied that the rights conferred by this section are being abused to secure needless publicity for defamatory matter; and the Court may order the company's costs on an application under this section to be paid in whole or in part by the director, notwithstanding that he is not a party to the application. (4) A vacancy created by the removal of a director under this section, if not filled at the meeting at which he is removed, may be filled as a casual vacancy. (5) A person appointed director in place of a person removed under this section shall be treated, for the purpose of determining the time at which he or any other director is to retire, as if he had become director on the day on which the person in whose place he is appointed was last appointed a director. (6) Nothing in this section shall be taken as depriving a person removed thereunder of compensation or damages payable to him in respect of the termination of his appointment as director or of any appointment terminating with that as director or as derogating from any power to remove a director which may exist apart from this section. Provisions as to undischarged bankrupts acting as directors. 3 of 166 of 1987."
}