{
  "article_number": "180",
  "title": "Power to restrain fraudulent persons from managing companies.",
  "content": "180.- (1) Where- (a) a person is convicted of any offence in connection with the promotion, formation or management of a company; or (b) in the course of winding up a company it appears that a person- (i) has been guilty of any offence for which he is liable, whether he has been convicted or not, under section 311; or (ii) has otherwise been guilty, while an officer of the company, of any fraud in relation to the company or of any breach of his duty to the company, the Court may make an order that that person shall not, without the leave of the Court, be a director of or in any way, whether directly or indirectly, be concerned or take part in the management of a company for such period not exceeding five years as may be specified in the order. (2) In subsection (1) the expression \"the Court\", in relation to the making of an order against any person by virtue of paragraph (a) thereof, includes the Court before which he is convicted, as well as any Court having jurisdiction to wind up the company, and in relation to the granting of leave means any Court having jurisdiction to wind up the company as respects which leave is sought. (3) A person intending to apply for the making of an order under this section by the Court having jurisdiction to wind up a company shall give not less than ten days' notice of his intention to the person against whom the order is sought, and on the hearing of the application the last-mentioned person may appear and himself give evidence or call witnesses. 157 (4) An application for the making of an order under this section by the Court having jurisdiction to wind up a company may be made by the official receiver, or by the liquidator of the company or by any person who is or has been a member or creditor of the company; and on the hearing of any application for an order under this section by the official receiver or the liquidator, or of any application for leave under this section by a person against whom an order has been made on the application of the official receiver or the liquidator, the official receiver or liquidator shall appear and call the attention of the Court to any matters which seem to him to be relevant, and may himself give evidence or call witnesses. (5) An order may be made by virtue of subparagraph (ii) of paragraph (b) of subsection (1) notwithstanding that the person concerned may be criminally liable in respect of the matters on the ground of which the order is to be made, and for the purposes of the said subparagraph (ii) that expression \"officer”, shall include any person in accordance with whose directions or instructions the directors of the company have been accustomed to act. 3 of 166 of 1987. (6) If any person acts in contravention of an order made under this section, he shall, in respect of each offence, be liable on conviction to imprisonment not exceeding two years or to a fine not exceeding two thousand, five hundred and sixty-two euros or to both such imprisonment and fine. Prohibition of tax-free payments to directors."
}