{
  "article_number": "187",
  "title": "Register of directors’ shareholdings, etc.",
  "content": "187. -(1) Every company shall keep a register showing as respects each director of the company, not being its holding company, the number, description and amount of any shares in or debentures of the company or any other body corporate, being the company's subsidiary or holding company, or a subsidiary of the company's holding company, which are held by or in trust for him or of which he has any right to become the holder, whether on payment or not: Provided that the register need not include shares in any body corporate which is the wholly-owned subsidiary of another body corporate, and for this purpose a body corporate shall be deemed to be the wholly-owned subsidiary of another if it has no members but that other and that other's wholly-owned subsidiaries and its or their nominees. (2) Where any shares or debentures fail to be or cease to be recorded in the said register in relation to any director by reason of a transaction entered into after the commencement of this Law and while he is a director, the register shall also show the date of, and price or other consideration for, the transaction: Provided that where there is an interval between the agreement for any such transaction and the completion thereof, the date shall be that of the agreement. (3) The nature and extent of a director's interest or right in or over any shares or debentures recorded in relation to him in the said register shall, if he so requires, be indicated in the register. (4) The company shall not, by virtue of anything done for the purposes of this section, be affected with notice of, or put upon inquiry as to, the rights of any person in relation to any shares or debentures. (5) The said register shall, subject to the provision of this section, be kept at the company's registered office and shall be open to inspection during business hours (subject to such reasonable restrictions as the company may by its articles or in general meeting impose, so that not less than two hours in each day be allowed for inspection) as follows: 162 (a) during the period beginning fourteen days before the date of the company's annual general meeting and ending three days after the date of its conclusion, it shall be open to the inspection of any member or holder of debentures of the company; and (b) during that or any other period, it shall be open to the inspection of any person acting on behalf of the Council of Ministers. In computing the fourteen days and the three days mentioned in this subsection, any day which is a Saturday or Sunday or a bank holiday shall be disregarded. (6) Without prejudice to the rights conferred by subsection (5), the Council of Ministers may at any time require a copy of the said register, or any part thereof. (7) The said register shall also be produced at the commencement of the company's annual general meeting and remain open and accessible during the continuance of the meeting to any person attending the meeting. 4 of 166 of 1987. 4 of 166 of 1987. 4 of 166 of 1987. (8) If default is made in complying with subsection (7), the company and every officer of the company who is in default shall be liable to a fine not exceeding four hundred twenty-seven euros; and if default is made in complying with subsection (1) or (2), or if any inspection required under this section is refused or any copy required thereunder is not sent within a reasonable time, the company and every officer of the company who is in default shall be liable to a fine not exceeding eight hundred fifty-four euros and further to a default fine of forty-two euros. (9) In the case of any such refusal, the Court may by order compel an immediate inspection of the register. (10) For the purposes of this section- (a) any person in accordance with whose directions or instructions the directors of a company are accustomed to act shall be deemed to be a director of the company; and (b) a director of a company shall be deemed to hold, or to have any interest or right in or over, any shares or debentures if a body corporate other than the company holds them or has that interest or right in or over them, and either- (i) that body corporate or its directors are accustomed to act in accordance with his directions or instructions; or (ii) he is entitled to exercise or control the exercise of one-third or more of the voting power at any general meeting of the body corporate. Particulars in accounts of directors’"
}