{
  "article_number": "191",
  "title": "Disclosure by directors of interests in contracts.",
  "content": "191.-(1) Subject to the provisions of this section, it shall be the duty of a director of a company who is in any way, whether directly or indirectly, interested in a contract or proposed contract with the company to declare the nature of his interest at a meeting of the directors of the company. (2) In the case of a proposed contract the declaration required by this section to be made by a director shall be made at the meeting of the directors at which the question of entering into the contract is first taken into consideration, or if the director was not at the date of that meeting interested in the proposed contract, at the next meeting of the directors held after he became so interested, and in a case where the director becomes interested in a contract after it is made, the said declaration shall be made at the first meeting of the directors held after the director becomes so interested. (3) For the purposes of this section, a general notice given to the directors of a company by a director to the effect that he is a member of a specified company or firm and is to be regarded as interested in any contract which may, after the date of the notice, be made with that company or firm, shall be deemed to be a sufficient declaration of interest in relation to any contract so made: Provided that no such notice shall be of effect unless either it is given at a meeting of the directors or the director takes reasonable steps to secure that it is brought up and read at the next meeting of the directors after it is given. 4 of 166 of 1987. (4) Any director who fails to comply with the provisions of this section shall be liable to a fine not exceeding eight hundred fifty-four euros. (5) Nothing in this section shall be taken to prejudice the operation of any rule of law restricting directors of a company from having any interest in contracts with the company. Register of directors and secretaries."
}