{
  "article_number": "192",
  "title": "Register of directors and secretaries.",
  "content": "192.- (1) Every company shall keep at its registered office a register of its directors and secretaries. (2) The said register shall contain the following particulars with respect to each director, that is to say:- 5 (a) of 151(I) of 2000. (a) in the case of an individual, his present Christian name and surname, any former Christian name or surname, his usual residential address, his nationality, his business occupation, if any, particulars of any other directorships held by him; 168 5(b) of 151 (I) of 2000. (b) in the case of a corporation, its corporate name and registered or principal office; and 5(c) of 151 (I) of 2000. (c) whether he can act on behalf of the company by himself, or whether he must act jointly with the other directors: Provided that it shall not be necessary for the register to contain particulars of directorships held by a director in companies of which the company is the wholly-owned subsidiary, or which are the wholly-owned subsidiaries either of the company or of another company of which the company is the wholly-owned subsidiary, and for the purposes of this proviso- (i) the expression \"company\" shall include any body corporate incorporated in the Republic; and (ii) a body corporate shall be deemed to be the wholly-owned subsidiary of another if it has no members except that other and that other's wholly- owned subsidiaries and its or their nominees. (3) The said register shall contain the following particulars with respect to the secretary or, where there are joint secretaries, with respect to each of them, that is to say:- (a) in the case of an individual, his present Christian name and surname, any former Christian name and surname and his usual residential address; and (b) in the case of a corporation, its corporate name and registered office. (4) The company shall, within the periods respectively mentioned in subsection (5), send to the registrar of companies a return in the prescribed form containing the particulars specified in the said register and a notification in the prescribed form of any change among its directors or in its secretary or in any of the particulars contained in the register, specifying the date of the change. (5) The periods referred to in subsection (4) are the following, namely:- (a) the period within which the said return is to be sent shall be a period of fourteen days from the appointment of the first directors of the company; and (b) the period within which the said notification of a change is to be sent shall be fourteen days from the happening thereof: Provided that, in the case of a return containing particulars with respect of any person who is the company's secretary at the commencement of this Law, the period shall be fourteen days from the commencement of this Law. 169 (6) The register to be kept under this section shall during business hours (subject to such reasonable restrictions as the company may by its articles or in general meeting impose, so that not less than two hours in each day be allowed for inspection) be open to the inspection of any member of the company without charge and of any other person on payment of 0,0854 euros, or such less sum as the company may prescribe, for each inspection. (7) If any inspection required under this section is refused or if default is made in complying with subsection (1), (2), (3) or (4), the company and every officer of the company who is in default shall be liable to a default fine. (8) In the case of any such refusal, the Court may by order compel an immediate inspection of the register. (9) For the purposes of this section- (a) a person in accordance with whose directions or instructions the directors of the company are accustomed to act shall be deemed to be a director and officer of the company; (b) the expression \"Christian name \" includes a forename; (c) references to a former Christian name or surname do not include- (i) in the case of any person, a former Christian name or surname where that name or surname was changed or disused before the person bearing the name attained the age of eighteen years or has been changed or disused for a period of not less than twenty years; or (ii) in the case of a married woman, the name or surname by which she was known previous to the marriage. Particulars with respect to directors in trade catalogues, circulars, etc. 17 (a) of 99(I) of 2009."
}