{
  "article_number": "193",
  "title": "Particulars with respect to directors in trade catalogues, circulars, etc,.",
  "content": "193.-(1) Every company to which this section applies shall, in all trade catalogues, trade circulars and business letters on or in which the company's name appears and which are issued or sent by the company to any person in any place abroad, state in legible characters with respect to every director being a corporation, the corporate name, and with respect to every director being an individual, the following particulars:- (a) his present Christian name, or the initials thereof, and present surname; (b) any former Christian names and surnames; 17 (b) of 99(I) of 2009. (c) his nationality, if not Cypriot: Provided that, if special circumstances exist which render it in the opinion of the Council of Ministers expedient that such an exemption should be granted, the Council of Ministers may by order 170 grant, subject to such conditions as may be specified in the order, exemption from the obligations imposed by this subsection. (2) This section shall apply to- (a) every company registered under this Law, or the Laws repealed thereby; and (b) every company incorporated outside the Republic which has an established place of business within the Republic. 4 of 166 of 1987. (3) If a company makes default in complying with this section every officer of the company who is in default shall be liable on conviction for each offence to a fine not exceeding forty-two euros, and for the purposes of this subsection, where a corporation is an officer of the company, any officer of the corporation shall be deemed to be an officer of the company: Provided that no proceedings shall be instituted under this section except by, or with the consent of, the Attorney-General. (4) For the purposes of this section- (a) the expression \"director\" includes any person in accordance with whose directions or instructions the directors of the company are accustomed to act and the expression \"officer\" shall be construed accordingly; (b) the expression “initials” includes a recognized abbreviation of a Christian name; and paragraphs (b) and (c) of subsection (9) of section 192 shall apply as they apply for the purposes of that section. Company may have directors with unlimited liability."
}