{
  "article_number": "20",
  "title": "Power to dispense with “limited” in name of charitable and other companies.",
  "content": "20. -(1) Where it is proved to the satisfaction of the Council of Ministers that an association about to be formed as a company is to be formed for promoting commerce, art, science, religion, charity or any other useful object, and intends to apply its profits, if any, or other income in promoting its objects, and to prohibit the payment of any dividend to its members, the Council of Ministers may by licence direct that the association may be registered as a company with limited liability, without the addition of the word \"limited\" to its name, and the association may be registered accordingly and shall, on registration, enjoy all the privileges and, subject to the provisions of this section, be subject to all the obligations of limited companies. (2) Where it is proved to the satisfaction of the Council of Ministers- 37 (a) that the objects of a company registered under this Law as a limited company are restricted to those specified in subsection (1) and to objects incidental or conducive thereto; and (b) that by its constitution the company is required to apply its profits, if any, or other income in promoting its objects and is prohibited from paying any dividend to its members, the Council of Ministers may by licence authorize the company to make by special resolution a change in its name including or consisting of the omission of the word \"limited,\" and subsection (3) and (4) of section 1 shall apply to a change of name under this subsection as they apply to a change of name under that section. (3) A licence by the Council of Ministers under this section may be granted on such conditions and subject to such regulations as the Council of Ministers thinks fit, and those conditions and regulations shall be binding on the body to which the license is granted, and, where the grant is under subsection (1), shall, if the Council of Ministers so directs, be inserted in the memorandum and articles, or in one of those documents. (4) A body to which a licence is granted under this section shall be excepted from the provisions of this Law relating to the use of the word \"limited\" as any part of its name, the publishing of its name and the sending of lists of members to the registrar of companies. (5) A licence under this section may at any time be revoked by the Council of Ministers, and upon revocation the registrar shall enter the word \"limited\" at the end of the name upon the register of the body to which it was granted, and the body shall cease to enjoy the exemptions and privileges or, as the case may be, the exemptions granted by this section: Provided that, before a licence is so revoked, the Council of Ministers shall give to the body notice in writing of his intention, and shall afford it an opportunity of being heard in opposition to the revocation. (6) Where a body in respect of which a licence under this section is in force alters the provisions of its memorandum with respect to its objects, the Council of Ministers may, unless he sees fit to revoke the licence, vary the licence by making it subject to such conditions and regulations as the Council of Ministers thinks fit, in lieu of or in addition to the conditions and regulations, if any, to which the licence was formerly subject. (7) Where a licence granted under this section to a body the name of which contains the words \"Chamber of Commerce\" is revoked, the body shall, within a period of six weeks from the date of revocation or such longer period as the Council of Ministers may think fit to allow, change its name to a name which does not contain those words, and- 38 (a) the notice to be given under the proviso to subsection (5) to that body shall include a statement of the effect of the foregoing provisions of this subsection; and (b) subsections (3) and (4) of section 19 shall apply to a change of name under this subsection as they apply to a change of name under that section. 4 of 166 of 1987. If the body makes default in complying with the requirements of this subsection, it shall be liable to a fine not exceeding four hundred, twenty seven euros for every day during which the default continues. General Provisions with respect to Memorandum and Articles Effect of memorandum and articles."
}