{
  "article_number": "200",
  "title": "Provisions for facilitating reconstruction and amalgamation of companies.",
  "content": "200.- (1) Where an application is made to the Court under section 198 for the sanctioning of a compromise or arrangement proposed between a company and any such persons as are mentioned in that section, and it is shown to the Court that the compromise or arrangement has been proposed for the purposes of or in connection with a scheme for the reconstruction of any company or companies or the amalgamation of any two or more companies, and that under the scheme the whole or any part of the undertaking or the property of any company concerned in the scheme (in this section referred to as \"a transferor company\") is to be transferred to another company (in this section referred to as \"the transferee company\"), the Court may, either by the order sanctioning the compromise or arrangement or by any subsequent order, make provision 174 for all or any of the following matters- (a) the transfer to the transferee company of the whole or any part of the undertaking and of the property or liabilities of any transferor com- pany; (b) the allotting or appropriation by the transferee company of any shares, debentures, policies or other like interests in that company which under the compromise or arrangement are to be allotted or appropriated by that company to or for any person; (c) the continuation by or against the transferee company of any legal proceedings pending by or against any transferor company; (d) the dissolution, without winding up, of any transferor company; (e) the provision to be made for any persons, who within such time and in such manner as the Court directs, dissent from the compromise or arrangement; (f) such incidental, consequential and supplemental matters as are necessary to secure that the reconstruction or amalgamation shall be fully and effectively carried out. (2) Where an order under this section provides for the transfer of property or liabilities, that property shall, by virtue of the order, be transferred to and vest in, and those liabilities shall, by virtue of the order, be transferred to and become the liabilities of, the transferee company, and in the case of any property, if the order so directs, freed from any charge which is by virtue of the compromise or arrangement to cease to have effect. (3) Where an order is made under this section, every company in relation to which the order is made shall cause an office copy thereof to be delivered to the registrar of companies for registration within seven days after the making of the order, and if default is made in complying with this subsection, the company and every officer of the company who is in default shall be liable to a default fine. (4) In this section the expression \"property\" includes property, rights and powers of every description, and the expression \"liabilities \" includes duties. (5) Notwithstanding the provisions of subsection (5) of section 198, the expression \"company\" in this section does not include any company other than a company within the meaning of this Law. Power to acquire shares of shareholders dissenting from scheme"
}