{
  "article_number": "201A",
  "title": "Scope of application of provisions.",
  "content": "201A.- (1) Subject to subsections (1) and (2), the following company reorganizations mentioned in paragraphs (a) to (c) shall also be governed, except for sections 198 to 201, by the provisions of sections 201B to 201H: (a) Merger by acquisition of one or more public companies by another public company. Such a merger shall mean: (i) The act by which one or more companies are wound up without going into liquidation and transfer all their assets and liabilities to another existing company making available to their shareholders shares of the latter company (the acquiring company) and any setting off amount in cash. (ii) The acquisition of a company by another, which holds 90% or more, but not the total shares of the first. (iii) The act by which one or more companies are wound up without going into liquidation and transfer, their total assets and liabilities, to another company to which all their shares and other titles which confer a right to vote at general meeting belong: Provided that a merger by acquisition may also be effected even when one or more of the companies being acquired are in liquidation, so long as the distribution of their assets among their shareholders has not yet commenced: Provided further that the provisions for the evaluation of the contributions in kind provided for in section 47B shall apply to the cases mentioned in this subparagraph. (b) Merger of public companies by formation of a new public company. Such an act is an act by which more companies are wound up without going into liquidation and transfer to one company, that they set up, their total assets and liabilities, making available to their shareholders the shares of the new company and any setting off amount in cash: Provided that a merger by formation of a new company may also be effected when one or more of the companies being divided are in liquidation so long as the distribution of their assets among their shareholders has not yet commenced: Provided further that the provisions for the evaluation of the contributions in kind provided for in section 47B shall apply to the incorporation of the new company, referred to in this paragraph. (c) Division of public companies. This shall mean: 178 (i) Division by acquisition, that is, the act by which a company is dissolved without going into liquidation and transfers to numerous existing companies (the recipient companies) its total assets and liabilities through a distribution to its shareholders, first, of shares of the above companies receiving the company contributions arising out of the division and second, any setting off amount in cash; (ii) Division by formation of new companies , that is the act by which a company is dissolved without going into liquidation and transfers to numerous existing companies (the recipient companies) its total assets and liabilities through a distribution to its shareholders, first, of shares of the above companies receiving the company contributions arising out of the division and second, any setting off amount in cash: Provided that a division by formation of a new company may also be effected when the company being divided is in liquidation, so long as the distribution of its assets among its shareholders has not yet commenced: Provided further that the provisions for the evaluation of the contributions in kind provided for in section 47B shall apply to the formation of the new company. (2) The following shall be exempt from the provisions of sections 201B to 201G and as a result only sections 198 to 201 are applicable thereto: (a) Each company reorganization which is not expressly provided for in the above definitions of subsection (1): Provided that, where an act falls within the ambit of a company reorganization under the above definitions and is prohibited by sections 201B to 201D hereinbelow, such an act shall not be exempt. (b) Reorganizations of public companies which are conducted by purchase, sale or exchange of shares or debentures. (c) Reorganizations of public companies which are conducted by stock exchange transactions, in particular, by way of a public offering for buy out of shares or debentures. (3) Sections 201B to 201G shall not apply to cases where the company being merged, in the case of a merger or the company which ceases to exist in the case of division is a public company going into liquidation or compromise. Limitations of general nature regarding"
}