{
  "article_number": "201C",
  "title": "Procedure regarding reorganizations falling within section 201A – Draft terms",
  "content": "201C.-(1)(a) The directors of the companies, which participate in the company reorganization described in section 201A, shall draw up draft terms of merger or division, as the case may be. (b)The draft terms mentioned in paragraph (a) shall include at least the following particulars: (i) the type, name and registered office of the companies; (ii) the relationship of the exchange of the shares , as well as the amount of the agreed sum, if any, in cash: 9(a) of 70(I) of 2007. 4(a) of 64(I) of 2012. Provided that, this information shall not be required in case of a company reorganization pursuant to subparagraphs (ii) and (iii) of paragraph (a) of subsection (1) of section 201A. (iii) the manner of disposition of the shares of the acquiring company in the case of merger or the recipient companies in the case of division: 9(b) of 70(I) of 2007. 4(b) of 64(I) of 2012. Provided that, this information shall not be required in case of a company reorganization pursuant to subparagraphs (ii) and (iii) of paragraph (a) of subsection (1) of section 201A. (iv) the date from which the holding of such shares entitles the holders to participate in profits as well as any special conditions affecting that entitlement: 9(c) of 70(I) of 2007. 4(c) of 64(I) of 2012. Provided that, this information shall not be required in case of a company reorganization pursuant to subparagraphs (ii) and (iii) of paragraph (a) of subsection (1) of section 201A. (v)the date from which the acts of the company being acquired or being divided are considered, from an accounting point of view, to have been carried out on behalf of the acquiring company or on behalf of one of the recipient companies, respectively; (vi) the rights conferred by the acquiring company or the recipient 180 companies on the shareholders with special rights and the beneficiaries of titles other than shares, or the measures proposed for them; (vii) all special advantages provided to the experts in accordance with subsection (3) as well as to the directors of the merging companies or the companies involved in the division. (c)When the draft terms mentioned in paragraph (a) constitutes draft terms of division, these terms shall also mention, apart from what is provided for in paragraph (b), the following: (i) The exact description and allocation of the assets and liabilities to be transferred to each of the recipient companies; (ii) The allocation to the shareholders of the company being divided of the shares of the recipient companies, as well as the criterion on which this allocation is based. 4 (d) of 64(I) of 2012. (d) The draft terms shall be published in accordance with section 365A at least 30 days before the date on which the general meeting is held which is convened to decide upon the conversion: Provided that the company being merged or divided shall be exempt from the above publication requirement if, for a continuous time period beginning at least one month before the day fixed for the general meeting which is to decide on the draft terms of merger or division and ending not earlier than the conclusion of that meeting, it makes the draft terms of such merger or division available on its website free of charge for the public. The information which is published on the company’s website is maintained for a period of one month after the conclusion of the general meeting. Such period shall be extended by such time period which shall be proportionate to the disruption of access to the website caused by technical or other factors. 9(d) of 70(I) of 2007. 4(e) of 64(I) of 2012. (2) (a) The directors of each company being merged or divided shall draw up a detailed written report explaining and justifying the draft terms of merger from a legal and economic aspect and, in particular, the share exchange ratio. Such report shall also describe any special valuation difficulties which have arisen: Provided that, in the event of a division, the above written report shall additionally refer to, as the case may be, the compiling of a report for the valuation of the value of the contributions in kind in accordance with section 47B. 9(e) of 70(I) of 2007. (b) The drafting of the directors’ report provided for in paragraph (a) shall not be required in case of a company reorganization pursuant to subparagraph (iii) of paragraph (a) of subsection (1) of section 201A. 9(f) of 70(I) of (c) The directors of each of the companies participating in the merger 181 2007. 4 (f) of 64(I) of 2012. 4(g) of 64(I) of 2012. or division of the company shall inform the general meeting of their company as well as the board of directors of the other companies participating so that the latter may inform their respective general meetings of any material change in the assets and liabilities between the date of preparation of the draft terms of merger or division and the date of the general meetings which are to decide on the draft terms of merger or division. (d) The report referred to in paragraph (a) and/or the information referred to in paragraph (c) shall not be required if all the shareholders and the holders of other securities conferring the right to vote of each of the companies participating in the merger or division have so agreed. (3) (a) The draft terms provided in subsection (1) and the reports provided in subsection (2) shall be examined by independent experts (natural or legal persons) one for each participating company, appointed specifically for this purpose by the Court after application by the participating companies. The participating companies may request the appointment of a joint expert. (b)The expert shall have the right to request every useful information and document from the companies and to carry out all necessary investigations. (c) The expert shall draft a written valuation report, intended for the shareholders, in which he must state whether in his opinion the share exchange ratio is fair and reasonable or not and in which he must at least mention: (i) the method or methods used to arrive at the share exchange ratio proposed; (ii) whether such method or methods are adequate in the case in question, indicating the values arrived at using each such method and giving at the same time an opinion on the relative importance attributed to such methods in arriving at the value decided on, (iii) any special evaluation difficulties which have arisen. 9(g) of 70(I) of 2007. 2(a) of 49(I) of 2009. (d) The production of the expert’s valuation report shall not be required in the case of a company reorganization pursuant to subparagraph (iii) of paragraph (a) of subsection (1) of section 201A. (e) Neither an examination of the draft terms of merger or division nor an expert report shall be required if all the shareholders and the holders of other securities conferring the right to vote of each of the companies involved in the merger or division have so agreed. (4) Each shareholder of the participating companies shall be entitled to inspect at least the following documents at the registered office of the company and to receive, if so wishes, free of charge and on 182 4(h) of 64(I) of 2012. application, a complete copy or extract of the said documents at least thirty days before the day on which the general meeting is convened which is to decide upon the draft terms or where a shareholder has consented to the use by the company of electronic means for conveying information, he may request that the following documents are sent by electronic mail: (a) the draft terms; (b) the annual accounts as well as the reports of the management bodies for the last three financial years of the merging companies or of the companies involved in the division, respectively, (c) the interim accounts drawn up as at a date which must not be earlier than the first day of the third month preceding the date of the draft terms if the latest annual accounts relate to a financial year which ended more than six months before that date: Provided that, these interim accounts must be prepared in accordance with the same methods and be presented in the same manner as the last annual accounts: Provided further that: (i) It is not mandatory that a new real inventory be made, 4(i) of 64(I) of 2012. (ii) the valuations in the last balance sheet shall be varied only during the variation of the registrations in the company books, however the interim depreciations and predictions will be taken into account as well as important changes of real value which do not arise from the registrations: Provided even further that, the right of the shareholder pursuant to this subsection shall not apply, where the company publishes a half-yearly financial report in accordance with section 10 of the Transparency Requirements (Securities Admitted to Trading on a Regulated Market) Law, which it makes available to the shareholders: Provided even further that, the preparation of interim account statements shall not be required if all the shareholders and the holders of other securities conferring the right to vote of each of the companies involved in the merger have so agreed. (d) the report of the directors of the participating companies according to subsection (2); 2(b) of 49(I) of 2009. (e) as the case may be, the expert’s report-valuation according to subsection (3): 9(h) of 70(I) of 2007. Provided that in case of a company reorganization referred to in subparagraph (iii) of paragraph (a) of subsection (1) of section 201(A), the shareholder’s right by virtue of this subsection shall not exist in respect of those documents mentioned in paragraphs (d) and (e), in 183 4 (j) of 64(I) of 2012. 4(j) of 64(I) of 2012. case those documents are not prepared due to the application of the exemptions contained in paragraph (b) of subsection (2) and in paragraph (d) of subsection (3); (f) a company shall be exempt from the requirement to make the documents referred to in paragraphs (a) to (e) available at its registered office if, for a continuous period beginning at least one month before the day fixed for the general meeting which is to decide on the draft terms of merger or division and ending not earlier than the conclusion of that meeting, it makes them available on its website. The information which is published on the company’s website is maintained for a period of one month after the conclusion of the general meeting. This period shall be extended by such time period which shall be proportionate to the disruption of access to the website caused by technical or other factors; (g) the right of the shareholders to receive free of charge subject to a mere application, a copy of the documents referred to in paragraphs (a) to (e) shall not apply if the company’ s website gives shareholders the possibility, throughout the period referred to in paragraph (f), of downloading and printing the said documents: Provided that in this case, the company shall make such documents available at its registered office for inspection by the shareholders. 4 (k) of 64 (I) of 2012. 3(a) of 75(I) of 2014. (5) The reorganization shall be decided upon by the general meeting of each participating company, applying subsection (2) of section 198 as to voting and to the extent the decision entails the amendment of the articles, applying by way of supplementation to the provisions as to the amendment of the articles: Provided, that in the event of merger by acquisition of one or more companies by a company which holds 90% or more, but not all, of the shares conferring the right to vote at general meetings of the company being acquired, or in the event where one or more companies are wound up without going into liquidation and transfer their total assets and liabilities to another company to which all their shares and other titles which confer a right to vote at general meeting belong, the approval of the general meeting of the acquiring company shall not be required if the following conditions are fulfilled: (i) there has been a publication in accordance with section 365A at least one month before the day of calling the general meeting of the acquiring company or of the companies being acquired which are to decide on the common draft terms of the merger, (ii) all the shareholders of such company, at least one month before the day of calling the general meeting, have the right to have knowledge, at its registered office, of the documents referred to in paragraphs (a), (b), and, as the case may be, (c), (d), and (e) of subsection (4) of 184 section 201C, subject to its provisions, (iii) one or more shareholders of the acquiring company, holding at least 5% of the subscribed capital, have the right to call a general meeting of the acquiring company, which is to decide on the common draft terms of the merger: Provided further, that in the event of division, the approval of the division by the general meeting of the recipient company shall not be required, if the following conditions are fulfilled: (i) there has been a publication in accordance with section 365A at least one month before the day of calling the general meeting of the company being divided which is to decide on the common draft terms of the merger, (ii) all the shareholders of the recipient company, at least one month before the day of calling the general meeting, have the right to have knowledge, at its registered office, of the documents referred to in paragraphs (a), (b), and, as the case may be, (c), (d), and (e) of subsection (4) of section 201C, subject to its provisions, (iii) one or more shareholders of the recipient company, holding shares which correspond to at least 5% of the subscribed capital, have the right to call a general meeting of the recipient company, which is to decide on the common draft terms of the division; (6) In the case of division- (a) When an asset is not allocated to anyone under the draft terms of division and the interpretation of the scheme does not provide for the possibility of a decision as to how this should be allocated, this asset or its equivalent value shall be allocated among all the recipient companies according to the net assets allocated to each of those companies under the draft terms of division, 2(c) of 49(I) of 2009. 4(l) of 64(I) of 2012. 4(m) of 64(I) of 2012. (b) when a liability is not allocated to anyone under the draft terms of division and the interpretation of the scheme does not provide for the possibility of a decision as to how this should be allocated, each one of the recipient companies shall be jointly and severally liable. The liability shall be restricted to the net assets allocated to each recipient company, (c) Deleted. (7) In the event of merger by acquisition of one or more companies by a company which holds 90% or more, but not all, of the shares conferring the right to vote at general meetings of the company being acquired, the requirements of subsections (2), (3) 185 and (4) shall not be required if the following conditions are fulfilled: (a) the minority shareholders of the company being acquired may exercise the right to redeem their shares on behalf of the acquiring company; (b) in this case, the minority shareholders shall have a claim which is equivalent to the value of their shares; in the event of disagreement, this sum shall be determined by the court. 3(b) of 75(I) of 2014. Protection of third parties. Protection of creditors and holders of debentures. 31 of 70(I) of 2003. (8) In the event of a cross-border merger by acquisition of one or more companies by a company which holds 90% or more, but not all, of the shares and other titles conferring the right to vote at general meetings of the company or companies being acquired, the requirements of subsections (2), (3) and (4) shall not be required, unless required by the national law that governs the company or companies being acquired."
}