{
  "article_number": "201D",
  "title": "Protection of third parties. Protection of creditors and  holders of debentures.",
  "content": "201D.-(1) (a) As regards the protection of the creditors in relation to their claims created before the publication of the draft terms provided for in section 201C and which have not fallen due as at the date of publication, paragraph (e) of subsection (1) of section 200 shall be applicable. (b)The order to be issued by the Court must provide for an obligation of the participating companies to provide suitable guarantees to the creditors when- (i) the financial status of the merging companies (in the case of merger by acquisition or by formation of new company) or of the company being divided as well as the company which in accordance with the draft terms of division shall undertake the obligation towards the creditors (in the case of division) render this protection mandatory, and 5 of 64(I) of 2012. (ii) provided the said creditors do not already have similar safeguards: Provided that the creditors are entitled to apply to the district court for adequate safeguards provided that they can credibly demonstrate that, due to the merger, the satisfaction of their claims is at stake and that no adequate safeguards have been obtained from the company. (c) If in the case of a division a creditor of a company, to which the respective obligation has been transferred in accordance with the draft terms, has not been satisfied, each one of the recipient companies shall be severally and jointly liable for this obligation. This liability for each recipient company shall be restricted to the net assets distributed to it, except for the company to which the obligation has been transferred. 186 (2) (a) As regards the protection of holders of debentures of the merging companies, or of the companies involved in the division, paragraph (e) of subsection (1) of section 200 shall be applicable, except where the merger or division has been approved by a meeting of the holders of debentures pursuant to the procedure provided for in subsection (2) of section 198, or by the holders themselves, individually. (b)If, in the case of a division a holder of debentures of a company to which the respective obligation has been transferred in accordance with the draft terms of division, has not been satisfied, each one of the recipient companies shall be jointly and severally liable for the obligation. The liability shall be restricted for each recipient company to the net assets distributed to it, except for the company to which the obligation has been transferred. Powers of the Court. 31 of 70(I) of 2003."
}