{
  "article_number": "201I",
  "title": "Interpretation",
  "content": "201I. For the purposes of application of sections 201J to 201X, unless the context otherwise requires- “cross border merger of limited-liability companies” means the merger of limited-liability companies, which have been incorporated in accordance with the legislation of a member state and which have their registered office, their central administration or their principal place of business within the Community, provided that at least two of such companies are governed by the law of different member states; “Regulation (EC) No. 2157/2001” means Council Regulation (EC) No. 2157/2001 of 8 October 2001 on the Statute for a European company (SE), as amended and/or substituted from time to time; “limited-liability company” means: (a) a company of a member state of the European Union and a Cyprus company, or (b) a company with share capital and having legal personality, possessing separate assets which alone serve to cover its debts and subject under the national law governing it, to conditions concerning guarantees such as are provided for by Directive 68/151/EEC for the protection of the interests of members and others; “Cyprus company” means a company in the context of subsection (1) of section 2 of this Law; “Directive 68/151/EEC” means First Council Directive 68/151/EEC of 9 March 1968 on co-ordination of safeguards which, for the protection of the interests of members and others, are required by member states of companies within the meaning of the second paragraph of article 58 of the Treaty, with a view to making such safeguards equivalent  Law 186(I) of 2007 uses the term “Κεφαλαιουχική εταιρεία’’ which means ‘’Company having share capital’’. Nevertheless, for the purposes of compatibility with the Community legislation, the term ‘’limited-liability company’’ is used in the text. 189 Official Journal of the EU: L294, 10.11.2001, p. 22. Official Journal of the EU: L310, 25.11.2005, p.1. throughout the Community, as amended and/or substituted from time to time; “Directive 2001/86/EC” means Council Directive 2001/86/EC of 8 October 2001 supplementing the Statute for a European company with regard to the involvement of employees, as amended and/or substituted from time to time; “Directive 2005/56/EC means Directive 2005/56/EC of the European Parliament and of the Council of 26 October 2005 on cross-border mergers of limited-liability companies, as amended and/or substituted from time to time; “merger” means an operation whereby: (a) one or more limited-liability companies, on being dissolved without going into liquidation, transfer all their assets and liabilities to another existing limited-liability company - the acquiring company - in exchange for the issue to their members of securities or shares representing the capital of that acquiring company and, if applicable, a cash payment not exceeding 10% of the nominal value, or, in the absence of a nominal value, of the accounting par value of those securities or shares; or (b) two or more limited-liability companies, on being dissolved without going into liquidation, transfer all their assets and liabilities to a limited- liability company that they form - the new company - in exchange for the issue to their members of securities or shares representing the capital of that new company and, if applicable, a cash payment not exceeding 10% of the nominal value, or in the absence of a nominal value, of the accounting par value or those securities or shares; or (c) a limited-liability company, on being dissolved without going into liquidation, transfers all its assets and liabilities to the limited-liability company holding all the securities or shares representing its capital. Scope of application. 2 of 186(I) of 2007."
}