{
  "article_number": "201M",
  "title": "Publication",
  "content": "201M.-(1) The Directors of each of the merging Cyprus companies shall file in time before the Registrar of Companies the common draft terms of the cross-border merger, mentioned in section 201L, which shall be published, in accordance with the provisions of section 365A, for each of the merging Cyprus companies, at least one month before the date of the general meeting which is to decide thereon: Provided that each one of the merging Cyprus companies shall be exempt from the above publication requirement if, for a continuous time period beginning at least one month before the day fixed for the general meeting which is to decide on the common draft terms of cross-border merger and ending not earlier than the conclusion of that meeting, it makes the common draft terms of such merger available on its website free of charge for the public. The information which is published on the company’s website is maintained for a period of one month after the conclusion of the general meeting. This period shall be extended by such time period which shall be proportionate to the disruption of access to the website caused by technical or other factors. (2) The Directors of each of the merging Cyprus companies shall file in time before the Registrar of Companies the following particulars for 192 each of the merging companies, which shall be published in the Official Gazette of the Republic in accordance with the provisions of section 365A: (a) the type, name and registered office of every merging limited- liability company; (b) the register in which the documents referred to in section 365A of this Law are filed in respect of each merging company and, in respect of each of the remaining merging companies of another member state, those documents required by the relevant national legislation transposing the provisions of Article 3(2) of Directive 68/151/EEC, as well as the number of the entry in that register; (c) an indication, for each of the merging limited-liability companies, of the arrangements made for the exercise of the rights of creditors and of any minority members of the merging companies and the address at which complete information on those arrangements may be obtained free of charge. Directors’ report. 2 of 186(I) of 2007."
}