{
  "article_number": "201O",
  "title": "Independent expert report",
  "content": "201O.- (1) An independent expert report intended for members and made available not less than one month before the date of the general meeting referred to in section 201P shall be drawn up for each merging Cyprus company. Such experts may be natural or legal persons and are appointed by the Court following an application by the relevant merging Cyprus company. (2) As an alternative to experts operating on behalf of each of the merging limited liability companies, one or more independent experts, appointed for that purpose at the joint request of the merging limited liability companies by a competent judicial or administrative authority in the member state the legislation of which governs one of the merging limited-liability companies or the limited-liability company resulting from the cross-border merger or approved by such an authority, may examine the common draft terms of cross-border merger and draw up a single written report to all the members of the merging limited-liability companies. 193 (3) The expert report shall include at least the following particulars: (a) the method or methods used to arrive at the share exchange ratio proposed; (b) state whether such method or methods are adequate in the case in question, indicating the values arrived at using each such method and giving at the same time, an opinion on the relative importance attributed to such methods in arriving at the value decided on; (c) any special valuation difficulties. (4) The independent experts shall be entitled to secure from each of the merging companies all information they consider necessary for the discharge of their duties. (5) If all the members of each of the companies involved in the cross- border merger have so agreed, neither an examination of the common draft terms of cross-border merger by independent experts nor an expert report shall be required. Approval by the general meeting. 2 of 186(I) of 2007."
}