{
  "article_number": "201R",
  "title": "Scrutiny of the legality of the cross-border merger",
  "content": "201R.- (1) Where the limited-liability company resulting from the cross- border merger is governed by this Law, the District Court of the district where the registered office of the said company is situated shall be competent to scrutinise the legality of the cross-border merger as regards that part of the procedure which concerns the completion of the cross- border merger and, where appropriate, the formation of the new company resulting from the cross border merger. (2) In exercising its scrutiny referred to in subsection (1), the District Court shall, in particular, ensure that the merging limited-liability companies have approved the common draft terms of cross-border merger in the same terms and, as the case may be, whether the arrangements for employee participation in each of the merging Cyprus companies have been determined in accordance with section 201W of this Law and for each merging non-Cyprus company in accordance with the relevant national legislation transposing the provisions of Article 16 of Directive 2005/56/EC. (3) For the purpose of exercising the scrutiny referred to in subsection (2), each merging Cyprus company shall submit to the District Court the certificate referred to in subsection (2) of section 201Q and every other non-Cyprus merging company the certificate issued by the competent authority subject to the relevant national legislation according to Article 10(2) of Directive 2005/56/EC within six months of its issue, together with the common draft terms of cross-border merger approved by the general meeting in accordance with section 201P where Cyprus merging companies are concerned and in accordance with the provisions of Article 9 or of Directive 2005/56/EC where all other non Cyprus merging companies are concerned. (4) Provided that the District Court is satisfied with the legality of the procedure concerning the completion of the cross-border merger, it shall make a decision approving the completion of the cross border 195 merger and shall authorise the entry into force of the cross-border merger. Entry into effect of the cross border merger. 2 of 186(I) of 2007."
}