{
  "article_number": "201U",
  "title": "Consequences of the cross-border merger",
  "content": "201U.- (1) A cross-border merger carried out as laid down in paragraphs (a) and (c) of section 201I shall, from the date referred to in 201S, have the following consequences: (a) all the assets and liabilities of the company being acquired shall be transferred to the acquiring company; (b) the members of the company being acquired shall become members of the acquiring company; (c) the company being acquired shall cease to exist. 196 (2) A cross-border merger carried out as laid down in paragraph (b) of section 201I above shall, from the date referred to in section 201S, have the following consequences: (a) all the assets and liabilities of the merging companies shall be transferred to the new company; (b) the members of the merging companies shall become members of the new company; (c) the merging companies shall cease to exist. (3) The limited-liability company resulting from the cross border merger shall comply with the formalities required by this Law or in the case of the merging limited-liability non-Cyprus companies the laws to which such companies are subject to, as regards the completion of special formalities before the transfer of certain assets, rights and obligations by the merging companies becomes effective against third parties. (4) The rights and obligations of the merging limited-liability companies arising from contracts of employment or from employment relationships and existing at the date on which the cross-border merger takes effect shall, by reason of that cross-border merger taking effect, be transferred to the limited-liability company resulting from the cross- border merger on the date on which the cross-border merger takes effect. (5) No shares in the acquiring company shall be exchanged for shares in the company being acquired held either: (a) by the acquiring company itself or through a person acting in his or her own name but on its behalf; (b) by the company being acquired itself or through a person acting in his or her own name but on its behalf. Simplified formalities. 2 of 186(I) of 2007."
}