{
  "article_number": "202",
  "title": "Alternative remedy to winding up in cases of oppression.",
  "content": "202. (1) Any member of a company who complains that the affairs of the company are being conducted in a manner oppressive to some part of the members (including himself) or, in a case falling within subsection (3) of section 163, the Council of Ministers may cause an application to be made to the Court by petition for an order under this section. (2) If on any such petition the Court is of opinion- (a) that the company's affairs are being conducted as aforesaid; and (b) that to wind up the company would unfairly prejudice that part of the members, but otherwise the facts would justify the making of a winding- up order on the ground that it was just and equitable that the company should be wound up, the Court may, with a view to bringing to an end the matters complained of, make such order as it thinks fit, whether for regulating the conduct of the company's affairs in future, or for the purchase of the shares of any members of the company by other members of the company or by the company and, in the case of a purchase by the company, for the reduction accordingly of the company's capital, or otherwise. (3) Where an order under this section makes any alteration in or addition to any company's memorandum or articles, then, notwithstanding anything in any other provision of this Law but subject to the provisions of the order, the company concerned shall not have power without the leave of the Court to make any further alteration in or 200 addition to the memorandum or articles inconsistent with the provisions of the order; but, subject to the foregoing provisions of this subsection, the alterations or additions made by the order shall be of the same effect as if duly made by resolution of the company and the provisions of this Law shall apply to the memorandum or articles as so altered or added to accordingly. (4) An office copy of any order under this section altering or adding to, or giving leave to alter or add to, a company’s memorandum or articles shall, within fourteen days after the making thereof, be delivered by the company to the registrar of companies for registration; and if a company makes default in complying with this subsection, the com- pany and every officer of the company who is in default shall be liable to a default fine. (5) In relation to a petition under this section, section 333 shall apply as it applies in relation to a winding-up petition. PART V.- WINDING UP (I) PRELIMINARY Modes of Winding Up Modes of winding up."
}