{
  "article_number": "209",
  "title": "Jurisdiction for winding up.",
  "content": "209.- (1) Subject to the provisions of section 22 of the Courts of Justice Law, the District Court of the district where the registered office of a company is situated shall have jurisdiction to wind up any company registered in the Republic: 203 Provided that for the determination of whether the procedure falls under the jurisdiction of a Senior District Judge or a District Judge, the amount of the share capital of the company which has been paid up or been credited as paid up shall be taken into account: 14 of 1960 50 of 1962 11 of 1963 8 of 1969 40 of 1970 58 of 1972 1 of 1980 35 of 1982 16 of 1983 29 of 1983 91 of 1983 16 of 1984 51 of 1984 83 of 1984 93 of 1984 18 of 1985 71 of 1985 89 of 1985 96 of 1986 317 of 1987 49 of 1988 64 of 1990 136 of 1991 149 of 1991 237 of 1991 42(I)of 1992 43(I) of 1992 102(I) of 1992 26(I) of 1993 82(I) of 1995 102(I) of 1996 4(I) of 1997 53(I) of 1997 90(I) of 1997 27(I) of 1998 53(I) of 1998 110(I) of 1998 34(I) of 1999 146(I) of 1999 41(I) of 2000 32(I) of 2001 40(I) of 2002 80(I) of 2002 140(I) of 2002 206(I) of 2002 17(I) of 2004 165(I) of 2004 268(I) of 2004 21(I) of 2006 99(I) of 2007 170(I) of 2007 76(I) of 2008 81(I) of 2008 118(I) of 2008 119(I) of 2008 36(I) of 2009 129(I) of 2009 Provided further that, subject to the Courts of Justice Law, any interim order during the winding up proceeding may be made by a Senior District Judge or District Judge, irrespective of whether the proceeding would not have come under the jurisdiction of the Senior District Judge or District Judge, in accordance with the provisions of this subsection. 204 138(I) of 2009 19(I) of 2010 166(I) of 2011. 2(b) of 82(I) of 1999. (2) For the purposes of this section, the expression \"registered office\" means the place which has longest been the registered office of the company during the six months immediately preceding the presentation of the petition for winding up. Transfer of proceedings from one Court to another and statement of case by the Court."
}