{
  "article_number": "213",
  "title": "Provisions as to applications for winding up.",
  "content": "213.- (1) An application to the Court for the winding up of a company shall be by petition presented, subject to the provisions of this section, either by the company or by any creditor or creditors (including any contingent or prospective creditor or creditors), contributory or contributories, or by all or any of those parties, together or separately: Provided that- (a) a contributory shall not be entitled to present a winding up petition unless- (i) either the number of members is reduced, in the case of a private company, below two , or, in the case of any other company, below seven; or (ii) the shares in respect of which he is a contributory, or some of them, either were originally allotted to him or have been held by him, and registered in his name, for at least six months during the eighteen months before the commencement of the winding up, or have devolved on him through the death of a former holder; and (b) a winding-up petition shall not, if the ground of the petition is default in delivering the statutory report to the registrar or in holding the 206 statutory meeting, be presented by any person except a shareholder, nor before the expiration of fourteen days after the last day on which the meeting ought to have been held; and (c) the Court shall not give a hearing to a winding-up petition presented by a contingent or prospective creditor until such security for costs has been given as the Court thinks reasonable and until a prima facie case for winding up has been established to the satisfaction of the Court; and (d) in a case falling within subsection (3) of section 163, a winding-up petition may be presented by the Attorney-General. (2) Where a company is being wound up voluntarily or subject to supervision, a winding-up petition may be presented by the official receiver attached to the Court as well as by any other person authorized in that behalf under the other provisions of this section, but the Court shall not make a winding-up order on the petition unless it is satisfied that the voluntary winding up or winding up subject to supervision cannot be continued with due regard to the interests of the creditors or contributories. Powers of Court on hearing petition."
}