{
  "article_number": "224",
  "title": "Statement of company’s affairs to be submitted to official receiver.",
  "content": "224. - (1) Where the Court has made a winding-up order or appointed a provisional liquidator, there shall, unless the Court thinks fit to order otherwise and so orders, be made out and submitted to the official receiver a statement as to the affairs of the company in the prescribed form, verified by affidavit, and showing the particulars of its assets, debts and liabilities, the names, residences and occupations of its creditors, the securities held by them respectively, the dates when the securities were respectively given, and such further or other information as may be prescribed or as the official receiver may require. (2) The statement shall be submitted and verified by one or more of the persons who are at the relevant date the directors and by the person who is at that date the secretary of the company, or by such of the persons hereinafter in this subsection mentioned as the official receiver, subject to the direction of the Court, may require to submit and verify the statement, that is to say, persons- (a) who are or have been officers of the company; (b) who have taken part in the formation of the company at any time within one year before the relevant date; (c) who are in the employment of the company, or have been in the employment of the company within the said year, and are in the opinion 209 of the official receiver capable of giving the information required; (d) who are or have been within the said year officers of or in the employment of a company which is, or within the said year was, an officer of the company to which the statement relates. (3) The statement shall be submitted within fourteen days from the relevant date or within such extended time as the official receiver or the Court may for special reasons appoint. (4) Any person making or concurring in making the statement and affidavit required by this section shall be allowed, and shall be paid by the official receiver or provisional liquidator, as the case may be, out of the assets of the company such costs and expenses incurred in and about the preparation and making of the statement and affidavit as the official receiver may consider reasonable, subject to an appeal to the Court. 4 of 166 of 1987. (5) If any person, without reasonable excuse, makes default in complying with the requirements of this section, he shall be liable to a fine not exceeding eighty-five euros for every day during which the default continues. (6) Any person stating himself in writing to be a creditor or contributory of the company shall be entitled by himself or by his agent at all reasonable times, on payment of the prescribed fee, to inspect the statement submitted in pursuance of this section, and to a copy thereof or extract therefrom. (7) Any person untruthfully so stating himself to be a creditor or contributory shall be guilty of a contempt of Court and shall, on the application of the liquidator or of the official receiver, be punishable accordingly. (8) In this section the expression \"the relevant date” means, in a case where a provisional liquidator is appointed, the date of his appointment, and, in a case where no such appointment is made, the date of the winding-up order. Report by official receiver."
}