{
  "article_number": "241",
  "title": "Constitution and proceedings of committee of inspection.",
  "content": "241.- (1) A committee of inspection appointed in pursuance of this Law shall consist of creditors and contributories of the company or persons holding general powers of attorney from creditors or contributories in such proportions as may be agreed on by the meetings of creditors and contributories or as, in case of difference, may be determined by the Court. (2) The committee shall meet at such times as they from time to time appoint, and, failing such appointment, at least once a month, and the liquidator or any member of the committee may also call a meeting of the committee as and when he thinks necessary. (3) The committee may act by a majority of their members present at a meeting but shall not act unless a majority of the committee are present. (4) A member of the committee may resign by notice in writing signed by him and delivered to the liquidator. (5) If a member of the committee becomes bankrupt or compounds or arranges with his creditors or is absent from five consecutive meetings of the committee without the leave of those members who together with himself represent the creditors or contributories, as the case may be, his office shall thereupon become vacant. 217 (6) A member of the committee may be removed by an ordinary resolution at a meeting of creditors, if he represents creditors, or of contributories, if he represents contributories, of which seven days' notice has been given, stating the object of the meeting. (7) On a vacancy occurring in the committee the liquidator shall forthwith summon a meeting of creditors or of contributories, as the case may require, to fill the vacancy, and the meeting may, by resolution, re-appoint the same or appoint another creditor or contributory to fill the vacancy: Provided that if the liquidator, having regard to the position in the winding up, is of the opinion that it is unnecessary for the vacancy to be filled he may apply to the Court and the Court may make an order that the vacancy shall not be filled, or shall not be filled except in such circumstances as may be specified in the order. (8) The continuing members of the committee, if not less than two, may act notwithstanding any vacancy in the committee. Where no committee of inspection."
}