{
  "article_number": "256",
  "title": "Power to order public examination of promoters and officers.",
  "content": "256.- (1) Where an order has been made for winding up a company by the Court, and the official receiver has made a further report under this Law stating that in his opinion a fraud has been committed by any person in the promotion or formation of the company or by any officer of the company in relation to the company since its formation, the Court may, after consideration of the report, direct that that person or officer shall attend before the Court on a day appointed by the Court for that purpose and be publicly examined as to the promotion or formation or the conduct of the business of the company or as to his conduct and dealings as officer thereof. (2) The official receiver shall take part in the examination, and for that purpose may, if specially authorized by the Court in that behalf, employ an advocate. (3) The liquidator, where the official receiver is not the liquidator, and any creditor or contributory may also take part in the examination either personally or by an advocate. (4) The Court may put such questions to the person examined as the Court thinks fit. (5) The person examined shall be examined on oath and shall answer all such questions as the Court may put or allow to be put to him. 221 (6) A person ordered to be examined under this section shall at his own cost, before his examination, be furnished with a copy of the official receiver's report, and may at his own cost employ an advocate, who shall be at liberty to put to him such questions as the Court may deem just for the purpose of enabling him to explain or qualify any answers given by him: Provided that, if any such person applies to the Court to be exculpated from any charges made or suggested against him, it shall be the duty of the official receiver to appear on the hearing of the application and call the attention of the Court to any matters which appear to the official receiver to be relevant, and if the Court, after hearing any evidence given or witnesses called by the official receiver, grants the application, the Court may allow the applicant such costs as in its discretion it may think fit. (7) Notes of the examination shall be taken down in writing, and shall be read over to or by, and signed by, the person examined, and may thereafter be used in evidence against him, and shall be open to the inspection of any creditor or contributory at all reasonable times. (8) The Court may, if it thinks fit, adjourn the examination from time to time. Power to arrest absconding contributory."
}