{
  "article_number": "266",
  "title": "Statutory declaration of solvency in case of proposal to wind up voluntarily.",
  "content": "266.- (1) Where it is proposed to wind up a company voluntarily or where a plan has been adopted for the purpose of transferring the registered office of an SE to another member state, the directors of the company or, in the case of a company having more than two directors, the majority of the directors, may, at a meeting of the directors make a statutory declaration to the effect that they have made a full inquiry into the affairs of the company, and that, having so done, they have formed the opinion that the company will be able to pay its debts in full within such period not exceeding twelve months from the commencement of the winding up as may be specified in the declaration. (2) A declaration made as aforesaid shall have no effect for the purposes of this Law unless- (a) it is made within the five weeks immediately preceding the date of the passing of the resolution for winding up the company and is delivered to the registrar of companies for registration before that date; and (b) it embodies a statement of the company's assets and liabilities as at the latest practicable date before the making of the declaration. (3) Any director of a company making a declaration under this section without having reasonable grounds for the opinion that the company will be able to pay its debts in full within the period specified in the declaration, shall commit an offence and on conviction thereof be liable 224 5 (b) of 98(I) of 2006. to imprisonment for a period not exceeding two years or to a fine not exceeding two thousand, five hundred and sixty-two euros or to both such imprisonment and fine; and if the company is wound up in pursuance of a resolution passed within the period of five weeks after the making of the declaration, but its debts are not paid or provided for in full within the period stated in the declaration, it shall be presumed until the contrary is shown that the director did not have reasonable grounds for his opinion. (4) A winding up in the case of which a declaration has been made and delivered in accordance with this section is in this Law referred to as \"a members' voluntary winding up\", and a winding up in the case of which a declaration has not been made and delivered as aforesaid is in this Law referred to as \"a creditors' voluntary winding up\". Provisions applicable to a Members' Voluntary Winding Up Provisions applicable to a members’ winding up."
}