{
  "article_number": "270",
  "title": "Power of liquidator to accept shares etc., as consideration for sale of property of",
  "content": "270.-(1) Where a company is proposed to be, or is in course of being, wound up altogether voluntarily, and the whole or part of its business or property is proposed to be transferred or sold to another company, whether a company within the meaning of this Law or not (in this section called “the transferee company\"), the liquidator of the first-mentioned company (in this section called \"the transferor company\") may, with the sanction of a special resolution of that company, conferring either a general authority on the liquidator or an authority in respect of any particular arrangement, receive, in compensation or part compensation for the transfer or sale, shares, 225 policies or other like interests in the transferee company for distribution among the members of the transferor company, or may enter into any other arrangement whereby the members of the transferor company may, in lieu of receiving cash, shares, policies or other like interests, or in addition thereto, participate in the profits of or receive any other benefit from the transferee company. (2) Any sale or arrangement in pursuance of this section shall be binding on the members of the transferor company. (3) If any member of the transferor company who did not vote in favour of the special resolution expresses his dissent therefrom in writing addressed to the liquidator, and left at the registered office of the company within seven days after the passing of the resolution, he may require the liquidator either to abstain from carrying the resolution into effect or to purchase his interest at a price to be determined by agreement or by arbitration under the provisions of any Law relating to arbitration in force for the time being. (4) If the liquidator elects to purchase the member's interest, the purchase money must be paid before the company is dissolved and be raised by the liquidator in such manner as may be determined by special resolution. (5) A special resolution shall not be invalid for the purposes of this section by reason that it is passed before or concurrently with a resolution for voluntary winding up or for appointing liquidators, but if an order is made within a year for winding up the company by or subject to the supervision of the Court, the special resolution shall not be valid unless sanctioned by the Court. Duty of liquidator to call creditors’ meeting in case of insolvency."
}