{
  "article_number": "273",
  "title": "Final meeting and dissolution.",
  "content": "273.- (1) Subject to the provisions of section 274, as soon as the affairs of the company are fully wound up, the liquidator shall make up an account of the winding up, showing how the winding up has been conducted and the property of the company has been disposed of, and thereupon shall call a general meeting of the company for the purpose of laying before it the account, and giving any explanation thereof. (2) The meeting shall be called by advertisement in the Gazette, specifying the time, place and object thereof, and published one month at least before the meeting. 4 of 166 of 1987. (3) Within one week after the meeting, the liquidator shall send to the registrar of companies a copy of the account, and shall make a return to him of the holding of the meeting and of its date, and if the copy is not sent or the return is not made in accordance with this subsection the liquidator shall be liable to a fine not exceeding forty-two euros for every day during which the default continues: Provided that, if a quorum is not present at the meeting, the liquidator shall, in lieu of the return hereinbefore mentioned, make a return that the meeting was duly summoned and that no quorum was present thereat, and upon such a return being made the provisions of this subsection as to the making of the return shall be deemed to have been complied with. (4) The registrar on receiving the account and either of the returns hereinbefore mentioned shall forthwith register them, and on the expiration of three months from the registration of the return the company shall be deemed to be dissolved: Provided that the Court may, on the application of the liquidator or of any other person who appears to the Court to be interested, make an order deferring the date at which the dissolution of the company is to take effect for such time as the Court thinks fit. 4 of 166 of 1987. (5) It shall be the duty of the person on whose application an order of the Court under this section is made, within seven days after the making of the order, to deliver to the registrar an office copy of the order for registration, and if that person fails so to do he shall be liable to a fine not exceeding forty-two euros for every day during which the default continues. 4 of 166 of 1987. (6) If the liquidator fails to call a general meeting of the company as required by this section, he shall be liable to a fine not exceeding four hundred twenty-seven euros. Alternative provisions as to annual and final meetings in case of"
}