{
  "article_number": "276",
  "title": "Meeting of creditors",
  "content": "276.- (1) The company shall cause a meeting of the creditors of the company to be summoned for the day, or the day next following the day, on which there is to be held the meeting at which the resolution for voluntary winding up is to be proposed, and shall cause the notices of the said meeting of creditors to be sent by post to the creditors simultaneously with the sending of the notices of the said meeting of the company. (2) The company shall cause notice of the meeting of the creditors to be advertised once in the Gazette and once at least in two local newspapers circulating in the district where the registered office or principal place of business of the company is situate. (3) The directors of the company shall- (a) cause a full statement of the position of the company's affairs together with a list of the creditors of the company and the estimated amount of their claims to be laid before the meeting of the creditors to be held as aforesaid; and (b) appoint one of their number to preside at the said meeting. (4) It shall be the duty of the director appointed to preside at the meeting of creditors to attend the meeting and preside thereat. (5) If the meeting of the company at which the resolution for voluntary winding up is to be proposed is adjourned and the resolution is passed at an adjourned meeting, any resolution passed at the meeting of the creditors held in pursuance of subsection (1) shall have effect as if it had been passed immediately after the passing of the resolution for winding up the company. (6) If default is made: (a) by the company in complying with subsections (1) and (2); (b) by the directors of the company in complying with subsection (3); (c) by any director of the company in complying with subsection (4), 228 4 of 166 of 1987. the company, directors or director, as the case may be, shall be liable to a fine not exceeding eight hundred fifty-four euros, and, in the case of default by the company, every officer of the company who is in default shall be liable to the like penalty. Appointment of liquidator."
}