{
  "article_number": "30",
  "title": "Consequences of default in complying with conditions constituting a company a",
  "content": "30.4.2004, p12, “Directive 2004/25/EC” means Directive 2004/25/EC of the European Parliament and of the Council of 21 April 2004 on takeover bids; 2(b) of 131 (I) of 2007. \"document\" includes summons, notice, order, and other legal process, and registers; ‘’exempt private company’’ Repealed; 2 of 60(I) of 2010. “electronic means” means the means of electronic equipment used for the processing (including digital compression), storage and transmission of data by wire, by radio, by optical technological means or by other electromagnetic means; \"existing company\" means a company formed and registered under the Companies (Limited Liability) Law, or the Companies (Limited by Guarantee) Law, 1949; 2(b) of 167(I) of 2003. “financial statements” means financial statements provided for in sections 142 and 144; 2(b) of 99(I) of 2009. \"financial year\" means, in relation to any body corporate, the period in respect of which any profit and loss account of the body corporate laid before it in general meeting is made up, whether that period is a year or not; “foreign market” means a multilateral system, which is managed or operated by a market operator and which brings together or facilitates the bringing together of multiple third party buying and selling interests in financial instruments, within the system and in accordance with its non discretionary rules in a way that results in the conclusion of a relevant agreement and financial instruments, negotiated on the basis of its rules and/or systems, and which is situated outside the Republic of Cyprus; 27 2(c) of 131(I) of 2007. “Generally Accepted Accounting Principles’ are considered the accounting standards which are accepted by recognized Stock Exchange Authorities, as these are included in the list of members of the International Organization of Securities Commissions (IOSCO)”; . \"general rules\" means general rules made under section 333, and includes forms; 2(a) of 167(I) of 2003. “group accounts” means the consolidated financial statements provided for in paragraph (b) of subsection (1) of section 142; 2(b) of 167(I) of 2003. “group of companies” means the group of companies comprising of the holding and subsidiary company or companies; “holding company” means a holding company as defined by section 148; \"immovable property\" includes: (a) land; (b) buildings and other erections, structures, or fixtures affixed to any land or to any building or other erection or structure; (c) trees, vines, and any other thing whatsoever planted or growing upon any land and any produce thereof before severance; (d) springs, wells, water and water rights whether held together with, or independently of, any land; (e) privileges, liberties, easements and any other rights and advantages whatsoever appertaining or reputed to appertain to any land or to any building or other erection or structure; (f) an undivided share in any property hereinbefore set out. 2(b) of 167(I) of 2003 2(a) of 131(I) of 2007. Official Journal of EU: L, 243 11.9.2002, p.1 “International Accounting Standards” means the International Accounting Standards (IAS) and the International Financial Reporting Standards (IFRS), for the time being in force as well as the relevant texts issued under the general supervision of the International Accounting Standards Board (IASB) and as these are adopted by the European Union in accordance with the provisions of Regulation (EC) No. 1606/2002 of the European Parliament and of the Council of 19 July 2002 on the application of international accounting standards, as from time to time amended or substituted; \"issued generally\" means, in relation to a prospectus, issued to persons who are not existing members or debenture holders of the company; 2 of 60(I) of 2010. “member state” means a member state of the European Union; 28 \"members' voluntary winding up\" has the meaning assigned to it by subsection (4) of section 266; \"memorandum\" means the memorandum of association of a company, as originally framed or as altered in pursuance of any enactment; \"minimum subscription\" has the meaning assigned to it by subsection (2) of section 47; \"notarially\" includes certification by a certifying officer; \"officer\", in relation to a body corporate, includes a director, manager or secretary; \"official receiver\" has the meaning assigned to it by section 222; 2(a) of 99(I) of 2009. \"overseas register\" has the meaning assigned to it by subsection (1) of section 114; \"prescribed\" means, as respects the provisions of this Law relating to the winding up of companies, prescribed by general rules, and as respects the other provisions of this Law, prescribed by regulations or Order made by the Council of Ministers ; \"private company\" has the meaning assigned to it by subsection (1) of section 29; “prospectus” means any prospectus, notice, circular, advertisement, or other invitation, offering to the public for subscription or purchase any shares or debentures of a company; 2(a) of 70(I) of 2003. “public company” means the company which is not private; 2(b) of 167(I) of 2003. “publication” means the presentation in the general meeting of the company, the dispatch of documents pursuant to subsection (2) of section 152, as well as any reading, announcement, issue, circulation or publication; 2 of 60(I) of 2010. \"real” and “personal,\" mean respectively immovable and movable; “record date” means a date which is not more than two working days prior to the general meeting to which it relates; 2 of 60(I) of 2010. \"the registrar of companies\", or when used in relation to registration of companies, \"the registrar\", means the Official Receiver and Registrar and includes any other person appointed by the Council of Ministers to exercise all or any of the powers and perform all or any of the duties of a registrar; “regulated market” means the regulated or organized market as such is 29 144(I) of 2007 106(I)of 2009. defined in the Investment Services and Activities and Regulated Markets Law; \"resolution for reducing share capital\" has the meaning assigned to it by subsection (2) of section 64; “resolution for voluntary winding up” has the meaning assigned to it by subsection (2) of section 261; 2 of 98(I) of 2006. “SE” means a European Public Limited Liability Company (or Societas Europaea) and has the meaning assigned to it by article 1 of Council Regulation (EC) no 2157/2001, of 8 October 2001 concerning the Statute for a European company (SE) and including SE which will be registered or has been registered in the Republic; \"share\" means share in the share capital of a company, and includes stock except where a distinction between stock and shares is expressed or implied; \"share warrant\" has the meaning assigned to it by subsection (2) of section 81; \"statutory declaration\" means an affidavit or other declaration made on oath or affirmation; \"statutory meeting\" means the meeting required to be held by subsection (1) of section 124; “statutory report” has the meaning assigned to it by subsection (2) of section 124; \"subsidiary\" means a subsidiary as defined in section 148; \"Table A\" means Table A in the First Schedule; “the time of the opening of the subscription lists” has the meaning assigned to it by subsection (1) of section 50. (2) A person shall not be deemed to be within the meaning of any provision in this Law a person in accordance with whose directions or instructions the directors of a company are accustomed to act, by reason that the directors of the company act on advice given by him in a professional capacity. 2(b) of 70(I) of 2003. (3) References in this Law to a body corporate or to a corporation shall be construed as also including a company incorporated outside the Republic. (4) Any such provision of this Law overriding or interpreting a company’s articles shall, except as provided by this Law, apply in relation to articles in force at the commencement of this Law, as well as to articles coming into force thereafter, and shall apply also in relation to its articles. 30 PART I. INCORPORATION OF COMPANIES AND MATTERS INCIDENTAL THERETO Memorandum of Association Mode of forming incorporated company. 2 of 2(I) of 2000. 3.-(1) Any seven or more persons, or, where the company to be formed will be a private company, any one or more persons, associated for any lawful purpose may, by subscribing their names to a memorandum of association and otherwise complying with the requirements of this Law in respect of registration, form an incorporated company, with limited liability. (2) Such company may be either: (a) a company having the liability of its members limited by the memorandum to the amount, if any, unpaid on the shares respectively held by them (in this Law termed a \"company limited by shares\"); or (b) a company having the liability of its members limited by the memorandum to such amount as the members may respectively thereby undertake to contribute to the assets of the company in the event of its being wound up (in this Law termed \"a company limited by guarantee\"). Requirements with respect to memorandum. 4.-(1) The memorandum of every company must state: 3(a)(i)of 70(I)of 2003 3(a)(ii)of 70(I)of 2003 2(a)(i)of 24(I)of 2005 2(a)(ii)of 24(I)of 2005 2 of 129(I)of 2005. (a) (i) in the case of a private company, the name of the company together with the word “limited” or “ltd”or in case the name of the company is written in latin characters, with the word ‘’limited or Ltd’’ as the last word of the name; (ii) in the case of a public company, the name of the company with the words ‘’δημόσια λίμιτεδ’’ or ‘’δημόσια λτδ’’ or ‘’δημόσια εταιρεία λίμιτεδ’’ or ‘’δημόσια εταιρεία λτδ’’ or ‘’δε λίμιτεδ’’ or ‘’δε λτδ’’ or in the case the name of the company is written in latin characters with the words ‘’Public Company Limited’’ or Public Company Ltd’’ or “Public Company Limited or ‘’Public Co. Ltd’’ or ‘’ Plc’’ or ‘’ Public Limited’’ or ‘’ Public Ltd’’ as the last words of the name, 3 of 98(I) of 2006. (iii) when referring to SE, the name of the company together with the latin characters “SE” as the last word of the name. (b) the objects of the company. (2) The memorandum of a company where limited by shares or by guarantee must state that the liability of its members is limited. (3) The memorandum of a company limited by guarantee must also state 31 that each member undertakes to contribute to the assets of the company in the event of its being wound up while he is a member, or within one year after he ceases to be a member, for payment of the debts and liabilities of the company contracted before he ceases to be a member, or of the costs, charges and expenses of winding up, and for adjustment of the rights of the contributories among themselves, such amount as may be required, not exceeding a specified amount. (4) In the case of a company having a share capital- (a) the memorandum must also state the amount of share capital with which the company proposes to be registered and the division thereof into shares of fixed amount; (b) no subscriber of the memorandum may take less than one share; (c) each subscriber must write opposite to his name the number of shares he takes. 3(b) of 70(I) of 2003. (5) The articles of a public company- (a) must contain regulations which define the number and the method of appointment of the directors, who are entrusted with the management of the company and its representation against third parties, (b) may contain regulations which define the allocation of responsibilities between the directors. Public company: minimum registered capital. 4 of 70(I) of 2003. 4A. (1) The minimum capital of a public company, which has been offered for subscription, shall be twenty-five thousand, six hundred and twenty nine euros. (2) The capital mentioned in subsection (1) is mandatory to exist at the latest, at the time when the issuance of the certificate provided for in subsection (4) of section 104, as the subsection is renumbered by section 24 of this Law, is requested from the Registrar. Stamp and signature of memorandum. 2 of 76 of 1977. 5. The memorandum must bear the same stamp as if it were an agreement, and must be signed by each subscriber in the presence of at least one witness who must attest the signature. Restriction on alteration of memorandum. 6. A company may not alter the conditions contained in its memorandum except in the cases, in the mode and to the extent for which express provision is made in this Law. Mode in which and extent to 7.(1) Subject to the provisions of this section a company may, by special resolution, alter the provisions of its memorandum with respect to the 32 which objects of company may be altered. objects of the company, so far as may be required to enable it: (a) to carry on its business more economically or more efficiently; or (b) to obtain its main purpose by new or improved means; or (c) to enlarge or change the local area of its operations; or (d) to carry on some business which under existing circumstances may conveniently or advantageously be combined with the business of the company; or (e) to restrict or abandon any of the objects specified in the memorandum; or (f) to sell or dispose of the whole or any part of the undertaking of the company; or (g) to amalgamate with any other company or body of persons. (2) The alteration shall not take effect until, and except in so far as, it is confirmed on petition by the Court. (3) Before confirming the alteration the Court must be satisfied- (a) that sufficient notice has been given to every holder of debentures of the company, and to any persons or class of persons whose interests will, in the opinion of the Court, be affected by the alteration; and (b) that, with respect to every creditor who in the opinion of the Court is entitled to object and signifies his objection in the manner directed by the Court, either his consent to the alteration has been obtained or his debt or claim has been discharged or has been determined, or has been secured to the satisfaction of the Court: Provided that the Court may, in the case of any person or class, for special reasons, dispense with the notice required by this section. (4) The Court may make an order confirming the alteration either wholly or in part, and on such terms and conditions as it thinks fit. (5) The Court shall, in exercising its discretion under this section, have regard to the rights and interests of the members of the company or of any class of them, as well as to the rights and interests of the creditors, and may, if it thinks fit, adjourn the proceedings in order that an arrangement may be made to the satisfaction of the Court for the purchase of the interests of dissentient members, and may give such directions and make such orders as it may think expedient for facilitating or carrying into effect any such arrangement: Provided that no part of the capital of the company shall be expended in 33 any such purchase. (6) An office copy of the order confirming the alteration, together with a printed copy of the memorandum as altered, shall, within fifteen days from the date of the order, be delivered by the company to the registrar of companies, and he shall register the copy so delivered and shall certify the registration under his hand, and the certificate shall be conclusive evidence that all the requirements of this Law with respect to the alteration and the confirmation thereof have been complied with, and thenceforth the memorandum as so altered shall be the memorandum of the company. The Court may by order at any time extend the time for the delivery of documents to the registrar under this section for such period as the Court may think proper. 4 of 166 of 1987. (7) If a company makes default in delivering to the registrar of companies any document required by this section to be delivered to him, the company shall be liable to a fine not exceeding eighty–five euros for every day during which the default continues. Articles of Association Articles prescribing regulations for companies. Regulations required in case of company limited by guarantee. 8. There may in the case of a company limited by shares, and there shall in the case of a company limited by guarantee, be registered with the memorandum articles of association signed by the subscribers to the memorandum and prescribing regulations for the company. 9.- (1) In the case of a company limited by guarantee, the articles must state the number of members with which the company proposes to be registered. (2) Where a company limited by guarantee has increased the number of its members beyond the registered number, it shall, within fifteen days after the increase was resolved on or took place, give to the registrar of companies notice of the increase, and the registrar shall record the increase. If default is made in complying with this subsection, the company and every officer of the company who is in default shall be liable to a default fine. Adoption and application of Table A. First Schedule. 10.-(1) Articles of association may adopt all or any of the regulations contained in Table A in the First Schedule. Table A. (2) In the case of a company limited by shares and registered after the commencement of this Law, if articles are not registered, or, if articles are 34 registered, insofar as the articles do not exclude or modify the regulations contained in Table A in the First Schedule, those regulations shall, so far as applicable, be the regulations of the company in the same manner and to the same extent as if they were contained in duly registered articles. Printing, stamp, and signature of articles. 11. Articles must - (a) be printed; (b) be divided into paragraphs numbered consecutively; 3 of 76 of 1977. (c) be signed by each subscriber of the memorandum of association in the presence of at least one witness who must attest the signature. Alteration of articles by special resolution. 12.- (1) Subject to the provisions of this Law and to the conditions contained in its memorandum, a company may, by special resolution, alter or add to its articles. (2) Any alteration or addition so made in the articles shall, subject to the provisions of this Law, be as valid as if originally contained therein, and be subject in like manner to alteration by special resolution. Form of Memorandum and Articles Statutory forms of memorandum and articles. 13. The form of- (a) the memorandum of association of a company limited by shares; (b) the memorandum and articles of association of a company limited by guarantee and not having a share capital; First Schedule, Tables B, Cand D. (c) the memorandum and articles of association of a company limited by guarantee and having a share capital, shall be respectively in accordance with the forms set out in Tables B, C, and D, in the First Schedule, or as near thereto as circumstances admit. Registration Registration of memorandum and articles. 14. The memorandum and the articles, if any, shall be delivered to the registrar of companies and the registrar shall retain and register them. Effect of registration. 15.-(1) On the registration of the memorandum of a company the registrar shall certify under his hand that the company is incorporated as a limited company. 35 (2) From the date of incorporation mentioned in the certificate of incorporation, the subscribers of the memorandum, together with such other persons as may from time to time become members of the company, shall be a body corporate by the name contained in the memorandum, capable forthwith of exercising all the functions of an incorporated company, and having perpetual succession and a common seal, but with such liability on the part of the members to contribute to the assets of the company in the event of its being wound up as is mentioned in this Law. Validity of contracts concluded prior to the company being incorporated. 5 of 70 (I) of 2003. 15A.- (1) Any contract concluded before the incorporation of a company by the persons who have signed the memorandum, or by persons authorized by them, in the name of or on behalf of the company under incorporation, shall be temporary and shall not bind the company until the date of incorporation. After that date, the agreement shall constitute a binding contract for the company. . (2) In case the company is not incorporated in the end, the obligations undertaken by any person in its name or on its behalf shall be only valid as obligations of the said persons. The liability of the said persons shall be unlimited, joint and several. (3) The liability pursuant to subsection (2) shall not arise in cases where the obligations were expressly undertaken upon the condition of the incorporation of the company. Power of company to hold immovable property. 16.-(1) A company incorporated under this Law shall have power to hold immovable property in any part of the Republic without licence: Provided that a company formed for the purpose of promoting art, science, religion, charity or any other like object not involving the acquisition of gain by the company or by its individual members, shall not, without the licence of the Council of Ministers, hold more than six donums of land, but the Council of Ministers may by licence empower any such company to hold lands in such quantity, and subject to such conditions, as the Council of Ministers thinks fit. Second Schedule . (2) A licence given by the Council of Ministers under this section shall be in accordance with the form set out in the Second Schedule or as near thereto as circumstances admit. Conclusiveness of certificate of incorporation. 17.- (1) A certificate of incorporation given by the registrar in respect of any association shall be conclusive evidence that all the requirements of this Law in respect of registration and of matters precedent and incidental thereto have been complied with, and that the association is a company authorized to be registered and duly registered under this Law. 36 (2) A statutory declaration by a practicing advocate engaged in the formation of the company, or by a person named in the articles as a director or secretary of the company, of compliance with all or any of the said requirements shall be produced to the registrar, and the registrar may accept such a declaration as sufficient evidence of compliance. Provisions with respect to Names of Companies Undesirable name. 18. No company shall be registered by a name which in the opinion of the Council of Ministers is undesirable. Change of name. 19. (1) A company may, by special resolution and with the approval of the Council of Ministers signified in writing, change its name. (2) If, through inadvertence or otherwise, a company on its first registration or on its registration of a new name is registered by a name which, in the opinion of the Council of Ministers, is too like the name by which a company in existence is previously registered, the first- mentioned company may change its name with the sanction of the Council of Ministers and, if he so directs within six months of its being registered by that name, shall change it within a period of six weeks from the date of the direction or such longer period as the Council of Ministers may think fit to allow. 4 of 166 of 1987. If a company makes default in complying with a direction under this subsection, it shall be liable to a fine not exceeding forty-two euros for every day during which the default continues. (3) Where a company changes its name under this section, the registrar shall enter the new name on the register in place of the former name, and shall issue a certificate of incorporation altered to meet the circumstances of the case. (4) A change of name by a company under this section shall not affect any rights or obligations of the company or render defective any legal proceedings by or against the company, and any legal proceedings that might have been continued or commenced against it by its former name may be continued or commenced against it by its new name. Power to dispense with “limited” in name of charitable and other companies. 20. -(1) Where it is proved to the satisfaction of the Council of Ministers that an association about to be formed as a company is to be formed for promoting commerce, art, science, religion, charity or any other useful object, and intends to apply its profits, if any, or other income in promoting its objects, and to prohibit the payment of any dividend to its members, the Council of Ministers may by licence direct that the association may be registered as a company with limited liability, without the addition of the word \"limited\" to its name, and the association may be registered accordingly and shall, on registration, enjoy all the privileges and, subject to the provisions of this section, be subject to all the obligations of limited companies. (2) Where it is proved to the satisfaction of the Council of Ministers- 37 (a) that the objects of a company registered under this Law as a limited company are restricted to those specified in subsection (1) and to objects incidental or conducive thereto; and (b) that by its constitution the company is required to apply its profits, if any, or other income in promoting its objects and is prohibited from paying any dividend to its members, the Council of Ministers may by licence authorize the company to make by special resolution a change in its name including or consisting of the omission of the word \"limited,\" and subsection (3) and (4) of section 1 shall apply to a change of name under this subsection as they apply to a change of name under that section. (3) A licence by the Council of Ministers under this section may be granted on such conditions and subject to such regulations as the Council of Ministers thinks fit, and those conditions and regulations shall be binding on the body to which the license is granted, and, where the grant is under subsection (1), shall, if the Council of Ministers so directs, be inserted in the memorandum and articles, or in one of those documents. (4) A body to which a licence is granted under this section shall be excepted from the provisions of this Law relating to the use of the word \"limited\" as any part of its name, the publishing of its name and the sending of lists of members to the registrar of companies. (5) A licence under this section may at any time be revoked by the Council of Ministers, and upon revocation the registrar shall enter the word \"limited\" at the end of the name upon the register of the body to which it was granted, and the body shall cease to enjoy the exemptions and privileges or, as the case may be, the exemptions granted by this section: Provided that, before a licence is so revoked, the Council of Ministers shall give to the body notice in writing of his intention, and shall afford it an opportunity of being heard in opposition to the revocation. (6) Where a body in respect of which a licence under this section is in force alters the provisions of its memorandum with respect to its objects, the Council of Ministers may, unless he sees fit to revoke the licence, vary the licence by making it subject to such conditions and regulations as the Council of Ministers thinks fit, in lieu of or in addition to the conditions and regulations, if any, to which the licence was formerly subject. (7) Where a licence granted under this section to a body the name of which contains the words \"Chamber of Commerce\" is revoked, the body shall, within a period of six weeks from the date of revocation or such longer period as the Council of Ministers may think fit to allow, change its name to a name which does not contain those words, and- 38 (a) the notice to be given under the proviso to subsection (5) to that body shall include a statement of the effect of the foregoing provisions of this subsection; and (b) subsections (3) and (4) of section 19 shall apply to a change of name under this subsection as they apply to a change of name under that section. 4 of 166 of 1987. If the body makes default in complying with the requirements of this subsection, it shall be liable to a fine not exceeding four hundred, twenty seven euros for every day during which the default continues. General Provisions with respect to Memorandum and Articles Effect of memorandum and articles. 21.-(1) Subject to the provisions of this Law, the memorandum and articles shall, when registered, bind the company and the members thereof to the same extent as if they respectively had been signed and sealed by each member, and contained covenants on the part of each member to observe all the provisions of the memorandum and of the articles. (2) All money payable by any member to the company under the memorandum or articles shall be a debt due from him to the company. Provision as to memorandum and articles of companies limited by guarantee. 22.- (1) In the case of a company limited by guarantee and not having a share capital, and registered after the commencement of this Law, every provision in the memorandum or articles or in any resolution of the company purporting to give any person a right to participate in the divisible profits of the company otherwise than as a member shall be void. (2) For the purpose of the provisions of this Law relating to the memorandum of a company limited by guarantee and of this section, every provision in the memorandum or articles, or in any resolution, of a company limited by guarantee and registered on or after the date aforesaid, purporting to divide the undertaking of the company into shares or interests shall be treated as a provision for a share capital, notwithstanding that the nominal amount or number of the shares or interests is not specified thereby. Alterations in memorandum or articles increasing liability to contribute to share capital not to bind existing members without consent. 23. Notwithstanding anything in the memorandum or articles of a company, no member of the company shall be bound by an alteration made in the memorandum or articles after the date on which he became a member, if and so far as the alteration requires him to take or subscribe for more shares than the number held by him at the date on which the alteration is made, or in any way increases his liability as at that date to contribute to the share capital of, or otherwise to pay money to, the company: Provided that this section shall not apply in any case where the member 39 agrees in writing, either before or after the alteration is made, to be bound thereby. Power to alter conditions in memorandum which could have been contained in articles. 24.- (1) Subject to the provisions of sections 23 and 202, any condition contained in a company's memorandum which could lawfully have been contained in articles of association instead of in the memorandum may, subject to the provisions of this section, be altered by the company by special resolution. The alteration shall not take effect until, and except in so far as, it is confirmed on petition by the Court. (2) This section shall not apply where the memorandum itself provides for or prohibits the alteration of all or any of the said conditions, and shall not authorize any variation or abrogation of the special rights of any class of members. (3) Subsections (3), (4), (5), (6) and (7) of section 7 shall apply in relation to any alteration and to any petition made under this section as they apply in relation to alterations and to petitions made under that section. (4) This section shall apply to a company’s memorandum whether registered before or after the commencement of this Law. Copies of memorandum and articles to be given to members. 25.- (1) A company shall, on being so required by any member, send to him a copy of the memorandum and of the articles, if any, subject to payment of 0,0854 euros or such less sum as the company may prescribe. 4 of 166 of 1987. (2) If a company makes default in complying with this section the company and every officer of the company who is in default shall be liable for each offence to a fine not exceeding forty-two euros. Issued copies of memorandum to embody alterations. 26.- (1) Where an alteration is made in the memorandum of a company, every copy of the memorandum issued after the date of the alteration shall be in accordance with the alteration. 4 of 166 of 1987. (2) If, where any such alteration has been made, the company at any time after the date of the alteration issues any copies of the memorandum which are not in accordance with the alteration, it shall be liable to a fine not exceeding forty-two euros for each copy so issued, and every officer of the company who is in default shall be liable to the like penalty. Membership of Company Definition of member. 27.-(1) The subscribers of the memorandum of a company shall be deemed to have agreed to become members of the company, and on its registration shall be entered as members in its register of members. 40 (2) Every other person who agrees to become a member of a company, and whose name is entered in its register of members, shall be a member of the company. Membership of holding company. 6 of 70 (I) of 2003. 28.-(1) Except in the cases hereafter in this section mentioned and subject to the provisions of sections 57A to 57F, a body corporate cannot be a member of a company which is its holding company, and any allotment or transfer of shares in a company to its subsidiary shall be void. (2) Nothing in this section shall apply where the subsidiary is concerned as personal representative, or where it is concerned as trustee, unless the holding company or a subsidiary thereof is beneficially interested under the trust and is not so interested only by way of security for the purposes of a transaction entered into by it in the ordinary course of a business which includes the lending of money. (3) This section shall not prevent a subsidiary which is, at the commencement of this Law, a member of its holding company, from continuing to be a member but, subject to subsection (2), the subsidiary shall have no right to vote at meetings of the holding company or any class of members thereof. (4) Subject to subsection (2), subsections (1) and (3) shall apply in relation to a nominee for a body corporate which is a subsidiary, as if references in the said subsections (1) and (3) to such a body corporate included references to a nominee for it. (5) In relation to a company limited by guarantee which is a holding company, the reference in this section to shares, whether or not it has a share capital, shall be construed as including a reference to the interest of its members as such, whatever the form of that interest. Private Companies Meaning of “private company”. 29.-(1) For the purposes of this Law, the expression \"private company\" means a company which by its articles- (a) restricts the right to transfer its shares; and (b) limits the number of its members to fifty, not including persons who are in the employment of the company and persons who, having been formerly in the employment of the company, were while in that employment, and have continued after the determination of that employment to be, members of the company; and (c) prohibits any invitation to the public to subscribe for any shares or debentures of the company: 3 of 2(I) of 2000. Provided that the shares in a private company may be held by one and only person, either upon the formation of the company or by their 41 subsequent acquisition by one and only person. (2) Where two or more persons hold one or more shares in a company jointly, they shall, for the purposes of this section, be treated as a single member. Consequences of default in complying with conditions constituting a company a private company. 30. Where the articles of a company include the provisions which, under section 29, are required to be included in the articles of a company in order to constitute it a private company but default is made in complying with any of those provisions, the company shall cease to be entitled to the privileges and exemptions conferred on private companies under the provisions contained in section 32, subsection (1) of section 123, paragraph (d) of section 211 and paragraph (i) of proviso (a) to subsection (1) of section 213, and thereupon the provisions contained in the first, third and fourth of those enactments shall apply to the company as if it were not a private company and the provisions contained in the second of those enactments shall cease to apply to the company: Provided that the Court, on being satisfied that the failure to comply with the conditions was accidental or due to inadvertence or to some other sufficient cause, or that on other grounds it is just and equitable to grant relief, may, on the application of the company or any other person interested and on such terms and conditions as seem to the Court just and expedient, order that the company be relieved from such consequences as aforesaid. Statement in lieu of prospectus to be delivered to registrar by company on ceasing to be private company. Third Schedule."
}