{
  "article_number": "300",
  "title": "Preferential payments.",
  "content": "300.- (1) In a winding up there shall be paid in priority to all other debts- (a) the following rates and taxes:- 234 (i) all local rates due from the company at the relevant date, and having become due and payable within twelve months next before that date; (ii) all Government taxes and duties due from the company at the relevant date and having become due and payable within twelve months before that date and, in the case of assessed taxes, not exceeding in the whole one year's assessment. 2(a) of 198 of 1986 2 of 19 of 1990. (b)(i) any salary owed to an employee and any sum withheld by the employer from the employee’s salary for the payment of any obligations of the employee or otherwise, that the employer has not paid; and (ii) any other sum or benefit of the employee that arises as a result of an agreement or employment relationship, including any sum owed to a recognized union that arises from the employment relationship between the employer and the employee or otherwise, that the employer has not paid. 2 of 41(I) of 1994. The provisions of this paragraph shall not apply in cases where an employee of a private company is a shareholder or member of the company’s board of directors unless he holds shares or participates in the board of directors as a representative and in an evidently procedural and non-substantive manner, and provided that there is no first or second degree relationship between himself and the person being represented. 2(a) of 198 of 1986. (c) every amount of compensation which the company is obliged to pay to an employee, on account of bodily harm suffered by the employee as a result of an accident caused by his employment and during his employment with the company. An employee of a private company who is a shareholder thereof is exempted, unless the company is voluntarily wound-up or wound-up for reconstruction or merger purposes. 2(a) of 198 of 1986. (d) Every amount due to the employee, excluding an employee of a private company who is a shareholder thereof, concerning the leave which he is entitled to from his employment in the company for an employment period of only one year. 2(b) of 198 of 1986. (2) Where any payment has been made: (a) to any clerk, servant, workman or labourer in the employment of a company, on account of wages or salary; or (b) to any such clerk, servant, workman or labourer or, in the case of his death, to any other person in his right, on account of accrued holiday remuneration, out of money advanced by some person for that purpose, the person by whom the money was advanced shall in a winding up have a right of priority in respect of the money so advanced and paid up to the amount by which the sum in respect of which the clerk, servant, workman or 235 labourer, or other person in his right, would have been entitled to priority in the winding up has been diminished by reason of the payment having been made. 2 (b) of 198 of 1986. (3) The foregoing debts shall- (a) rank equally among themselves and be paid in full, unless the assets are insufficient to meet them, in which case they shall abate in equal proportions; and (b) so far as the assets of the company available for payment of general creditors are insufficient to meet them, have priority over the claims of holders of debentures under any floating charge created by the company, and be paid accordingly out of any property comprised in or subject to that charge. 2(b) of 198 of 1986. (4) Subject to the retention of such sums as may be necessary for the costs and expenses of the winding up, the foregoing debts shall be discharged forthwith so far as the assets are sufficient to meet them. 2(b) of 198 of 1986. (5) In the event of a landlord or other person distraining or having distrained on any goods or effects of the company within three months next before the date of a winding-up order, the debts to which priority is given by this section shall be a first charge on the goods or effects so distrained on, or the proceeds of the sale thereof: Provided that, in respect of any money paid under any such charge, the landlord or other person shall have the same rights of priority as the person to whom the payment is made. 2 (b) of 198 of 1986. (6) For the purposes of this section- 41 of 1980 48 of 1982 11 of 1983 7 of 1984 10 of 1985 116 of 1985 4 of 1987 199 of 1987 214 of 1987 68 of 1988 96 of 1989 136 of 1989 17 of 1990 218 of 1991 98(I) of 1992 64(I) of 1993 18(I) of 1995 55(I) of 1996 (a) the terms “salary”, “employee” and “basic insured salaries” shall have the meaning assigned to them by the Social Insurance Laws, 1980 to 2009;  Note: The Social Insurance Law, 1980 (L.41/1980 as amended) was repealed and replaced by the Social Insurance Law, 2010 [L.59(I)/2010, as amended by Laws 114(I)/2010, 126(I)/2010 ,2(Ι)/2012, 37(Ι)/2012]. 236 87(I) of 1997 80(I) of 1998 84(I) of 1998 55(I) of 1999 98(I) of 2000 99(I) of 2000 2(I) of 2001 51(I) of 2001 135 (I) of2001 143(I) of 2001 71(I) of 2002 132 (I)of 2002 10(I) of 2005 142(I) of 2005 53(I) of 2006 161(I) of 2006 110(I) of 2007 164(I) of 2007 9(I) of 2008 24(I) of 2008 22(I)of 2009 93(I) of 2009 112(I) of 2009. 2(d) of 198 of 1986. (b) the expression \"the relevant date” means: (i) in the case of a company ordered to be wound up compulsorily, the date of the appointment (or first appointment) of a provisional liquidator, or, if no such appointment was made, the date of the winding-up order, unless in either case the company had commenced to be wound up voluntarily before that date; and (ii) in any case where the foregoing subparagraph does not apply, means the date of the passing of the resolution for the winding up of the company. 2(b) of 198 of 1986. (7) This section shall not apply in the case of a winding up where the winding-up order was made before the commencement of this Law, and in such a case the provisions relating to preferential payments which would have applied if this Law had not passed shall be deemed to remain in full force. Effect of Winding Up on antecedent and other Transactions Fraudulent preference."
}