{
  "article_number": "304",
  "title": "Disclaimer of onerous property in case of company being wound up.",
  "content": "304.- (1) Where any part of the property of a company which is being wound up consists of immovable property burdened with onerous covenants, of shares or stock in companies, of unprofitable contracts, or of any other property that is unsaleable, or not readily saleable, by reason of its binding the possessor thereof to the performance of any onerous act or to the payment of any sum of money, the liquidator of the company, notwithstanding that he has endeavoured to sell or has taken possession of the property or exercised any act of ownership in relation thereto, may with the leave of the Court and subject to the provisions of this section, by 238 writing signed by him, at any time within twelve months after the commencement of the winding up or such extended period as may be allowed by the Court, disclaim the property: Provided that, where any such property has not come to the knowledge of the liquidator within one month after the commencement of the winding up, the power under this section of disclaiming the property may be exercised at any time within twelve months after he has become aware thereof or such extended period as may be allowed by the Court. (2) The disclaimer shall operate to determine, as from the date of disclaimer, the rights, interest and liabilities of the company, and the property of the company, in or in respect of the property disclaimed, but shall not, except so far as is necessary for the purpose of releasing the company and the property of the company from liability, affect the rights or liabilities of any other person. (3) The Court, before or on granting leave to disclaim, may require such notices to be given to persons interested, and impose such terms as a condition of granting leave, and make such other order in the matter as the Court thinks just. (4) The liquidator shall not be entitled to disclaim any property under this section in any case where an application in writing has been made to him by any persons interested in the property requiring him to decide whether he will or will not disclaim and the liquidator has not, within a period of twenty-eight days after the receipt of the application or such further period as may be allowed by the Court, given notice to the applicant that he intends to apply to the Court for leave to disclaim, and, in the case of a contract, if the liquidator, after such an application as aforesaid, does not within the said period or further period disclaim the contract, the company shall be deemed to have adopted it. (5) The Court may, on the application of any person who is, as against the liquidator, entitled to the benefit or subject to the burden of a contract made with the company, make an order rescinding the contract on such terms as to payment by or to either party of damages for the non- performance of the contract, or otherwise as the Court thinks just, and any damages payable under the order to any such person may be proved by him as a debt in the winding up. (6) The Court may, on an application by any person who either claims any interest in any disclaimed property or is under any liability not discharged by this Law in respect of any disclaimed property and on hearing any such persons as it thinks fit, make an order for the vesting of the property in or the delivery of the property to any persons entitled thereto, or to whom it may seem just that the property should be delivered by way of compensation for such liability as aforesaid, or a trustee for him, and on such terms as the Court thinks just, and on any such vesting order being made, the property comprised therein shall vest accordingly in the person therein named in that behalf without any conveyance or assignment for the purpose: 239 Provided that, where the property disclaimed is of a leasehold nature, the Court shall not make a vesting order in favour of any person claiming under the company except upon the terms of making that person- (a) subject to the same liabilities and obligations as those to which the company was subject under the lease in respect of the property at the commencement of the winding up; or (b) if the Court thinks fit, subject only to the same liabilities and obligations as if the lease had been assigned to that person at that date, and in either event, if the case so requires, as if the lease had comprised only the property comprised in the vesting order, and any mortgagee or under-lessee declining to accept a vesting order upon such terms shall be excluded from all interest in and security upon the property, and, if there is no person claiming under the company who is willing to accept an order upon such terms, the Court shall have power to vest the estate and interest of the company in the property in any person liable either personally or in a representative character, and either alone or jointly with the company, to perform the lessee's covenants in the lease, freed and discharged from all estates, incumbrances and interests created therein by the company. (7) Any person injured by the operation of a disclaimer under this section shall be deemed to be a creditor of the company to the amount of the injury, and may accordingly prove the amount as a debt in the winding up. Restriction of rights of creditor as to execution or attachment in case of company being wound up."
}