{
  "article_number": "306",
  "title": "Duties of sheriff as to goods taken in execution.",
  "content": "306.- (1) Subject to the provisions of subsection (3), where any goods of a company are taken in execution, and, before the sale thereof or the completion of the execution by the receipt or recovery of the full amount of the levy, notice is served on the sheriff that a provisional liquidator has been appointed or that a winding-up order has been made or that a resolution for voluntary winding up has been passed, the sheriff shall, on being so required, deliver the goods and any money seized or received in part satisfaction of the execution to the liquidator, but the costs of the execution shall be a first charge on the goods or money so delivered, and the liquidator may sell the goods, or a sufficient part thereof, for the purpose of satisfying that charge. 4 of 166 of 1987. (2) Subject to the provisions of subsection (3), where under an execution in respect of a judgment for a sum exceeding two hundred thirteen euros the goods of a company are sold or money is paid in order to avoid sale, the sheriff shall deduct the costs of the execution from the proceeds of the sale or the money paid and retain the balance for fourteen days, and if within that time notice is served on him of a petition for the winding up of the company having been presented or of a meeting having been called at which there is to be proposed a resolution for the voluntary winding up of the company and an order is made or a resolution is passed, as the case may be, for the winding up of the company, the sheriff shall pay the balance to the liquidator, who shall be entitled to retain it as against the execution creditor. (3) The rights conferred by this section on the liquidator may be set aside by the Court in favour of the creditor to such extent and subject to such terms as the Court thinks fit. (4) In this section the expression “goods” includes all chattels personal, and the expression \"sheriff\" includes any officer charged with the execution of a writ or other process. Offences antecedent to or in course of Winding Up Offences by officers of companies in liquidation."
}