{
  "article_number": "311",
  "title": "Responsibility for fraudulent trading of persons concerned.",
  "content": "311.- (1) If in the course of the winding up of a company it appears that any business of the company has been carried on with intent to defraud 244 persons concerned. creditors of the company or creditors of any other person or for any fraudulent purpose, the Court, on the application of the official receiver, or the liquidator or any creditor or contributory of the company, may, if it thinks proper so to do, declare that any persons who were knowingly parties to the carrying on of the business in manner aforesaid shall be personally responsible, without any limitation of liability, for all or any of the debts or other liabilities of the company as the Court may direct. On the hearing of an application under this subsection the official receiver or the liquidator, as the case may be, may himself give evidence or call witnesses. (2) Where the Court makes any such declaration, it may give such further directions as it thinks proper for the purpose of giving effect to that declaration, and in particular may make provision for making the liability of any such person under the declaration a charge on any debt or obligation due from the company to him, or on any mortgage or charge or any interest in any mortgage or charge on any assets of the company held by or vested in him, or any company or person on his behalf, or any person claiming as assignee from or through the person liable or any company or person acting on his behalf, and may from time to time make such further order as may be necessary for the purpose of enforcing any charge imposed under this subsection. For the purposes of this subsection, the expression “assignee” includes any person to whom or in whose favour, by the directions of the person liable, the debt, obligation, mortgage or charge was created, issued or transferred or the interest created, but does not include an assignee for valuable consideration (not including consideration by way of marriage) given in good faith and without notice of any of the matters on the ground of which the declaration is made. 3 of 166 of 1987. (3) Where any business of a company is carried on with such intent or for such purpose as is mentioned in subsection (1) of this section, every person who was knowingly a party to the carrying on of the business in manner aforesaid, shall be liable on conviction to imprisonment not exceeding three years or to a fine not exceeding two thousand, five hundred and sixty-two euros or to both such imprisonment and fine. (4) The provisions of this section shall have effect notwithstanding that the person concerned may be criminally liable in respect of the matters on the ground of which the declaration is to be made. Power of Court to assess damages against delinquent directors, etc."
}