{
  "article_number": "313",
  "title": "Prosecution of delinquent officers and members of company.",
  "content": "313.- (1) If it appears to the Court in the course of a winding up by, or subject to the supervision of, the Court that any past or present officer, or any member, of the company has been guilty of any offence in relation to the company for which he is criminally liable, the Court may, either on the application of any person interested in the winding up, or of its own motion, direct the liquidator to refer the matter to the Attorney-General. (2) If it appears to the liquidator in the course of a voluntary winding up that any past or present officer, or any member, of the company has been guilty of any offence in relation to the company for which he is criminally liable, he shall forthwith report the matter to the Attorney- General, and shall furnish to the Attorney-General such information and give to him such access to and facilities for inspecting and taking copies of any documents, being information or documents in the possession or under the control of the liquidator and relating to the matter in question, as he respectively may require. (3) Where any report is made under subsection (2) to the Attorney- General, he may, if he thinks fit, refer the matter to the Official Receiver and Registrar for further inquiry, and the Official Receiver and Registrar shall thereupon investigate the matter and may, if he thinks it expedient, apply to the Court for an order conferring on him or any person designated by him for the purpose with respect to the company concerned all such powers of investigating the affairs of the company as are provided by this Law in the case of a winding up by the Court. (4) If it appears to the Court in the course of a voluntary winding up that any past or present officer, or any member, of the company has been guilty as aforesaid, and that no report with respect to the matter has been made by the liquidator to the Attorney-General under subsection (2), the Court may, on the application of any person interested in the winding up or of its own motion, direct the liquidator to make such a report, and on a report being made accordingly the provisions of this section shall have effect as though the report had been made in pursuance of the provisions of subsection (2). (5) If, where any matter is reported or referred to the Attorney-General under this section, he considers that the case is one in which a 246 prosecution ought to be instituted, he shall institute proceedings accordingly, and it shall be the duty of the liquidator and of every officer and agent of the company past and present (other than the defendant in the proceedings) to give him all assistance in connection with the prosecution which he is reasonably able to give. For the purposes of this subsection, the expression \"agent” in relation to a company shall be deemed to include any banker or advocate of the company and any person employed by the company as auditor, whether that person is or is not an officer of the company. (6) If any person fails or neglects to give assistance in manner required by subsection (5), the Court may, on the application of the Attorney- General, direct that person to comply with the requirements of the said subsection, and where any such application is made with respect to a liquidator the Court may, unless it appears that the failure or neglect to comply was due to the liquidator not having in his hands sufficient assets of the company to enable him so to do, direct that the costs of the application shall be borne by the liquidator personally. Supplementary Provisions as to Winding up Disqualification for appointment as liquidator."
}