{
  "article_number": "324",
  "title": "Meetings to ascertain wishes of creditors or contributories.",
  "content": "324.- (1) The Court may, as to all matters relating to the winding up of a company, have regard to the wishes of the creditors or contributories of the company, as proved to it by any sufficient evidence and may, if it thinks fit, for the purpose of ascertaining those wishes, direct meetings of the creditors or contributories to be called, held and conducted in such manner as the Court directs, and may appoint a person to act as chairman of any such meeting and to report the result thereof to the Court. (2) In the case of creditors, regard shall be had to the value of each creditor's debt. (3) In the case of contributories, regard shall be had to the number of votes conferred on each contributory by this Law or the articles. Affidavits, etc., in the Republic and outside the Republic. 325*.- (1) Any affidavit required to be sworn under the provisions or for the purposes of this Part may be sworn in the Republic, before any Court, judge or person lawfully authorized to take and receive affidavits or before any of the Republic’s consuls or vice-consuls in any place outside the Republic. (2) All Courts, judges, justices, commissioners and persons acting judicially shall take judicial notice of the seal or stamp or signature, as the case may be, of any such Court, judge, person, consul or vice-consul attached, appended or subscribed to any such affidavit, or to any other document to be used for the purposes of this Part. Provisions as to Dissolution Power of Court to declare dissolution of company void. 326.- (1) Where a company has been dissolved, the Court may at any time within two years of the date of the dissolution, on an application being made for the purpose by the liquidator of the company or by any other person who appears to the Court to be interested, make an order, upon such terms as the Court thinks fit, declaring the dissolution to have been void, and thereupon such proceedings may be taken as might have been taken if the company had not been dissolved. 4 of 166 of 1987. (2) It shall be the duty of the person on whose application the order was made, within seven days after the making of the order, or such further time as the Court may allow, to deliver to the registrar of companies for registration an office copy of the order, and if that person fails so to do he shall be liable to a fine not exceeding forty-two euros for every day during which the default continues. *Note: The wording of section 325 of Cap.113 has been modified in compliance with Article 188 of the Constitution and the Official Languages of the Republic (Interpretation) Law, 1993 (L.21(I)/93) and thus the phrases appearing therein have been omitted. 250 Registrar may strike defunct company off register. 327.- (1) Where the registrar of companies has reasonable cause to believe that a company is not carrying on business or in operation, he may send to the company by post a letter inquiring whether the company is carrying on business or in operation. (2) If the registrar does not within one month of sending the letter receive any answer thereto, he shall within fourteen days after the expiration of the month send to the company by post a registered letter referring to the first letter, and stating that no answer thereto has been received, and that if an answer is not received to the second letter within one month from the date thereof, a notice will be published in the Gazette with a view to striking the name of the company off the register. (3) If the registrar either receives an answer to the effect that the company is not carrying on business or in operation, or does not within one month after sending the second letter receive any answer, he may publish in the Gazette, and send to the company by post, a notice that at the expiration of three months from the date of that notice the name of the company mentioned therein will, unless cause is shown to the contrary, be struck off the register and the company will be dissolved. (4) If, in any case where a company is being wound up, the registrar has reasonable cause to believe either that no liquidator is acting, or that the affairs of the company are fully wound up, and the returns required to be made by the liquidator have not been made for a period of six consecutive months, the registrar shall publish in the Gazette and send to the company or the liquidator, if any, a like notice as is provided in subsection (3). (5) At the expiration of the time mentioned in the notice the registrar may, unless cause to the contrary is previously shown by the company, strike its name off the register, and shall publish notice thereof in the Gazette, and on the publication in the Gazette of this notice the company shall be dissolved: Provided that- (a) the liability, if any, of every director, managing officer and member of the company shall continue and may be enforced as if the company had not been dissolved; and (b) nothing in this subsection shall affect the power of the Court to wind up a company the name of which has been struck off the register. 9 of 76 of 1977. (6) Any company which omits to file at the registrar any document required by this Law, may be struck-off from the Register of Companies, such striking off taking place at least six months after the date of the letter sent by the registrar requesting such document and shall be published in the Official Gazette of the Republic. 9 of 76 of (7) If a company or any member or creditor thereof feels aggrieved by the 251 1977. company having been struck off the register, the Court on an application made by the company or member or creditor before the expiration of twenty years from the publication in the Gazette of the notice aforesaid may, if satisfied that the company was at the time of the striking off carrying on business or in operation, or otherwise that it is just that the company be restored to the register, order the name of the company to be restored to the register, and upon an office copy of the order being delivered to the registrar for registration the company shall be deemed to have continued in existence as if its name had not been struck off; and the Court may by the order give such directions and make such provisions as seem just for placing the company and all other persons in the same position as nearly as may be as if the name of the company had not been struck off. 9 of 76 of 1977. (8) A notice to be sent under this section to a liquidator may be addressed to the liquidator at his last known place of business, and a letter or notice to be sent under this section to a company may be addressed to the company at its registered office, or, if no office has been registered, to the care of some officer of the company, or, if there is no officer of the company whose name and address are known to the registrar of companies, may be sent to each of the persons who subscribed the memorandum, addressed to him at the address mentioned in the memorandum. Property of dissolved company to be bona vacantia. 328. Where a company is dissolved, all property and rights whatsoever vested in or held on trust for the company immediately before its dissolution (not including property held by the company on trust for any other person) shall, subject and without prejudice to any order which may at any time be made by the Court under sections 326 and 327 be deemed to be bona vacantia and shall accordingly belong to the Republic, and shall vest and may be dealt with in the same manner as other bona vacantia accruing to the Republic. Power of the Republic to disclaim title to property vesting under section 328. 329.- (1) Where any property vests in the Republic under section 328, the Republic’s title thereto under that section may be disclaimed by a notice signed by the Accountant-General. (2) Where a notice of disclaimer under this section is executed as respects any property, that property shall be deemed not to have vested in the Republic under section 328, and subsections (2) and (6) of section 304 shall apply in relation to the property as if it had been disclaimed under subsection (1) of the said section 304 immediately before the dissolution of the company. (3) The right to execute a notice of disclaimer under this section may be waived by or on behalf of the Republic either expressly or by taking possession or other act evincing that intention. (4) A notice of disclaimer under this section shall be of no effect unless it is executed within twelve months of the date on which the vesting of the property as aforesaid came to the notice of the Accountant-General, or, if 252 an application in writing is made to the Accountant-General by any person interested in the property requiring him to decide whether he will or will not disclaim, within a period of three months after the receipt of the application or such further period as may be allowed by the Court which would have had jurisdiction to wind up the company if it had not been dissolved. (5) A statement in a notice of disclaimer of any property under this section that the vesting of the property came to the notice of the Accountant-General on a specified date or that no such application as aforesaid was received by him with respect to the property before a specified date shall, until the contrary is proved, be sufficient evidence of the fact stated. (6) And notice of disclaimer under this section shall be delivered to the registrar of companies and retained and registered by him, and copies thereof shall be published in the Gazette and sent to any persons who have given the Accountant-General notice that they claim to be interested in the property. Companies Liquidation Account Liquidation Account. 330. An account, to be called \"the Companies Liquidation Account\" shall be kept by the Accountant-General, and all moneys received by him under the provisions of section 322 shall be paid to that account. Officers Officers and remuneration. 331.- (1) The Council of Ministers may appoint such additional officers as may be required for the execution of this Part, and may remove any person so appointed. (2) The Council of Ministers shall direct whether any and what remuneration is to be allowed to any officer of, or person performing any duties under this Part in relation to the winding up of companies, and may vary, increase or diminish that remuneration as he thinks fit. Returns by officers in winding up. 332. The official receiver and any officer of the Court acting in the winding up of companies shall make to the Accountant-General such returns of their business in connection therewith, at such times, and in such manner and form, as the Accountant-General may direct, and from those returns the Accountant-General may cause books to be prepared which shall, under Regulations made by the Council of Ministers, be open for public information and searches. Rules and Fees General rules and fees for winding up. 333. The Council of Ministers may, with the advice and assistance of the Chief Justice, make general rules for carrying into effect the objects of this Law so far as it relates to the winding up of companies and for the fees to be paid in respect of proceedings in relation thereto and the manner the same shall be collected and accounted for. 253 PART VI – RECEIVERS AND MANAGERS Disqualification of body corporate for appointment as receiver. 4 of 166 of 1987. 334.- A body corporate shall not be qualified for appointment as receiver of the property of a company, and any body corporate which acts as such a receiver shall be liable to a fine not exceeding eight hundred fifty-four euros. Disqualification of undischarged bankrupt from acting as receiver or manager. 3 of 166 of 1987. 335.- (1) If any person being an undischarged bankrupt acts as receiver or manager of the property of a company on behalf of debenture holders, he shall, subject to the following subsection, be liable on conviction to imprisonment not exceeding two years or to a fine not exceeding two thousand five hundred and sixty-two euros or to both such imprisonment and fine. (2) Subsection (1) shall not apply to a receiver or manager where- (a) the appointment under which he acts and the bankruptcy were both before the commencement of this Law; or (b) he acts under an appointment made by order of a Court. Receiver for debenture holders or creditors. 336. Where an application is made to the Court to appoint a receiver on behalf of the debenture holders or other creditors of a company which is being wound up by the Court, the official receiver may be so appointed. Receivers and managers appointed out of Court. 337.- (1) A receiver or manager of the property of a company appointed under the powers contained in any instrument may apply to the Court for directions in relation to any particular matter arising in connection with the performance of his functions, and on any such application the Court may give such directions, or may make such order declaring the rights of persons before the Court or otherwise, as the Court thinks just. (2) A receiver or manager of the property of a company appointed as aforesaid shall, to the same extent as if he had been appointed by order of a Court, be personally liable on any contract entered into by him in the performance of his functions, except in so far as the contract otherwise provides, and entitled in respect of that liability to indemnity out of the assets; but nothing in this subsection shall be taken as limiting any right to indemnity which he would have apart from this subsection, or as limiting his liability on contracts entered into without authority or as conferring any right to indemnity in respect of that liability. Notification that receiver or manager appointed. 338.- (1) Where a receiver or manager of the property of a company has been appointed, every invoice, order for goods or business letter issued by or on behalf of the company or the receiver or manager or the liquidator of the company, being a document on or in which the name of the company appears, shall contain a statement that a receiver or manager has been appointed. 254 4 of 166 of 1987. (2) If default is made in complying with the requirements of this section, the company and any of the following persons who knowingly and wilfully authorizes or permits the default, namely, any officer of the company, any liquidator of the company and any receiver or manager, shall be liable to a fine not exceeding one hundred seventy euros. Power of Court to fix remuneration on application of liquidator. 339.- (1) The Court may, on an application made to the Court by the liquidator of a company, by order fix the amount to be paid by way of remuneration to any person who, under the powers contained in any instrument, has been appointed as receiver or manager of the property of the company. (2) The power of the Court under subsection (1) shall, where no previous order has been made with respect thereto under that subsection,- (a) extend to fixing the remuneration for any period before the making of the order or the application therefore; and (b) be exercisable notwithstanding that the receiver or manager has died or ceased to act before the making of the order or the application therefore; and (c) where the receiver or manager has been paid or has retained for his remuneration for any period before the making of the order any amount in excess of that so fixed for that period, extend to requiring him or his personal representatives to account for the excess or such part thereof as may be specified in the order: Provided that the power conferred by paragraph (c) of this subsection shall not be exercised as respects any period before the making of the application for the order unless in the opinion of the Court there are special circumstances making it proper for the power to be so exercised. (3) The Court may from time to time on an application made either by the liquidator or by the receiver or manager, vary or amend an order made under subsection (1). Provisions as to information where receiver or manager appointed. 340.- (1) Where a receiver or manager of the whole or substantially the whole of the property of the Company (hereafter in this section and in section 341 referred to as “the receiver”,) is appointed on behalf of the holders of any debentures of the company secured by a floating charge, then subject to the provisions of this and of section 341- (a) the receiver shall forthwith send notice to the company of his appointment; and (b) there shall, within fourteen days after receipt of the notice, or such longer period as may be allowed by the Court or by the receiver, be made out and submitted to the receiver in accordance with section 340 a statement in the prescribed form as to the affairs of the company; and (c) the receiver shall within two months after receipt of the said statement send- 255 (i) to the registrar of companies and to the Court, a copy of the statement and of any comments he sees fit to make thereon and in the case of the registrar of companies also a summary of the statement and of his comments (if any) thereon; and (ii) to the company, a copy of any such comments as aforesaid or, if he does not see fit to make any comment, a notice to that effect; and (iii) to any trustees for the debenture holders on whose behalf he was appointed and, so far as he is aware of their addresses, to all such debenture holders a copy of the said summary. (2) The receiver shall within two months, or such longer period as the Court may allow after the expiration of the period of twelve months from the date of his appointment and of every subsequent period of twelve months, and within two months or such longer period as the Court may allow after he ceases to act as receiver or manager of the property of the company, send to the registrar of companies, to any trustees for the debenture holders of the company on whose behalf he was appointed, to the company and (so far as he is aware of their addresses) to all such debenture holders an abstract in the prescribed form showing his receipts and payments during that period of twelve months or, where he ceases to act as aforesaid, during the period from the end of the period to which the last preceding abstract related up to the date of his so ceasing, and the aggregate amounts of his receipts and of his payments during all preceding periods since his appointment. (3) Where the receiver is appointed under the powers contained in any instrument, this section shall have effect- (a) with the omission of the references to the Court in subsection (1); and (b) with the substitution for the references to the Court in subsection (2) of references to the registrar of companies, and in any other case references to the Court shall be taken as referring to the Court by which the receiver was appointed. (4) Subsection (1) shall not apply in relation to the appointment of a receiver or manager to act with an existing receiver or manager or in place of a receiver or manager dying or ceasing to act, except that, where that subsection applies to a receiver or manager who dies or ceases to act before it has been fully complied with, the references in paragraphs (b) and (c) thereof to the receiver shall (subject to subsection (5)) include references to his successor and to any continuing receiver or manager. Nothing in this subsection shall be taken as limiting the meaning of the expression \"the receiver\" where used in, or in relation to, subsection (2). (5) This and section 341, where the company is being wound up, shall 256 apply notwithstanding that the receiver or manager and the liquidator are the same person, but with any necessary modifications arising from that fact. (6) Nothing in subsection (2) shall be taken to prejudice the duty of the receiver to render proper accounts of his receipts and payments to the persons to whom, and at the times at which, he may be required to do so apart from that subsection. 4 of 166 of 1987. (7) If the receiver makes default in complying with the requirements of this section, he shall be liable to a fine not exceeding forty-two euros for every day during which the default continues. Special provisions as to statement submitted to receiver. 341.- (1) The statement as to the affairs of a company required by section 340 to be submitted to the receiver (or his successor) shall show as at the date of the receiver's appointment the particulars of the company's assets, debts and liabilities, the names, residences and occupations of its creditors, the securities held by them respectively, the dates when the securities were respectively given and such further or other information as may be prescribed. (2) The said statement shall be submitted by, and be verified by affidavit of, one or more of the persons who are at the date of the receiver's appointment the directors and by the person who is at that date the secretary of the company, or by such of the persons hereafter in this subsection mentioned as the receiver (or his successor), subject to the direction of the Court, may require to submit and verify the statement, that is to say, persons- (a) who are or have been officers of the company; (b) who have taken part in the formation of the company at any time within one year before the date of the receiver's appointment; (c) who are in the employment of the company, or have been in the employment of the company within the said year, and are in the opinion of the receiver capable of giving the information required; (d) who are or have been within the said year officers of or in the employment of a company which is, or within the said year was, an officer of the company to which the statement relates. (3) Any person making the statement and affidavit shall be allowed, and shall be paid by the receiver (or his successor) out of his receipts, such costs and expenses incurred in and about the preparation and making of the statement and affidavit as the receiver (or his successor) may consider reasonable, subject to an appeal to the Court. (4) Where the receiver is appointed under the powers contained in any instrument, this section shall have effect with the substitution for references to the Court of references to the registrar of companies; and in any other case references to the Court shall be taken as referring to 257 the Court by which the receiver was appointed. 4 of 166 of 1987. (5) If any person without reasonable excuse makes default in complying with the requirements of this section, he shall be liable to a fine not exceeding eighty-five euros for every day during which the default continues. (6) References in this section to the receiver's successor shall include a continuing receiver or manager. Delivery to registrar of accounts of receivers and managers. 342.- (1) Except where subsection (2) of section 340 applies, every receiver or manager of the property of a company who has been appointed under the powers contained in any instrument shall, within one month, or such longer period as the registrar of companies may allow, after the expiration of the period of six months from the date of his appointment and of every subsequent period of six months, and within one month after he ceases to act as receiver or manager, deliver to the registrar of companies for registration an abstract in the prescribed form showing his receipts and his payments during that period of six months, or, where he ceases to act as aforesaid, during the period from the end of the period to which the last preceding abstract related up to the date of his so ceasing, and the aggregate amount of his receipts and of his payments during all preceding periods since his appointment. 4 of 166 of 1987. (2) Every receiver or manager who makes default in complying with the provisions of this section shall be liable to a fine not exceeding forty-two euros for every day during which the default continues. Enforcement of duty of receivers and managers to make returns, etc. 343.- (1) If any receiver or manager of the property of a company- (a) having made default in filing, delivering or making any return, account or other document, or in giving any notice, which a receiver or manager is by law required to file, deliver, make or give, fails to make good the default within fourteen days after the service on him of a notice requiring him to do so; or (b) having been appointed under the powers contained in any instrument, has, after being required at any time by the liquidator of the company so to do, failed to render proper accounts of his receipts and payments and to vouch the same and to pay over to the liquidator the amount properly payable to him, the Court may, on an application made for the purpose, make an order directing the receiver or manager, as the case may be, to make good the default within such time as may be specified in the order. (2) In the case of any such default as is mentioned in paragraph (a) of subsection (1), an application for the purposes of this section may be made by any member or creditor of the company or by the registrar of companies, and in the case of any such default as is mentioned in paragraph (b) of that subsection, the application shall be made by the 258 liquidator, and in either case the order may provide that all costs of and incidental to the application shall be borne by the receiver or manager, as the case may be. (3) Nothing in this section shall be taken to prejudice the operation of enactments imposing penalties on any receivers in respect of any such default as is mentioned in subsection (1). Construction of references to receivers and managers. 344. It is hereby declared that, except where the context otherwise requires,- (a) any reference in this Law to a receiver or manager of the property of a company, or to a receiver thereof, includes a reference to a receiver or manager, or (as the case may be) to a receiver, of part only of that property and to a receiver only of the income arising from that property or from part thereof; and (b) any reference in this Law to the appointment of a receiver or manager under powers contained in any instrument includes a reference to an appointment made under powers which, by virtue of any enactment, are implied in and have effect as if contained in an instrument. PART VII. APPLICATION OF LAW TO COMPANIES FORMED OR REGISTERED UNDER FORMER LAWS Application of Law to companies formed and registered under former Companies Laws. 345. In the application of this Law to existing companies, it shall apply in the same manner- (a) in the case of a company, other than a company limited by guarantee, as if the company had been formed and registered under this Law as a company limited by shares; (b) in the case of a company limited by guarantee, as if the company had been formed and registered under this Law as a company limited by guarantee: 1949. Cap. 191. 25 of 1949. Provided that reference, express or implied, to the date of registration shall be construed as a reference to the date at which the company was registered under the Companies (Limited Liability) Law, or the Companies (Limited by Guarantee) Law, 1949, as the case may be. PART VIII. COMPANIES INCORPORATED OUTSIDE THE REPUBLIC Provisions as to Establishment of Place of Business in the Republic Application of sections 347 346. Sections 347 to 353, both inclusive, shall apply to all overseas companies, that is to say, companies incorporated outside the Republic 259 to 353. which, after the commencement of this Law, establish a place of business within the Republic, and companies incorporated outside the Republic which have, before the commencement of this Law, established a place of business within the Republic and continue to have an established place of business within the Republic at the commencement of this Law. Documents, etc., to be delivered to registrar by overseas companies carrying on business in the Republic. 33(a) of 70(I) of 2003. 347.-(1) Overseas companies which, after the commencement of this Law, establish a place of business within the Republic shall, within one month of the establishment of the place of business, deliver to the registrar of the overseas companies for registration- (a) written report from which the following arises: (i) the name and legal form of the overseas company, as well as the name of the branch, if that is different from the name of the company; (ii) the head office and the address (postal or other) of the overseas company, as well as the address (postal or other) of the place of business; (iii) the object and subject of business of the overseas company and the place of business; (iv) where applicable, the register abroad (with relevant number of entry) of the overseas company, where its basic data has been entered; (v) its subscribed capital where this exists; (vi) where applicable, information in relation to the winding-up of the overseas company, the appointment of liquidators, personal data and the powers of the liquidators, as well as the completion of the liquidation, bankruptcy, bankruptcy compromise or other analogous procedure to which the overseas company is subject; (vii) in the case of an overseas company of a non-member state of the European Union, the law of the state, governing the company. 33 (a) of 70(I) of 2003. 33(b) of 70(I) of 2003. (b) a certified copy of the charter, statutes or memorandum and articles of the company or other instrument constituting or defining the constitution of the company as well as every amendment to the said documents, and, if the instrument is not written in the English language, a certified translation thereof; 33(a) of 70(I) of 2003. (c) a list of the directors and secretary of the company as well as of all the persons which are authorised to represent the company and the branches in its transactions with third parties and before the Courts and the 260 33(c) of 70(I) of 2003. Authorities containing the particulars mentioned in subsection (2); 33(a) of 70(I) of 2003. (d) the names and addresses of some one or more persons resident in the Republic authorised to accept on behalf of the company service of process and any notices required to be served on the company. (2) The list referred to in paragraph (b) of subsection (1) shall contain the following particulars, that is to say- (a) with respect to each director,- (i) in the case of an individual, his present Christian name and surname and any former Christian name or surname, his usual residential address, his nationality and his business occupation, if any, or if he has no business occupation but holds other directorship or directorships, particulars of that directorship or of some one of those directorships; and (ii) in the case of a corporation, its corporate name and registered or principal office; (b) with respect to the secretary or, where there are joint secretaries, with respect to each of them,- (i) in the case of an individual, his present Christian name and surname, any former Christian name and surname and his usual residential address; and (ii) in the case of a corporation its corporate name and registered office. Paragraphs (b) and (c) of subsection (9) of section 192 shall apply for the purpose of the construction of references in this subsection to present and former Christian names and surnames as they apply for the purpose of the construction of such references in that section. 33(d) of 70(I) of 2003. (c) with respect to the persons authorised to represent the overseas company, the commencement, termination and extent of their authorization; 33(d) of 70 (I) of 2003. (d) with respect to the persons authorised to represent the place of business, the commencement, termination and extent of their authorization. 1949. Cap.191. (3) Overseas companies, other than those mentioned in subsection (1), shall, if at the commencement of this Law they have not delivered to the registrar in the case of a company mentioned in subsection (1) of section 146 of the Companies (Limited Liability) Law, the documents and particulars specified in subsection (1) of that section continue subject to the obligation to deliver those documents and particulars in accordance with the said Laws. 261 (4) If any overseas company ceases to have a place of business in the Republic, it shall, forthwith, give notice of the fact to the registrar of companies and, as from the date from which notice is given, the obligation of the company to deliver any document to the registrar shall cease. More than one branches. 34 of 70(I) of 2003. 347A. In the case where the overseas company has more than one branches within the Republic, the disclosure imposed by this Law as regards the information which is common for all branches, shall be complied with by the reference of each new branch to the information entered as to the first branch. In this case, the compulsory disclosure by the other branches shall be restricted to a mention of the register of the branch where the disclosure was made, as well as the entry number of the branch thereof in the said register. Obligatory indications in letters and order forms in respect of branches. 34 of 70(I) of 2003. 347B.-(1) Letters and order forms used by a branch, shall, apart from the indications in paragraph (c) of subsection (1) of section 103, bear the indication of the register, where the file of the branch is kept as well as the entry number thereof in that register. (2) Provided the law of the state by which the company is governed provides for the entry of the company in a register, the above-mentioned letters and order forms must also bear the register in this state as well as the entry number of the company in the said register. Power of overseas company to hold immovable property. 348. Where an overseas company has delivered to the registrar of companies- (a) in the case of a company to which subsection (1) of section 347 applies, the documents and particulars therein mentioned; 1949. Cap.191. (b) in the case of a company mentioned in subsection (1) of section 146 of the Companies (Limited Liability) Law, the documents and particulars specified in subsection (1) of that section, it shall have the same power to hold immovable property in the Republic as if it were a company incorporated under this Law. Return to be delivered to registrar by overseas company where documents, etc., altered. 349. If any alteration is made in- (a) the charter, statutes, or memorandum and articles of an overseas company or any such instrument as aforesaid; or (b) the directors or secretary of an overseas company or the particulars contained in the list of the directors and secretary; or (c) the names or addresses of the persons authorized to accept service on behalf of an overseas company, the company shall, within the prescribed time, deliver to the registrar for the registration a return containing the prescribed particulars of the alteration. Accounts of overseas 350.- (1) (a) Every overseas company, which has a branch in the Republic, 262 company and of place of business. 16 of 167(I) of 2003. shall deliver in each financial year to the registrar of companies, copies of: (i) the financial statements; (ii) the directors’ report; (iii) and the auditors’ report, which the overseas company presented at its last general meeting and proceeded to publish in accordance with the provisions of the state where it is incorporated. (b) Every company of a member state of the European Union, which, in accordance with the laws of the said state and in harmonisation with the provisions of Directives of the European Union No. 78/660/EEC, 83/349/EEC and 84/253/EEC is exempt, in whole or in part of the above- mentioned obligations, shall be exempt from the aforementioned obligation. (2) (a) In addition to the obligation pursuant to subsection (1), every overseas company with a branch in the Republic shall- (i) prepare financial statements and a directors’ report for the branch; (ii) submit the above-mentioned statements and the directors’ report to an auditor for auditing; (iii) deliver to the registrar of companies copies of the above- mentioned financial statements, the directors’ report and the auditors’ report, as defined in sections 118 to 122, as if the branch was a company within the meaning of this Law and in accordance with the applicable provisions in accordance with this Law, subject however to any specific exceptions. 11(a) of 70(I) of 2007. (b) The obligation described in paragraph (a) shall not burden overseas companies which - 11(b) of 70(I) of 2007. (i) in the state of origin, prepare financial statements and submit them for audit and publication in accordance with the provisions of Directives of the European Union No. 78/660/EEC, 83/349/EEC, 84/253/EEC, and (ii) have delivered to the registrar of companies the documents required in subsection (1). 11(c) of 70(I) of 2007. (3) An overseas company which according to the legislation of the state in which it has been incorporated and the provisions of Directives of the European Union No. 78/660/EEC, 83/349/EEC, 84/253/EEC is exempt, in whole or in part, from the obligations in subsections (1) and (2), shall 263 deliver to the registrar of companies a certificate signed by the director and the secretary of the company that the company is an exempt company, stating the provision of the relevant law pursuant to which the exemption applies and the respective provision of the Directives to which it corresponds, which provides for the exemption, as well as a declaration by the relevant Authority that the said company is an exempt company pursuant to the said provision. Obligation to state name of overseas company, whether limited, and country where incorporated. 351. Every overseas company shall- (a) in every prospectus inviting subscriptions for its shares or debentures in the Republic state the country in which the company is incorporated; and (b) conspicuously exhibit on every place where it carries on business in the Republic the name of the company and the country in which the company is incorporated; and (c) cause the name of the company and of the country in which the company is incorporated to be stated in legible characters in all bill-heads and letter paper, and in all notices and other official publications of the company; and (d) if the liability of the members of the company is limited, cause notice of that fact to be stated in legible characters in every such prospectus as aforesaid and in all bill-heads, letter paper, notices and other official publications of the company in the Republic, and to be affixed on every place where it carries on its business. Service on overseas company. 352. Any process or notice required to be served on an overseas company shall be sufficiently served if addressed to any person whose name has been delivered to the registrar under the foregoing provisions of this Part and left at or sent by post to the address which has been so delivered: Provided that- (a) where any such company makes default in delivering to the registrar the name and address of a person resident in the Republic who is authorized to accept on behalf of the company service of process or notices; or (b) if at any time all the persons whose names and addresses have been so delivered are dead or have ceased so to reside, or refuse to accept service on behalf of the company, or for any reason cannot be served, a document may be served on the company by leaving it at or sending it by post to any place of business established by the company in the Republic. Penalties. 4 of 166 of 1987. 4 of 166 of 1987. 353.- If any overseas company fails to comply with any of the foregoing provisions of this Part the company, and every officer or agent of the company who knowingly and wilfully authorises or permits the default, shall be liable to a fine not exceeding four hundred twenty-seven euros, or, in the case of a continuing offence, eighty-five euros for every day during which the default continues. 264 Interpretation of sections 347 to 353. 354. For the purposes of the foregoing provisions of this Part- the expression “certified” means certified in the prescribed manner to be a true copy or a correct translation; the expression “director” in relation to a company includes any person in accordance with whose directions or instructions the directors of the company are accustomed to act; the expression “place of business” includes a share transfer or share registration office; the expression “prospectus” has the same meaning as when used in relation to a company incorporated under this Law; the expression “secretary” includes any person occupying the position of secretary by whatever name called. 2 of 124 (I) of 2006. Transfer of registered office of companies to and outside the Republic Application of sections 354B to 354O. 2 of 124(I) of 2006. 354A.- (1) Sections 354B to 354I shall apply to all overseas companies, incorporated or registered pursuant to the laws of an approved country or jurisdiction, according to the laws of which these companies can still exist as legal entities under the legal regime of another approved country or jurisdiction. (2)Sections 354J to 354O shall apply to all companies incorporated under this Law and wish to continue to exist as legal entities, under the legal regime or jurisdiction of a country other than the Republic. Suitability for registration as a company continuing in the Republic. 2 of 124(I) of 2006. 354B. An overseas company, the memorandum of which enables it to continue under the legal regime of another approved country or jurisdiction, may ask from the registrar to be registered as a company continuing in the Republic pursuant to the provisions of this Law. Application for registration. 2 of 124(I) of 2006. 354C.-(1) The application submitted to the Registrar by the overseas company for its registration as continuing in the Republic shall be accompanied by the following documents: (a) the resolution or equivalent document of the overseas company which authorises it to be registered as continuing in the Republic. The resolution or the equivalent document must, as practicable as possible, been adopted by such body of the overseas company and by such majority according to the laws of the country or jurisdiction under which the overseas company is incorporated and according to its memorandum, in the same way 265 that a special resolution is adopted according to this Law, (b) a copy of the revised memorandum of the overseas company, which satisfies the requirements for the incorporation of the company according to this Law and which is in conformity with the laws of the country or jurisdiction of incorporation of the overseas company, (c) a certificate of good standing or an equivalent document of the overseas company issued by the relevant authority of the country or jurisdiction in which the overseas company is incorporated or other evidence which satisfies the Registrar that the overseas company complies with the conditions of registration of that authority, (d) a sworn affidavit by a director of the overseas company duly authorised by the board of directors or an equivalent administrative body or by a person to whom the management or the representation of the overseas company has been assigned, confirming: (i) the name of the overseas company and the name under which it will continue to exist, which must comply with the provisions of section 4; (ii) the jurisdiction under which the overseas company has been incorporated; (iii) the date of incorporation of the overseas company; (iv) the resolution or the equivalent document deciding that the overseas company will be incorporated as continuing in the Republic according to paragraph (a) of subsection (1); (v) that the overseas company has given official notice to the relevant authority in the country of incorporation of its intention to be registered as continuing in the Republic, according to the procedure laid down in this Law: Provided that the sworn affidavit must be accompanied by a receipt of such official notification; (vi) that no administrative or criminal proceedings have been commenced against the overseas company for the contravention of the laws of the country or the jurisdiction in which it has been incorporated; (e) a sworn affidavit by a director of the overseas company duly authorised by the board of directors or an equivalent administrative body or by a person to whom the administration or the representation of the overseas company has been assigned, which confirms the solvency of the overseas company and by 266 which the signatories will declare that they are not aware of any circumstances which could affect in a negative and substantial manner the solvency of the company in a period of twelve months from the date of submission of the relevant application according to paragraph (a) of subsection (1); (f) a list of the directors of the overseas company and of the secretary of the company if any, and of the persons to whom the administration and or the representation of the company has been assigned to when the overseas company has no directors or secretary; (g) a list of the current members of the overseas company certified in such a way that the Registrar may possibly demand and in such a way that will be acceptable to the Registrar as sufficient conformity with the requirements of this Law in relation to the list of the members of the overseas company; (h) such documents as the Registrar may determine depending on the circumstances and in order to be satisfied that: (i) such an application is permissible under the laws of the country or jurisdiction in which the overseas company has been incorporated and , (ii) the consent has been received by such number or proportion of the shareholders, employees, debenture holders and/or creditors of the overseas company as required by the laws of the country or jurisdiction of incorporation. (2) Every director of an overseas company or the persons to whom the management or representation of the overseas company has been assigned to, whenever making a declaration of solvency according to paragraph (e) of subsection (1), without the facts which they have or should have been aware of to justify such declaration, shall be guilty of an offence, and on conviction thereof, be liable to imprisonment not exceeding one year and to a fine not exceeding thirty-four thousand, one hundred and seventy two euros. Companies which carry out activities for which licence is required and public companies. 2 of 124(I) of 2006. 354D.-(1) (a) When an overseas company carries out within or from the country or jurisdiction of its incorporation or registration, an activity for which a licence or authorization is required both according to Cyprus laws and the laws of the country or jurisdiction of its incorporation or registration, the overseas company is bound to submit to the Registrar the official consent of its registration as continuing in the Republic, which shall be granted by the competent authority granting the above-mentioned licence, or from an authorizing body of the country, or the jurisdiction of incorporation or registration of the company. (b) Notwithstanding the provisions of paragraph (a), every overseas company that is registered as continuing in the Republic and intends to 267 carry out activities for which it needs to obtain a licence or an authorisation in the Republic, it must, according to the law, obtain the said licence or authorisation from the competent authority of the Republic before it begins its activities. (2) Where the overseas company is a public company, it shall submit, in addition to the documents mentioned above, the following documents: (a) if the overseas company has offered its shares or debentures to the public, the most recent public offer for registration or the equivalent document that will satisfy the requirements of this Law; (b) if the overseas company’s shares are listed in a recognized stock exchange, it shall submit evidence that will satisfy the Registrar that the consent of the relevant authorities of the stock exchange has been given in relation to the registration of the company as continuing in the Republic. For the purposes of this paragraph, “recognized stock exchange” means the stock exchange which is recognized by the competent authorities; (c) a list of the current members of the overseas company certified in such a way that the registrar may demand and in such a way as the registrar will accept as sufficient evidence for conformity with the requirements of this Law in relation to the list of members of the overseas company. Registration in the Republic. 2 of 124(I) of 2006. 354E.-(1) Without prejudice to subsection (2), the documents referred to in sections 354C and 354D must be delivered to the registrar for submission, who upon satisfied that they comply with the provisions of this Law, shall submit them temporarily and shall certify that the company is temporarily registered as continuing in the Republic from the date of the registration. The date in question must appear on the temporary certificate of continuation. (2) If, according to the opinion of the registrar, the name declared under section 354C as the name under which the overseas company will continue creates the danger of confusion or it is misleading with the name of a registered company or a trade mark, the registrar shall give directions to the overseas company in order to amend its name and shall not temporarily register the said company according to subsection (1), until he is satisfied that the name under which the overseas company will continue its activities has been amended in such a way that it does not create the danger of confusion or of becoming misleading. Effects of registration. 2 of 124(I) of 2006. 354F. From the date of the entry into force of the temporary certificate of continuation that is issued by the registrar pursuant to section 354E above: (a) the company referred to in the temporary certificate of continuation: (i) shall be considered to be a body corporate incorporated pursuant to this Law and shall be considered as temporarily registered in the Republic for the purposes of this Law, 268 (ii) shall be subject to all the duties and shall be capable to exercise all the powers of a company which is registered pursuant to this Law; (b) the certificate of incorporation, as amended in accordance with paragraph (b) of section 354C of this Law shall be considered to be the memorandum and, where appropriate, the articles of the company; (c)the registration of the overseas company shall be invalid and with no legally binding result, pursuant to this Law, if this is done with the aim: (i) to create a new legal entity; (ii) to cause loss or to affect the continuation of the company as a body corporate; (iii) to affect the property of the company and the way in which this company will retain all its property, rights, debts and obligations; (iv) to render ineffective any legal or other proceedings that were commenced or that are about to be commenced against it; (v) to acquit or prevent any conviction, decision, opinion, order, debt, or obligation which is pending or which will become pending or any reason that exists against the overseas company and or against any shareholder, director, officer or persons to whom the management or representation of the company has been assigned to. Non removal from the register of the country of origin. 2 of 124(I) of 2006. 354G. Within a period of six months from the date of the issuance by the Registrar of the temporary certificate of continuation, the overseas company shall submit evidence to the Registrar from the competent authority of the country or jurisdiction of its incorporation, that it has ceased to be a company registered in the country that it was originally incorporated. In case the overseas company does not submit such evidence, the Registrar may: (a) remove the name of the overseas company from the register and inform the competent authority of the country or jurisdiction concerned that the company is not registered in Cyprus, or (b) in case there is reasonable cause for not having submitted the above-mentioned documents, allow an extension of three months during which the said documents have to be submitted: Provided that in case the documents are not submitted within the prescribed period there is no further extension of time and the procedure provided for in paragraph (a) shall be immediately followed. 269 Certificate of continuation. 2 of 124(I) of 2006. 354H. With the presentation at the Registrar of the evidence that proves that the overseas company is no longer a company registered in the country or jurisdiction that it was originally incorporated and with the delivery at the Registrar of the temporary certificate of continuation, the Registrar shall issue the certificate of continuation confirming that the company is registered as continuing in the Republic. Circumstances where application shall be rejected. 2 of 124(I) of 2006. 354I. An application for the registration of an overseas company as continuing in the Republic shall be rejected in the following circumstances: (a) the dissolution or liquidation of the overseas company has started or the proceedings of insolvency or an arrangement or composition or proceedings of execution of court orders or other analogous proceedings have been initiated from or against the overseas company; (b) a liquidator or special administrator of the overseas company or receiver of its property has been appointed; (c) there is any decision or order with which the creditors’ rights are suspended or limited; or (d) there are proceedings that have commenced against it for the contravention of the laws of the country or the jurisdiction of its incorporation. Right of a company to be registered as continuing outside the Republic. 2 of 124(I) of 2006. 354J. A company registered pursuant to this Law may, provided that the laws of the country or jurisdiction so permit, and provided that the consent of the Registrar has been granted in advance, submit an application to the competent authority of the country or jurisdiction that it chose to be registered with the aim to continue under the legal regime of that country or jurisdiction. Application for the Registrar’s consent for the continuation of the company outside the Republic. 2 of 124(I) of 2006. 354K. The application of the company for the consent of the Registrar to continue to exist as a body corporate under the legal regime of the country or jurisdiction other than the Republic, shall be accompanied by a statement signed by at least two directors of the company duly authorised from its board of directors or if the board of directors comprises of only one director, from him, and it must include the following: (a) the name of the company, under which it wishes to be registered in the approved country or jurisdiction, (b) the place of the proposed registration of the company and the 270 name and address of the competent authority in the approved country or jurisdiction, and (c) the date on which it is proposed to establish the head office of the company in the particular approved country or jurisdiction. Requirements for the Registrar’s consent. 2 of 124(I) of 2006. 354L. For the consent of the Registrar to be granted in relation to the continuation of the company in another country or jurisdiction the following requirements must be in effect: (a) (i) an approved shareholders’ special resolution of the company according to the memorandum and articles of the company authorizing the said application; (ii) before the general meeting, the directors present interim statements which include the registrations and important changes of real value which are not evident from the registrations and which are drawn up from the date of invitation to the said general meeting; (iii) the special resolution together with the interim statements must be delivered to the registrar for submission to the file of the company, (b) the company shall deliver to the Registrar for submission a declaration which confirms the solvency of the company and which confirms that the directors are not aware of any circumstances that could negatively influence the solvency of the company within a period of three years. The said declaration shall be signed by at least two directors of the company, duly authorized by its board of directors except if the board of directors comprises of one director, in which case it shall be signed by him, (c) when the company carries out any activity within or from the Republic that requires a licence from any competent authority, the company must have submitted to the Registrar evidence of such consent by the said competent authority for the continuation of the company in another country or jurisdiction, (d) in case that the company is a public company, and its shares have been listed on a recognized stock exchange, the company must have submitted to the Registrar the consent of the said stock exchange and of the Cyprus Stock Exchange Commission, (e) the company has submitted all the fees and has completed all the proceedings relating to the company’s business, according to this Law, (f) the company has submitted the relevant fee regarding its 271 application for the registrar’s consent, (g) no proceedings for the liquidation of the company have been initiated nor, any insolvency proceedings, arrangements or compositions, or proceedings for execution of court orders or any other analogous proceedings have been initiated by or against the company, in the Republic or elsewhere, (h) at the time of filing the application for the Registrar’s consent, the company has not contravened its duties or obligations according to this Law, (i) the company must have submitted the total of the taxes and duties that are due or that will become due until the date of submission of the application provided for in section 354K. (2) Any director of a company making a declaration of solvency under subparagraph (a) of subsection (1) without the facts he had or should have been aware of to justify such a declaration, shall be guilty of an offence and on conviction thereof be liable to imprisonment not exceeding one year and to a fine not exceeding €34.172 (thirty four thousand, one hundred and seventy two euros) Right of creditors to object to the continuation of the company. 2 of 124(I) of 2006. 354M.- (1) In addition to the requirements of section 354L of this Law, the registrar shall refuse to give its consent for the continuation of the company in another approved country or jurisdiction until three months have passed from the publication of a notice in two daily newspapers of wide circulation in the Republic, which is related to the extraordinary resolution referred to in paragraph (a) of subsection (1) of section 354L of this Law. A copy of the publication in the newspaper submitted to the Registrar within fourteen (14) days shall be evidence of such publication. (2) During the aforementioned period of three months, any creditor of the company may object before a Court to the continuation of the company under the legal regime of another country or jurisdiction, indicating sufficient reason why the said continuation of the company must not be effected. The Court may approve the said continuation of the company with an order, or it may approve the said continuation of the company on the basis of sufficient guarantees or prohibit the said continuation of the company. Consent to the continuation of the company. 2 of 124(I) of 2006. 354N. Provided that the requirements of section 354L are fulfilled and the three month period referred to in section 354M has expired without an objection to the continuation of the company, or in the case that an objection has been submitted provided that the Court approved the continuation of the company under the legal regime of another country or jurisdiction or approves the said continuation of the company according to sufficient guarantees and such guarantees are provided, the Registrar shall consent to the continuation of the company under the legal regime of another country or jurisdiction. Striking off 354O. With the issue of the document of continuation according to which 272 from the register. 2 of 124(I) of 2006. the company continues in another approved country or jurisdiction, the company shall immediately deliver to the Registrar a copy of the document of continuation and, with this act, the company shall cease to be a registered company in the Republic from the date that its continuation in the other approved country or jurisdiction is placed in force, the Registrar shall strike off the name of the company from the register and it shall issue a certificate of striking off: Provided that pursuant to this section, striking off from the register shall not constitute liquidation and that, nothing in this section shall- (a) oust or prejudice the jurisdiction of any Court in the Republic in proceedings which were initiated by or against the company before it ceased to be a company registered in the Republic, (b) affect the property of the company, (c) exempt or prejudice any conviction, decision, opinion, order, debt, responsibility or obligation that is owed or that is about to be owed or for any reason that exists against the company or any other person. Register of companies which continue outside Cyprus. 2 of 124(I) of 2006. 354P. The Registrar shall keep a register of all companies that received his consent to be registered as continuing in another approved country or jurisdiction. The register shall include the name of the company as continuing as well as all relevant details. Submission of documents in Greek. 2 of 124(I) of 2006. 354Q. Where, pursuant to the provisions of this Part, it is required to deliver documents to the Registrar, these documents have to be submitted in the Greek language or in certified translation in the Greek language. Interpretation of sections 354A to 354P. 2 of 124(I) of 2006. 354R. For the purpose of interpretation of the provisions of sections 354A to 354P- “overseas company” means a company incorporated outside the Republic; “document of continuation” includes every document or certificate confirming that the company has been registered as a company continuing in an approved country or jurisdiction outside the Republic; “approved country or jurisdiction” means a country or jurisdiction having equivalent legislative provisions as this Law; 273 64(I) of 2001 157(I) of 2002 71(I) of 2004 187(I) of 2004. “Cyprus Stock Exchange Commission” means the public law corporate body that was set up by virtue of the Stock Exchange Commission (Constitution and Competence) Law; “continuing company” means the company that continues to exist as a body corporate under the legal regime of another approved country or jurisdiction: Provided that the rights and obligations of the continuing company shall not be affected by the registration of the company as one continuing within and outside the Republic according to this Law; “document of incorporation” includes the memorandum and the articles as well as any other document serving the same purpose. Prospectuses Dating of prospectus and particulars to be contained therein. 355.- (1) It shall not be lawful for any person to issue, circulate or distribute in the Republic any prospectus offering for subscription shares in or debentures of a company incorporated or to be incorporated outside the Republic, whether the company has or has not established, or when formed will or will not establish, a place of business in the Republic unless the prospectus is dated and- (a) contains particulars with respect to the following matters:- (i) the instrument constituting or defining the constitution of the company; (ii) the enactments, or provisions having the force of an enactment, by or under which the incorporation of the company was effected; (iii) an address in the Republic where the said instrument, enactments or provisions, or copies thereof, and if the same are in a foreign language a translation thereof certified in the prescribed manner, can be inspected; (iv) the date on which and the country in which the company was incorporated; (v) whether the company has established a place of business in the Republic, and, if so, the address of its principal office in the Republic; Fourth Schedule. (b) subject to the provisions of this section, states the matters specified in Part I of the Fourth Schedule and sets out the reports specified in Part II of that Schedule, subject always to the provisions contained in Part III of that Schedule:  Note: Law 64(I) of 2001, as amended, was repealed and replaced by the Stock Exchange Commission Law, 2009 (L.73(I)/2009). 274 Fourth Schedule. Provided that the provisions of sub-paragraphs (i), (ii) and (iii) of paragraph (a) shall not apply in the case of a prospectus issued more than two years after the date at which the company is entitled to commence business, and, in the application of Part I of the Fourth Schedule for the purposes of this subsection, paragraph 2 thereof shall have effect with the substitution, for the reference to the articles, of a reference to the constitution of the company. (2) Any condition requiring or binding an applicant for shares or debentures to waive compliance with any requirement imposed by virtue of paragraph (a) or (b) of subsection (1), or purporting to affect him with notice of any contract, document or matter not specifically referred to in the prospectus, shall be void. (3) It shall not be lawful for any person to issue to any person in the Republic a form of application for shares in or debentures of such a company or intended company as is mentioned in subsection (1) unless the form is issued with a prospectus which complies with this Part and the issue whereof in the Republic does not contravene the provisions of section 357 of this Law: Provided that this subsection shall not apply if it is shown that the form of application was issued in connection with a bona fide invitation to a person to enter into an underwriting agreement with respect to the shares or debentures. (4) In the event of non-compliance with or contravention of any of the requirements imposed by paragraphs (a) and (b) of subsection (1), a director or other person responsible for the prospectus shall not incur any liability by reason of the non-compliance or contravention, if- (a) as regards any matter not disclosed, he proves that he was not cognizant thereof; or (b) he proves that the non-compliance or contravention arose from an honest mistake of fact on his part; or (c) the non-compliance or contravention was in respect of matters which, in the opinion of the Court dealing with the case, were immaterial or were otherwise such as ought, in the opinion of that Court, having regard to all the circumstances of the case, reasonably to be excused: Fourth Schedule. Provided that, in the event of failure to include in a prospectus a statement with respect to the matters contained in paragraph 16 of the Fourth Schedule, no director or other person shall incur any liability in respect of the failure unless it be proved that he had knowledge of the matters not disclosed. (5) This section- 275 (a) shall not apply to the issue to existing members or debenture holders of a company of a prospectus or form of application relating to shares in or debentures of the company, whether an applicant for shares or debentures will or will not have the right to renounce in favour of other persons; and (b) except in so far as it requires a prospectus to be dated, shall not apply to the issue of a prospectus relating to shares or debentures which are or are to be in all respects uniform with shares or debentures previously issued and for the time being dealt in or quoted on a prescribed stock exchange, but, subject as aforesaid, this section shall apply to a prospectus or form of application whether issued on or with reference to the formation of a company or subsequently. (6) Nothing in this section shall limit or diminish any liability which any person may incur under the general law or this Law, apart from this section. Exclusion of section 355 and relaxation of Fourth Schedule in case of certain prospectuses. 356.- (1) Where- (a) it is proposed to offer to the public by a prospectus issued generally any shares in or debentures of a company incorporated or to be incorporated outside the Republic, whether the company has or has not established, or when formed will or will not establish, a place of business in the Republic; and (b) application is made to a prescribed stock exchange for permission for those shares or debentures to be dealt in or quoted on that stock exchange, Fourth Schedule. there may on the request of the applicant be given by or on behalf of that stock exchange a certificate of exemption, that is to say, a certificate that, having regard to the proposals (as stated in the request) as to the size and other circumstances of the issue of shares or debentures and as to any limitation on the number and class of persons to whom the offer is to be made, compliance with the requirements of the Fourth Schedule would be unduly burdensome. (2) If a certificate of exemption is given, and if the proposals aforesaid are adhered to and the particulars and information required to be published in connection with the application for permission to the stock exchange are so published, then: Fourth Schedule. (a) a prospectus giving the particulars and information aforesaid in the form in which they are so required to be published shall be deemed to comply with the requirements of the Fourth Schedule; and (b) except in so far as it requires a prospectus to be dated, the last foregoing section shall not apply to any issue, after the permission applied for is given, of a prospectus or form of application relating to the 276 shares or debentures. Provisions as to expert’s consent and allotment. 357.- (1) It shall not be lawful for any person to issue, circulate or distribute in the Republic any prospectus offering for subscription shares in or debentures of a company incorporated or to be incorporated outside the Republic, whether the company has or has not established, or when formed will or will not establish, a place of business in the Republic- (a) if, where the prospectus includes a statement purporting to be made by an expert, he has not given, or has before delivery of the prospectus for registration withdrawn, his written consent to the issue of the prospectus with the statement included in the form and context in which it is included or there does not appear in the prospectus a statement that he has given and has not withdrawn his consent as aforesaid; or (b) if the prospectus does not have the effect, where an application is made in pursuance thereof, of rendering all persons concerned bound by all the provisions (other than penal provisions) of section 49, so far as applicable. (2) In this section the expression “expert” includes engineer, valuer, accountant and any other person whose profession gives authority to a statement made by him, and for the purposes of this section a statement shall be deemed to be included in a prospectus if it is contained therein or in any report or memorandum appearing on the face thereof or by reference incorporated therein or issued therewith. Registration of prospectus. 358.- (1) It shall not be lawful for any person to issue, circulate or distribute in the Republic any prospectus offering for subscription shares in or debentures of a company incorporated or to be incorporated outside the Republic, whether the company has or has not established, or when formed will or will not establish, a place of business in the Republic, unless before the issue, circulation or distribution of the prospectus in the Republic, a copy thereof certified by the chairman and two other directors of the company as having been approved by resolution of the managing body has been delivered for registration to the registrar of companies, and the prospectus states on the face of it that a copy has been so delivered, and there is endorsed on or attached to the copy- (a) any consent to the issue of the prospectus required by section 357; Fourth Schedule. (b) a copy of any contract required by paragraph 14 of the Fourth Schedule to be stated in the prospectus or, in the case of a contract not reduced into writing, a memorandum giving full particulars thereof or, if in the case of a prospectus deemed by virtue of a certificate granted under section 356 to comply with the requirements of that Schedule, a contract or a copy thereof or a memorandum of a contract is required to be available for inspection in connection with the application under that section to the stock exchange in question, a copy or, as the case may be, a memorandum of that contract; and 277 (c) where the persons making any report required by Part II of that Schedule have made therein or have, without giving the reasons, indicated therein any such adjustments as are mentioned in paragraph 29 of that Schedule, a written statement signed by those persons setting out the adjustments and giving the reasons therefore. (2) The references in paragraph (b) of subsection (1) to the copy of a contract required thereby to be endorsed on or attached to a copy of the prospectus shall, in the case of a contract wholly or partly in a foreign language, be taken as references to a copy of a translation of the contract in English or a copy embodying a translation in English of the parts in a foreign language, as the case may be, being a translation certified in the prescribed manner to be a correct translation, and the reference to a copy of a contract required to be available for inspection shall include a reference to a copy of a translation thereof or a copy embodying a translation of parts thereof. 19 of 99(I) of 2009. (3) In the case of a public company, which issues a prospectus for the purpose of subscription of its shares or other securities or transferable securities in a foreign market and in relation to which the exception of section 361A does not apply, the prospectus as well as any other documents which accompany it or which must be submitted for registration, may, at the option of the company, be submitted in a language which is widely used in the international financial sector. Penalty for contravention of sections 355 to 358. 3 of 166 of 1987. 359. Any person who is knowingly responsible for the issue, circulation or distribution of a prospectus, or for the issue of a form of application for shares or debentures, in contravention of any of the provisions of sections 355 to 358 shall be liable to imprisonment not exceeding two years or to a fine not exceeding two thousand, five hundred and sixty-two euros or to both such imprisonment and fine. Civil liability for misstatements in prospectus. 360. Section 43 shall extend to every prospectus offering for subscription shares in or debentures of a company incorporated or to be incorporated outside the Republic, whether the company has or has not established, or when formed will or will not establish, a place of business in the Republic, with the substitution, for references to section 40, of references to section 357. Interpretation of provisions as to prospectuses. 361.- (1) Where any document by which any shares in or debentures of a company incorporated outside the Republic are offered for sale to the public would, if the company concerned had been a company within the meaning of this Law, have been deemed by virtue of section 45 to be a prospectus issued by the company, that document shall be deemed to be, for the purposes of this Part, a prospectus issued by the company. (2) An offer of shares or debentures for subscription or sale to any person whose ordinary business it is to buy or sell shares or debentures, whether as principal or agent, shall not be deemed an offer to the public for the purposes of this Part. (3) In this Part the expressions \"prospectus\", \"shares\" and \"debentures\" 278 have the same meaning as when used in relation to a company incorporated under this Law. Non-application of sections 355 to361 of the Law. 20 of 99(I) of 2009. 114(I) of 2005. 200(I) of 2004. 361A. The provisions of sections 355 to 361 of the Law shall not apply in relation to shares or debentures, to which the Public Offer and Prospectus Law and/or the Open Ended Undertakings for Collective Investments in Transferable Securities (UCITS) and for Related Matters Law apply. Winding Up Winding up of overseas companies. 2 of 9 of 1968. 362. Where a company incorporated outside the Republic or which has been carrying on business in the Republic, ceases to carry on business in the Republic, it may be wound up by the Court under the provisions of this Law, notwithstanding that it has been dissolved or otherwise ceases to exist as a company under or by virtue of the Laws of the country under which it was incorporated. PART IX GENERAL PROVISIONS AS TO REGISTRATION Registration offices. 363.- (1) For the purposes of the registration of companies under this Law, there shall be an office in the Republic at such place as the Council of Ministers thinks fit. (2) The Council of Ministers may appoint such registrars, assistant registrars, clerks and servants as the Council of Ministers thinks necessary for the registration of companies under this Law, and may make regulations with respect to their duties, and may remove any persons so appointed. (3) The Council of Ministers may direct a seal or seals to be prepared for the authentication of documents required for or connected with the registration of companies. (4) Whenever any act is by this Law directed to be done to or by the registrar of companies, it shall, until the Council of Ministers otherwise directs, be done to or by the existing registrar of companies, or in his absence to or by such person as the Council of Ministers may for the time being authorise: Provided that, in the event of the Council of Ministers altering the constitution of the existing registry office, any such act shall be done to or by such officer and at such place with reference to the local situation of the registered offices of the companies to be registered as the Council of Ministers may appoint. Fees and rights to be paid by registrar into the Treasury 364. The registrar shall deposit all fees and stamp duties which are paid to it at the Treasury of the Republic. 279 of the Republic. 10 of 76 of 1977. Inspection, production and evidence of documents kept by registrar. 365.- (1) Any person may- 11(a) of 76 of 1977. (a) inspect the documents kept by the registrar of companies, on payment of such fee as may be appointed by the Council of Ministers, 11(b) of 76 of 1977. (b) require a certificate of the incorporation of any company, or a copy or extract of any other document or any part of any other document, to be certified by the registrar, on payment for the certificate, certified copy or extract of such fees as the Council of Ministers may appoint. Provided that- (i) in relation to documents delivered to the registrar with a prospectus in pursuance of sub-paragraph (i) of paragraph (b) of subsection (1) of section 41, the rights conferred by this subsection shall be exercisable only during the fourteen days beginning with the date of publication of the prospectus or with the permission of the Council of Ministers, and in relation to documents so delivered in pursuance of paragraph (b) of subsection (1) of section 358 the said rights shall be exercisable only during the fourteen days beginning with the date of the prospectus or with the permission of the Council of Ministers; and 7(a) of 151(I) of 2000. (ii) the right conferred by paragraph (a) of this subsection shall not extend to any copy sent to the registrar under section 340 of a statement as to the affairs of a company or of any comments of the receiver or his successor or a continuing receiver or manager thereon, but only to the summary thereof, except where the person claiming the right either is or is the agent of a person stating himself in writing to be a member or creditor of the company to which the statement relates, and the right conferred by paragraph (b) of this subsection shall be similarly limited; 7(b) of 151(I) of 2000. (c) subject to the provisions of subsection (3), request that the copies, mentioned in paragraph (b), be issued without certification by the registrar. (2) No process for compelling the production of any document kept by the registrar shall issue from any Court except with the leave of that Court, and any such process if issued shall bear thereon a statement that it is issued with the leave of the Court. (3) A copy of, or extract from, any document kept and registered at the office for the registration of companies, certified to be a true copy under the hand of the registrar or other officer duly authorized by him (whose official position it shall not be necessary to prove), shall in all legal 280 proceedings be admissible in evidence as of equal validity with the original document. 4 of 166 of 1987. (4) Any person untruthfully stating himself in writing for the purposes of proviso (ii) to subsection (1) to be a member or creditor of a company shall be liable to a fine not exceeding four hundred twenty-seven euros. Notice from the Registrar on keeping records. Prevalence of particulars entered in the register or published in the Official Gazette of the Republic. 35 of 70(I) of 2003. 365A.- (1) Care of the Registrar, an announcement relating to the undertaking by him for keeping and presenting as set out in section 365, of all the documents which are delivered to him from the companies in accordance with the provisions of this Law, shall be published in the Official Gazette of the Republic. (2) The announcement shall mandatorily contain- (a) the name of the company; (b) a reference to the type of document and the subject matter to which it refers; (c) the date of submission. (3) The announcement shall be drawn up care of the submitting company. In this case it shall be checked by the registrar for its completeness and accuracy. (4) In the case of discrepancy between the entry in the Register and the publication in the Official Gazette of the Republic, the text published in the Official Gazette of the Republic cannot be used as against third parties by the company. Third parties may, however, rely on it, unless the company proves that the third parties had knowledge of the entered documents or particulars. 12 of 70(I) of 2007. (5) All documents and particulars which, by virtue of the provisions of this Law shall be delivered by the company to the Registrar and shall be entered in the Register, can be used against third parties by the company only after the publication regulated in accordance with subsection (1), unless the company proves that the said third parties had knowledge of the entered documents or entered particulars: Provided that, with regard to the actions carried out before the sixteenth day after publication, the said filed actions and material cannot be used in evidence against third parties who prove that they could not have been aware of the said filed actions and material. (6) Third parties may, in every case, rely upon documents and particulars in respect of which the publication requirements in the Register and the Official Gazette of the Republic have not yet been completed, unless due to a lack of publication the documents and particulars are deprived of validity. Conversion 365B. As of 1st January 2007, the documents delivered by the companies 281 and storage of documents filed at the register of incorporation of companies, in electronic form. 4 of 71(I) of 2007. to the registrar, pursuant to the provisions of sections 4 to 13, 17, 203, 219, subsection (3) of section 243, subsection (2) of section 260 and subsection (1) of section 262 of this Law, shall be filed in the companies register of incorporation in electronic form: Provided that in cases where the documents referred to in this section are delivered to the registrar in a hard copy form, the registrar shall convert same into electronic form: Provided, further that, the registrar may collect a fee with respect to the conversion referred to in the first proviso. Documents to be converted in electronic form on application. 4 of 71(I) of 2007. 365C.-(1) The documents which have been filed at the register of incorporation of companies up to 31st December 2006, pursuant to sections 4 to 13, 17, 203 and 219, subsection (3) of section 243, subsection (2) of section 260 and subsection (1) of section 262 of this Law shall not be required to be converted into electronic form. (2) Any company may, for the purpose of disclosure, file an application for the conversion of the documents referred to in subsection (1) of this section into electronic form, on payment of a relevant fee. Certified copies of documents in electronic form. 4 of 71(I) of 2007. 365D.-(1) Certified copies of documents which have been filed in the register of incorporation of companies pursuant to the provisions of sections 4 to 13, 17, 203, 219, subsection (3) of section 243, subsection (2) of section 260 and subsection (1) of section 262 of this Law, may be obtainable on request, electronically or in writing, as the applicant chooses, regardless of whether the filing of these documents in the register of incorporation of companies has been made before or after the 1 of January 2007. The said application may be submitted by electronic means or in writing, upon payment of the relevant fee. (2) Notwithstanding the application of the provisions of subsection (1), the documents which have been filed in the register of incorporation of companies pursuant to the provisions of sections 4 to 13 of this Law, in hard copy form, until the 31 December 2006, and at least ten years before the filing of the application referred to in subsection (1), shall not be provided by electronic means. (3) The copies may be provided without being certified as true copies, unless the applicant explicitly requests such a certification. (4) With respect to the certification of electronically certified copies, there shall be at least one advanced electronic signature, as the term ‘electronic signature’ is defined under the Legal Framework for Electronic Signatures and other Related Matters Law. (5) For the purpose of interpretation of this section, ‘electronic means’ shall mean that the information is sent initially and received at its destination by means of electronic equipment for the processing (including digital compression) and storage of data and entirely 282 transmitted, conveyed and received by wire or by optical means or other electromagnetic means. Enforcement of duty of company to make returns to registrar. 366.- (1) If a company, having made default in complying with any provision of this Law which requires it to file with, deliver or send to the registrar of companies any return, account or other document, or to give notice to him of any matter, fails to make good the default within fourteen days after the service of a notice on the company requiring it to do so, the Court may, on an application made to the Court by any member or creditor of the company or by the registrar of companies, make an order directing the company and any officer thereof to make good the default within such time as may be specified in the order. (2) Any such order may provide that all costs of and incidental to the application shall be borne by the company or by any officers of the company responsible for the default. (3) Nothing in this section shall be taken to prejudice the operation of any enactment imposing penalties on a company or its officers in respect of any such default as aforesaid. PART X. MISCELLANEOUS PROVISIONS WITH RESPECT TO BANKING COMPANIES AND CERTAIN ASSOCIATIONS Prohibition of banking with more than ten members. 367. No company or association consisting of more than ten persons shall be formed for the purpose of carrying on the business of banking, unless it is registered as a company under this Law, or is formed in pursuance of some other Law, in force for the time being. Privileges of banks making annual return. 42 & 43 Vict.c.11. 368.- (1) Where a company carrying on the business of bankers has duly forwarded to the registrar of companies the annual return required by section 118 and has added thereto a statement of the names of the several places where it carries on business, the company shall be deemed to be a \"bank\" and \"bankers\" within the meaning of the Bankers' Books Evidence Act, 1879. (2) The fact of the said annual return and statement having been duly forwarded may be proved in any legal proceedings by the certificate of the registrar. Publication of periodical statements by banking companies, etc. Fifth Table. 61 of 27 of 1967. 12 of 76/77. Eleventh 369.- (1) Every company, being a banking company or an insurance company or a deposit, provident or benefit society, shall, before it commences business, and also on the first Monday in February and the first Tuesday in August in every year during which it carries on business, make a statement in the form set out in the Eleventh Schedule, or as near thereto as circumstances admit. (2) A copy of the statement shall be put up in a conspicuous place in the registered office of the company and in every branch office or place 283 Schedule. where the business of the company is carried on. (3) Every member and every creditor of the company shall be entitled to a copy of the statement, on payment of a sum not exceeding 0.0427 euros. (4) If default is made in complying with this section, the company and every officer of the company who is in default shall be liable to a default fine. Fifth Table. 61 of 27 of 1967. (5) For the purposes of this Law, a company carrying on business as an insurance company jointly within one or more other businesses, shall be considered to be an insurance company. Fifth Table. 61 of 27 of 1967. (6) This section shall not apply with respect to an insurance company falling within the scope of the provisions of the Insurance Companies Law, 1967 which concern the obligation of such company to submit accounts and a balance-sheet, provided that the company complies with the aforementioned provisions. Prohibition of association with more than twenty members. 370. No association, consisting of more than twenty persons shall be formed for the purpose of carrying on any business (other than the business of banking) that has for its object the acquisition of gain by the association, or by the individual members thereof, unless it is registered as a company under this Law, or is formed in pursuance of some other Law, in force for the time being. PART XI. GENERAL Form of registers, etc. 371.- (1) Any register, index, minute book or book of account required by this Law to be kept by a company may be kept either by making entries in bound books or by recording the matters in question in any other manner. 4 of 166 of 1987. (2) Where any such register, index, minute book or book of account is not kept by making entries in a bound book, but by some other means, adequate precautions shall be taken for guarding against falsification and facilitating its discovery, and where default is made in complying with this subsection, the company and every officer of the company who is in default shall be liable to a fine not exceeding four hundred twenty-seven euros and further shall be liable to a default fine. Service of documents on a company. 372. A document may be served on a company by leaving it at or sending it by post to the registered office of the company. Offences Penalty for false statements. Twelfth Schedule. 13 of 76/77. 373. If any person in any return, report, certificate, balance sheet, or other document, required by or for the purposes of any of the provisions of this Law specified in the Twelfth Schedule, wilfully makes a statement false in any material particular, knowing it to be false, he shall be guilty of an offence, and on conviction thereof be liable to imprisonment not exceeding 284 17(a) of 167(I)/2003. 17(b) of 167(I)/2003. 3 of 166 of 1987. five years or to a fine not exceeding eighty-five thousand, four hundred and thirty euros or to both such imprisonment and fine. Penalty for improper use of word “limited.” 6 of 98(I) of 2006. 4 of 166 of 1987. 374. If any person or persons trade or carry on business under any name or title of which \"limited\" or SE, or any contraction or imitation of that word, is the last word, that person or those persons shall, unless duly incorporated with limited liability, be liable to a fine not exceeding forty-two euros for every day upon which that name or title has been used. Provision with respect to default fines and meaning of “officer in default”. 4 of 166 of 1987. 375.- (1) Where by any enactment in this Law it is provided that a company and every officer of the company who is in default shall be liable to a default fine, the company and every such officer shall, for every day during which the default, refusal or contravention continues, be liable to a fine not exceeding such amount as is specified in the said enactment, or, if the amount of the fine is not so specified, to a fine not exceeding forty-two euros. (2) For the purpose of any enactment in this Law which provides that an officer of a company who is in default shall be liable to a fine or penalty, the expression \"officer who is in default\" means any officer of the company who knowingly and wilfully authorizes or permits the default, refusal or contravention mentioned in the enactment. Production and inspection of books where offence suspected. 376.- (1) If on an application made to a member of a District Court in Chambers by or on behalf of the Attorney-General, the registrar of companies, the official receiver or a Police Officer above the rank of Inspector, there is shown to be reasonable cause to believe that any person has, while an officer of a company, committed an offence in connection with the management of the company’s affairs and that evidence of the commission of the offence is to be found in any books or papers of or under the control of the company, an order may be made- (a) authorizing any person named therein to inspect the said books or papers or any of them for the purpose of investigating and obtaining evidence of the offence; or (b) requiring the secretary of the company or such other officer thereof as may be named in the order to produce the said books or papers or any of them to a person named in the order at a place so named. (2) Subsection (1) shall apply also in relation to any books or papers of a person carrying on the business of banking so far as they relate to the company's affairs, as it applies to any books or papers of or under the control of the company, except that no such order as is referred to in paragraph (b) thereof shall be made by virtue of this subsection. 285 (3) The decision of a member of a District Court under this section shall not be appealable. Jurisdiction of District Court in continuing offences. 377. Whenever under this Law any offence is punishable with a fine for every day during which the default, refusal or contravention constituting the offence continues, such offence shall be triable by a President of a District Court or a District Judge, notwithstanding anything in any other Law contained and notwithstanding that the aggregate amount of the fine which may be imposed is otherwise beyond the jurisdiction of such President of the District Court or District Judge. Provisions as to offences punishable solely by fine. 378.- (1) All offences under this Law made punishable solely by any fine may be prosecuted at any time within twelve months from the date on which evidence sufficient in the opinion of a Law Officer to justify the proceedings comes to his knowledge: Provided that proceedings shall not be so taken more than three years after the commission of the offence. (2) For the purposes of subsection (1), a certificate of a Law Officer as to the date on which such evidence as aforesaid came to his knowledge shall be conclusive evidence thereof. 18 of 1922 to 45 of 1944, 25 of 1949. (3) Subsection (1), so far as it relates to the time within which proceedings may be taken, and subsection (2) shall apply to proceedings in respect of offences which under the Companies (Limited Liability) Laws, 1922 to 1944, and the Companies (Limited by Guarantee) Law, 1949, are triable summarily as it applies to proceedings in respect of the offences mentioned in the said subsection (1): Provided that this subsection shall not have effect in relation to any proceedings if the time allowed under the said Laws apart from this section for taking them had already expired before the commencement of this Law. Application of fines. 379. The Court imposing any fine under this Law may direct that the whole or any part thereof shall be applied in or towards payment of the costs of the proceedings, or in or towards the rewarding the person on whose information or at whose suit the fine is recovered, and subject to any such direction all fines under this Law shall be paid into the Treasury. Saving as to private prosecutors. 380. Nothing in this Law relating to the institution of criminal proceedings by or on behalf of the Attorney-General shall be taken to preclude any person from instituting or carrying on any such proceedings. Saving for privileged communications. 381. Where proceedings are instituted under this Law against any person by or on behalf of the Attorney-General, nothing in this Law shall be taken to require any person who has acted as advocate for the defendant to disclose any privileged communication made to him in that capacity. 286 Legal Proceedings Costs in actions by certain companies. 382. Where a company is plaintiff in any action or other legal proceeding, any judge having jurisdiction in the matter may, if it appears by credible testimony that there is reason to believe that the company will be unable to pay the costs of the defendant if successful in his defence, require sufficient security to be given for those costs, and may stay all proceedings until the security is given. Power of Court to grant relief in certain cases. 383.- (1) If in any proceeding for negligence, default, breach of duty or breach of trust against an officer of a company or a person employed by a company as auditor (whether he is or is not an officer of the company) it appears to the Court hearing the case that that officer or person is or may be liable in respect of the negligence, default, breach of duty or breach of trust, but that he has acted honestly and reasonably, and that, having regard to all the circumstances of the case, including those connected with his appointment, he ought fairly to be excused for the negligence, default, breach of duty or breach of trust, that Court may relieve him, either wholly or partly, from his liability on such terms as the Court may think fit. (2) Where any such officer or person aforesaid has reason to apprehend that any claim will or might be made against him in respect of any negligence, default, breach of duty or breach of trust, he may apply to the Court for relief, and the Court on any such application shall have the same power to relieve him as under this section it would have had if it had been a Court before which proceedings against that person for negligence, default, breach of duty or breach of trust had been brought. Power to enforce orders. 384. Orders made by a Court under this Law may be enforced in the same manner as orders made in an action pending therein. General Provisions as to Council of Ministers Authentication of documents issued by the Council of Ministers. 385. Any approval, sanction or licence or revocation of licence which under this Law may be given or made by the Council of Ministers may be under the hand of the Registrar or of any person authorized in that behalf by the Council of Ministers. Documents made or issued by the Council of Ministers to be evidence. 386. All documents made or issued for the purposes of this Law by the Council of Ministers or any person authorised in that behalf by him shall be received in evidence without further proof. Power to Council of Ministers to make Regulations. 387.- (1) The Council of Ministers shall have power to make regulations- (a) in respect of all matters stated or required in this Law to be prescribed; (b) prescribing forms to be used for any matter under the provisions of this Law; 287 Eighth Schedule. (c) altering or adding to the requirements of this Law as to the matters to be stated in a balance sheet, profit and loss account and group accounts and, in particular, of those of the Eighth Schedule; and any reference in this Law to the said Eighth Schedule shall be considered as a reference to that Schedule with any alterations or additions made by regulations for the time being in force under this subsection; 14 of 76 of 1977. (d) determining the fees or stamp duties which should be paid by virtue of any provision, or in relation to any provision of this Law, or generally by companies or in relation to them, and providing that the manner of payment of such fees and stamp duties namely in cash or by stamps or any of them in cash and others by stamps, will be each time determined by the Registrar; 7 of 98(I) of 2006. (e) in relation to all matters that have to be regulated or are being regulated for the purpose of facilitating the implementation in the Republic of the provisions of Council Regulation (EC) No. 2157/2001 dated 8 of October 2001 concerning the Statute for a European company (SE) as amended from time to time and may, in addition, create offences concerning the contravention of the regulations made by virtue of this paragraph or of the afore-mentioned Council Regulation, which shall be punishable with imprisonment for a term not exceeding two years or with a fine of thirty four thousand, one hundred and seventy-two euros, (€34,172) or with both such imprisonment and fine. (2) The Council of Ministers may by regulations- Table A Eleventh Schedule. 15 of 76 of 1977. (a) alter Table A and the form in the Eleventh Schedule; Tables B, C, and D, of First Schedule and forms in Second Schedule and Part II of Sixth Schedule. (b) alter or add to Tables B, C and D in the First Schedule and the forms in the Second Schedule and Part II of the Sixth Schedule, but no alteration made by the Council of Ministers inTable A shall affect any company registered before the alteration, or repeal as respects that company any portion of that Table. (3) No regulations shall be made under subsection (1) so as to render more onerous the requirements therein referred to, unless a draft of the regulations has been published in the Gazette. 3 of 17 of 1979. (4) Regulations made under this section shall be laid before the House of Representatives. If within thirty days from the date of such laying the House of Representatives does not by resolution amend or annul the Regulations so laid, in whole or in part , they shall then, soon after the period hereinbefore mentioned, be published in the Official Gazette of the Republic and shall come into force as from such publication. In the event of their amendment, in whole or in part, by the House of Representatives, they shall be published in the Official Gazette of the Republic as amended by the House and shall come into force as from 288 such publication. Supplemental Construction of references in other Laws to companies registered under the former Companies Laws. Cap. 1. 11 of 1989. 18 of 1922 to 45 of 1944. 25 of 1949. 388. Notwithstanding subsection (1) of section 11 of the Interpretation Law (which provides that where a Law repeals and re-enacts, with or without modification, any provisions of a former Law, references in any other Law to the provisions so repealed shall, unless the contrary intention appears, be construed as references to the provisions so re-enacted), references in any Law other than this Law to a company formed and registered under the Companies (Limited Liability) Laws, 1922 to 1944, or the Companies (Limited by Guarantee) Law, 1949, shall, unless the context otherwise requires, be construed as references to a company formed and registered under those Laws or this Law. Savings. 389.- (1) Nothing in this Law shall affect any Order in Council, order, rule, regulation, appointment, conveyance, charge, mortgage, deed or agreement made, resolution passed, direction given, proceeding taken, instrument issued or thing done under any former enactment relating to companies, but any such Order in Council, order, rule, regulation, appointment, conveyance, charge, mortgage, deed, agreement, resolution, direction, proceeding, instrument or thing shall, if in force at the commencement of this Law, continue in force, and so far as it could have been made, passed, given, taken, issued or done under this Law shall have effect as if made, passed, given, taken, issued or done under this Law. (2) Nothing in this Law shall affect any prosecution instituted under the provisions of any former enactment relating to companies. (3) Nothing in this Law shall affect- Cap 117. (a) the provisions of section 55 of the Trade Unions Law (which avoids the registration of a trade union under the enactments relating to com- panies); Gazettes Suppl. No.3. 23.2.1946 Suppl. No.2A 9.12.1950. (b) the provisions of any Defence Regulations having effect under the provisions of the Supplies and Services (Transitional Powers) (Cyprus) Order, 1946, which continues in force by the Supplies and Services (Continuance) Order, 1950. (4) Any document referring to any former enactment relating to companies shall be construed as referring to the corresponding enactment of this Law. (5) Any person appointed to any office under or by virtue of any former enactment relating to companies shall be deemed to have been  Note: The Trade Unions Law (Cap117) was repealed and replaced by the Trade Unions Law, 1965 (L.71/1965, as amended by Laws 22 of 1970, 48(I) of 1991, 97(I) of 1996). 289 appointed to that office under or by virtue of this Law. (6) Any register kept under any former enactment relating to companies shall be deemed part of the register to be kept under the corresponding provisions of this Law. (7) All funds and accounts constituted under this Law shall be deemed to be in continuation of the corresponding funds and accounts constituted under the former enactments relating to companies. (8) Nothing in this Law shall affect- (a) the incorporation of any company registered under any enactment hereby repealed; (b) the regulations contained in Table A made under the former enactments relating to companies, so far as the same apply to any company existing at the commencement of this Law. (9) Where any offence, being an offence for the continuance of which a penalty was provided, has been committed under any former enactment relating to companies, proceedings may be taken under this Law in respect of the continuance of the offence after the commencement of this Law, in the same manner as if the offence had been committed under the corresponding provisions of this Law. Cap.1. 11 of 1989. (10) Save to the extent to which it is otherwise provided by subsection (4) the mention of particular matters in this section shall be without prejudice to the general application of section 11 of the Interpretation Law with respect to the effect of repeals. (11) In this section the expression \"former enactment relating to companies\" means the Companies (Limited Liability) Law, and the Companies (Limited by Guarantee) Law, 1949. Provisions as to winding-up proceedings commenced before the date of commencement of the Law. 390.- (1) The provisions of this Law with respect to winding up (other than section 315 as applied for the purposes of section 389 and subsection (2) of this section) shall not apply to any company of which the winding up commenced before the date of the commencement of this Law but any such company shall be wound up in the same manner and with the same incidents as if this Law (apart from the enactments aforesaid) had not passed, and, for the purposes of the winding up, the Laws, under which the winding up commenced shall be deemed to remain in full force. (2) A copy of every order staying the proceedings in a winding up commenced as aforesaid shall forthwith be forwarded by the company, or otherwise as may be prescribed, to the registrar of companies, who shall make a minute of the order in his books relating to the company. 290 Imposition of a fee. 61(2) of 27 of 1967. 8 2 of 117(Ι) of 2011. 8 2 of 6(I) of 2013 2 of 190(I) of 2012 391.-(1) Notwithstanding the provisions of this Law or any other Law or Regulations made thereunder, all registered companies shall be obliged to pay an annual fee of three hundred and fifty euros (€350.00), which shall be paid in accordance with the following procedure: (a) Existing registered companies, which in accordance with the provisions of this section are subject to an obligation of payment of a fee, shall be obliged with respect to the year 2011 to pay such fee, not later than the 31December 2011. (b) Existing registered companies, with respect to each year following the year 2011, shall be obliged to pay such fee, not later than the 30 June of each year: Provided that, in case of companies which belong to a group of companies, the total fees payable by the said companies shall not exceed the amount of twenty thousand euros (€20.000,00), an amount which is apportioned between them in equal parts. {The below transitional provisions were enacted pursuant to the Companies (Amendment) Law, 2013 (L.6(I)/2013) and do not form part of the Law. Notwithstanding paragraph (b) of subsection (1) of section 391 of the principal law (a) The last day for payment of the annual fee for the year 2012 is the 29th March 2013; (b) Every company, which has been registered in 2012 or dormant company or company or group of companies, that do not possess any assets or a company, that does possess assets which are located in areas which are not under the control of the Republic, that has ceased to be exempted from the obligation of payment of the annual fee of three hundred and fifty euros ((€350) after the Companies Amending (No.3) Law of 2012 came into effect, shall not owe the said fee for 2012 and will be deemed as struck off the register as of 1st January 2012, if it applies for the commencement of the procedure for its striking off which is provided in section 327 of the principal law by the 29th March 2013.} (2) In case a company delays to comply with its obligation of payment of the annual fee set out in section until the 30 June of each year, but which  Note: Section 391 of the Companies Law (Cap.113 as amended), was repealed by section 61(2) of the Insurance Companies Law, 1967 (L.27/1967).By virtue of Law 117(I)/2011, a new section 391 has been inserted. 291 2 of 190(I) of 2012 proceeds with the payment of such fee within two months of the date set out above, shall be subject to a charge of ten per cent (10%), while a company which delays to proceed with payment of the said annual fee but which proceeds with its payment within a period of five months after the 30 June of each year, shall be subject to an additional charge of thirty per cent (30%). (3) Notwithstanding the provisions of subsection (2), in case a company does not comply with the payment of the said annual fee, within the time limits set out above and in accordance with the procedures provided for in this section, the Registrar shall proceed with its removal from the register, applying mutatis mutandis, the provisions of section 327 of this Law: Provided that within a time period of two years from the removal of a company from the register and as long as the company pays to the Registrar a fee of five hundred euros (€500.00), such company shall be considered as ipso jure reinstated in the register, and in such case the Registrar shall carry out the relevant correction: Provided further that after two years from the removal of a company from the register and as long as the company pays to the Registrar a fee of seven hundred and fifty euros (€750.00), such company shall be considered as ipso jure reinstated in the register, and in such case the Registrar shall carry out the relevant correction. (4) Deleted. Exemption of companies located in the occupied area from the obligation to pay fees. 2 of 74(I) of 2014. Date of commencement. 391A.- Companies that were registered pursuant to the provisions of the principal law prior to 14 August 1974 and had their registered office or their place of business or all of their assets in an occupied or inaccessible area and that are no longer active and/or do not possess any other asset other than the assets which are located in areas which are not under the control of the Republic, are not obliged to pay the fee provided for in article 391, or to pay other fees and charges provided for under this Law. 392.- This Law came into operation on the 1st day of July, 1951."
}