{
  "article_number": "327",
  "title": "Registrar may strike defunct company off register.",
  "content": "327.- (1) Where the registrar of companies has reasonable cause to believe that a company is not carrying on business or in operation, he may send to the company by post a letter inquiring whether the company is carrying on business or in operation. (2) If the registrar does not within one month of sending the letter receive any answer thereto, he shall within fourteen days after the expiration of the month send to the company by post a registered letter referring to the first letter, and stating that no answer thereto has been received, and that if an answer is not received to the second letter within one month from the date thereof, a notice will be published in the Gazette with a view to striking the name of the company off the register. (3) If the registrar either receives an answer to the effect that the company is not carrying on business or in operation, or does not within one month after sending the second letter receive any answer, he may publish in the Gazette, and send to the company by post, a notice that at the expiration of three months from the date of that notice the name of the company mentioned therein will, unless cause is shown to the contrary, be struck off the register and the company will be dissolved. (4) If, in any case where a company is being wound up, the registrar has reasonable cause to believe either that no liquidator is acting, or that the affairs of the company are fully wound up, and the returns required to be made by the liquidator have not been made for a period of six consecutive months, the registrar shall publish in the Gazette and send to the company or the liquidator, if any, a like notice as is provided in subsection (3). (5) At the expiration of the time mentioned in the notice the registrar may, unless cause to the contrary is previously shown by the company, strike its name off the register, and shall publish notice thereof in the Gazette, and on the publication in the Gazette of this notice the company shall be dissolved: Provided that- (a) the liability, if any, of every director, managing officer and member of the company shall continue and may be enforced as if the company had not been dissolved; and (b) nothing in this subsection shall affect the power of the Court to wind up a company the name of which has been struck off the register. 9 of 76 of 1977. (6) Any company which omits to file at the registrar any document required by this Law, may be struck-off from the Register of Companies, such striking off taking place at least six months after the date of the letter sent by the registrar requesting such document and shall be published in the Official Gazette of the Republic. 9 of 76 of (7) If a company or any member or creditor thereof feels aggrieved by the 251 1977. company having been struck off the register, the Court on an application made by the company or member or creditor before the expiration of twenty years from the publication in the Gazette of the notice aforesaid may, if satisfied that the company was at the time of the striking off carrying on business or in operation, or otherwise that it is just that the company be restored to the register, order the name of the company to be restored to the register, and upon an office copy of the order being delivered to the registrar for registration the company shall be deemed to have continued in existence as if its name had not been struck off; and the Court may by the order give such directions and make such provisions as seem just for placing the company and all other persons in the same position as nearly as may be as if the name of the company had not been struck off. 9 of 76 of 1977. (8) A notice to be sent under this section to a liquidator may be addressed to the liquidator at his last known place of business, and a letter or notice to be sent under this section to a company may be addressed to the company at its registered office, or, if no office has been registered, to the care of some officer of the company, or, if there is no officer of the company whose name and address are known to the registrar of companies, may be sent to each of the persons who subscribed the memorandum, addressed to him at the address mentioned in the memorandum. Property of dissolved company to be bona vacantia."
}