{
  "article_number": "329",
  "title": "Power of the Republic to disclaim title to property vesting under section 328.",
  "content": "329.- (1) Where any property vests in the Republic under section 328, the Republic’s title thereto under that section may be disclaimed by a notice signed by the Accountant-General. (2) Where a notice of disclaimer under this section is executed as respects any property, that property shall be deemed not to have vested in the Republic under section 328, and subsections (2) and (6) of section 304 shall apply in relation to the property as if it had been disclaimed under subsection (1) of the said section 304 immediately before the dissolution of the company. (3) The right to execute a notice of disclaimer under this section may be waived by or on behalf of the Republic either expressly or by taking possession or other act evincing that intention. (4) A notice of disclaimer under this section shall be of no effect unless it is executed within twelve months of the date on which the vesting of the property as aforesaid came to the notice of the Accountant-General, or, if 252 an application in writing is made to the Accountant-General by any person interested in the property requiring him to decide whether he will or will not disclaim, within a period of three months after the receipt of the application or such further period as may be allowed by the Court which would have had jurisdiction to wind up the company if it had not been dissolved. (5) A statement in a notice of disclaimer of any property under this section that the vesting of the property came to the notice of the Accountant-General on a specified date or that no such application as aforesaid was received by him with respect to the property before a specified date shall, until the contrary is proved, be sufficient evidence of the fact stated. (6) And notice of disclaimer under this section shall be delivered to the registrar of companies and retained and registered by him, and copies thereof shall be published in the Gazette and sent to any persons who have given the Accountant-General notice that they claim to be interested in the property. Companies Liquidation Account Liquidation Account."
}