{
  "article_number": "340",
  "title": "Provisions as to information where receiver or manager appointed.",
  "content": "340.- (1) Where a receiver or manager of the whole or substantially the whole of the property of the Company (hereafter in this section and in section 341 referred to as “the receiver”,) is appointed on behalf of the holders of any debentures of the company secured by a floating charge, then subject to the provisions of this and of section 341- (a) the receiver shall forthwith send notice to the company of his appointment; and (b) there shall, within fourteen days after receipt of the notice, or such longer period as may be allowed by the Court or by the receiver, be made out and submitted to the receiver in accordance with section 340 a statement in the prescribed form as to the affairs of the company; and (c) the receiver shall within two months after receipt of the said statement send- 255 (i) to the registrar of companies and to the Court, a copy of the statement and of any comments he sees fit to make thereon and in the case of the registrar of companies also a summary of the statement and of his comments (if any) thereon; and (ii) to the company, a copy of any such comments as aforesaid or, if he does not see fit to make any comment, a notice to that effect; and (iii) to any trustees for the debenture holders on whose behalf he was appointed and, so far as he is aware of their addresses, to all such debenture holders a copy of the said summary. (2) The receiver shall within two months, or such longer period as the Court may allow after the expiration of the period of twelve months from the date of his appointment and of every subsequent period of twelve months, and within two months or such longer period as the Court may allow after he ceases to act as receiver or manager of the property of the company, send to the registrar of companies, to any trustees for the debenture holders of the company on whose behalf he was appointed, to the company and (so far as he is aware of their addresses) to all such debenture holders an abstract in the prescribed form showing his receipts and payments during that period of twelve months or, where he ceases to act as aforesaid, during the period from the end of the period to which the last preceding abstract related up to the date of his so ceasing, and the aggregate amounts of his receipts and of his payments during all preceding periods since his appointment. (3) Where the receiver is appointed under the powers contained in any instrument, this section shall have effect- (a) with the omission of the references to the Court in subsection (1); and (b) with the substitution for the references to the Court in subsection (2) of references to the registrar of companies, and in any other case references to the Court shall be taken as referring to the Court by which the receiver was appointed. (4) Subsection (1) shall not apply in relation to the appointment of a receiver or manager to act with an existing receiver or manager or in place of a receiver or manager dying or ceasing to act, except that, where that subsection applies to a receiver or manager who dies or ceases to act before it has been fully complied with, the references in paragraphs (b) and (c) thereof to the receiver shall (subject to subsection (5)) include references to his successor and to any continuing receiver or manager. Nothing in this subsection shall be taken as limiting the meaning of the expression \"the receiver\" where used in, or in relation to, subsection (2). (5) This and section 341, where the company is being wound up, shall 256 apply notwithstanding that the receiver or manager and the liquidator are the same person, but with any necessary modifications arising from that fact. (6) Nothing in subsection (2) shall be taken to prejudice the duty of the receiver to render proper accounts of his receipts and payments to the persons to whom, and at the times at which, he may be required to do so apart from that subsection. 4 of 166 of 1987. (7) If the receiver makes default in complying with the requirements of this section, he shall be liable to a fine not exceeding forty-two euros for every day during which the default continues. Special provisions as to statement submitted to receiver."
}