{
  "article_number": "341",
  "title": "Special provisions as to statement submitted to receiver.",
  "content": "341.- (1) The statement as to the affairs of a company required by section 340 to be submitted to the receiver (or his successor) shall show as at the date of the receiver's appointment the particulars of the company's assets, debts and liabilities, the names, residences and occupations of its creditors, the securities held by them respectively, the dates when the securities were respectively given and such further or other information as may be prescribed. (2) The said statement shall be submitted by, and be verified by affidavit of, one or more of the persons who are at the date of the receiver's appointment the directors and by the person who is at that date the secretary of the company, or by such of the persons hereafter in this subsection mentioned as the receiver (or his successor), subject to the direction of the Court, may require to submit and verify the statement, that is to say, persons- (a) who are or have been officers of the company; (b) who have taken part in the formation of the company at any time within one year before the date of the receiver's appointment; (c) who are in the employment of the company, or have been in the employment of the company within the said year, and are in the opinion of the receiver capable of giving the information required; (d) who are or have been within the said year officers of or in the employment of a company which is, or within the said year was, an officer of the company to which the statement relates. (3) Any person making the statement and affidavit shall be allowed, and shall be paid by the receiver (or his successor) out of his receipts, such costs and expenses incurred in and about the preparation and making of the statement and affidavit as the receiver (or his successor) may consider reasonable, subject to an appeal to the Court. (4) Where the receiver is appointed under the powers contained in any instrument, this section shall have effect with the substitution for references to the Court of references to the registrar of companies; and in any other case references to the Court shall be taken as referring to 257 the Court by which the receiver was appointed. 4 of 166 of 1987. (5) If any person without reasonable excuse makes default in complying with the requirements of this section, he shall be liable to a fine not exceeding eighty-five euros for every day during which the default continues. (6) References in this section to the receiver's successor shall include a continuing receiver or manager. Delivery to registrar of accounts of receivers and managers."
}