{
  "article_number": "347",
  "title": "Documents etc, to be delivered to registrar by overseas companies carrying on",
  "content": "347.-(1) Overseas companies which, after the commencement of this Law, establish a place of business within the Republic shall, within one month of the establishment of the place of business, deliver to the registrar of the overseas companies for registration- (a) written report from which the following arises: (i) the name and legal form of the overseas company, as well as the name of the branch, if that is different from the name of the company; (ii) the head office and the address (postal or other) of the overseas company, as well as the address (postal or other) of the place of business; (iii) the object and subject of business of the overseas company and the place of business; (iv) where applicable, the register abroad (with relevant number of entry) of the overseas company, where its basic data has been entered; (v) its subscribed capital where this exists; (vi) where applicable, information in relation to the winding-up of the overseas company, the appointment of liquidators, personal data and the powers of the liquidators, as well as the completion of the liquidation, bankruptcy, bankruptcy compromise or other analogous procedure to which the overseas company is subject; (vii) in the case of an overseas company of a non-member state of the European Union, the law of the state, governing the company. 33 (a) of 70(I) of 2003. 33(b) of 70(I) of 2003. (b) a certified copy of the charter, statutes or memorandum and articles of the company or other instrument constituting or defining the constitution of the company as well as every amendment to the said documents, and, if the instrument is not written in the English language, a certified translation thereof; 33(a) of 70(I) of 2003. (c) a list of the directors and secretary of the company as well as of all the persons which are authorised to represent the company and the branches in its transactions with third parties and before the Courts and the 260 33(c) of 70(I) of 2003. Authorities containing the particulars mentioned in subsection (2); 33(a) of 70(I) of 2003. (d) the names and addresses of some one or more persons resident in the Republic authorised to accept on behalf of the company service of process and any notices required to be served on the company. (2) The list referred to in paragraph (b) of subsection (1) shall contain the following particulars, that is to say- (a) with respect to each director,- (i) in the case of an individual, his present Christian name and surname and any former Christian name or surname, his usual residential address, his nationality and his business occupation, if any, or if he has no business occupation but holds other directorship or directorships, particulars of that directorship or of some one of those directorships; and (ii) in the case of a corporation, its corporate name and registered or principal office; (b) with respect to the secretary or, where there are joint secretaries, with respect to each of them,- (i) in the case of an individual, his present Christian name and surname, any former Christian name and surname and his usual residential address; and (ii) in the case of a corporation its corporate name and registered office. Paragraphs (b) and (c) of subsection (9) of section 192 shall apply for the purpose of the construction of references in this subsection to present and former Christian names and surnames as they apply for the purpose of the construction of such references in that section. 33(d) of 70(I) of 2003. (c) with respect to the persons authorised to represent the overseas company, the commencement, termination and extent of their authorization; 33(d) of 70 (I) of 2003. (d) with respect to the persons authorised to represent the place of business, the commencement, termination and extent of their authorization. 1949. Cap.191. (3) Overseas companies, other than those mentioned in subsection (1), shall, if at the commencement of this Law they have not delivered to the registrar in the case of a company mentioned in subsection (1) of section 146 of the Companies (Limited Liability) Law, the documents and particulars specified in subsection (1) of that section continue subject to the obligation to deliver those documents and particulars in accordance with the said Laws. 261 (4) If any overseas company ceases to have a place of business in the Republic, it shall, forthwith, give notice of the fact to the registrar of companies and, as from the date from which notice is given, the obligation of the company to deliver any document to the registrar shall cease. More than one branches. 34 of 70(I) of 2003."
}