{
  "article_number": "350",
  "title": "Accounts of overseas company and of place of business.",
  "content": "350.- (1) (a) Every overseas company, which has a branch in the Republic, 262 company and of place of business. 16 of 167(I) of 2003. shall deliver in each financial year to the registrar of companies, copies of: (i) the financial statements; (ii) the directors’ report; (iii) and the auditors’ report, which the overseas company presented at its last general meeting and proceeded to publish in accordance with the provisions of the state where it is incorporated. (b) Every company of a member state of the European Union, which, in accordance with the laws of the said state and in harmonisation with the provisions of Directives of the European Union No. 78/660/EEC, 83/349/EEC and 84/253/EEC is exempt, in whole or in part of the above- mentioned obligations, shall be exempt from the aforementioned obligation. (2) (a) In addition to the obligation pursuant to subsection (1), every overseas company with a branch in the Republic shall- (i) prepare financial statements and a directors’ report for the branch; (ii) submit the above-mentioned statements and the directors’ report to an auditor for auditing; (iii) deliver to the registrar of companies copies of the above- mentioned financial statements, the directors’ report and the auditors’ report, as defined in sections 118 to 122, as if the branch was a company within the meaning of this Law and in accordance with the applicable provisions in accordance with this Law, subject however to any specific exceptions. 11(a) of 70(I) of 2007. (b) The obligation described in paragraph (a) shall not burden overseas companies which - 11(b) of 70(I) of 2007. (i) in the state of origin, prepare financial statements and submit them for audit and publication in accordance with the provisions of Directives of the European Union No. 78/660/EEC, 83/349/EEC, 84/253/EEC, and (ii) have delivered to the registrar of companies the documents required in subsection (1). 11(c) of 70(I) of 2007. (3) An overseas company which according to the legislation of the state in which it has been incorporated and the provisions of Directives of the European Union No. 78/660/EEC, 83/349/EEC, 84/253/EEC is exempt, in whole or in part, from the obligations in subsections (1) and (2), shall 263 deliver to the registrar of companies a certificate signed by the director and the secretary of the company that the company is an exempt company, stating the provision of the relevant law pursuant to which the exemption applies and the respective provision of the Directives to which it corresponds, which provides for the exemption, as well as a declaration by the relevant Authority that the said company is an exempt company pursuant to the said provision. Obligation to state name of overseas company, whether limited, and country where incorporated."
}