{
  "article_number": "354D",
  "title": "Companies which carry out activities for which a licence is required",
  "content": "354D.-(1) (a) When an overseas company carries out within or from the country or jurisdiction of its incorporation or registration, an activity for which a licence or authorization is required both according to Cyprus laws and the laws of the country or jurisdiction of its incorporation or registration, the overseas company is bound to submit to the Registrar the official consent of its registration as continuing in the Republic, which shall be granted by the competent authority granting the above-mentioned licence, or from an authorizing body of the country, or the jurisdiction of incorporation or registration of the company. (b) Notwithstanding the provisions of paragraph (a), every overseas company that is registered as continuing in the Republic and intends to 267 carry out activities for which it needs to obtain a licence or an authorisation in the Republic, it must, according to the law, obtain the said licence or authorisation from the competent authority of the Republic before it begins its activities. (2) Where the overseas company is a public company, it shall submit, in addition to the documents mentioned above, the following documents: (a) if the overseas company has offered its shares or debentures to the public, the most recent public offer for registration or the equivalent document that will satisfy the requirements of this Law; (b) if the overseas company’s shares are listed in a recognized stock exchange, it shall submit evidence that will satisfy the Registrar that the consent of the relevant authorities of the stock exchange has been given in relation to the registration of the company as continuing in the Republic. For the purposes of this paragraph, “recognized stock exchange” means the stock exchange which is recognized by the competent authorities; (c) a list of the current members of the overseas company certified in such a way that the registrar may demand and in such a way as the registrar will accept as sufficient evidence for conformity with the requirements of this Law in relation to the list of members of the overseas company. Registration in the Republic. 2 of 124(I) of 2006."
}