{
  "article_number": "355",
  "title": "Dating of prospectus and particulars to be contained therein.",
  "content": "355.- (1) It shall not be lawful for any person to issue, circulate or distribute in the Republic any prospectus offering for subscription shares in or debentures of a company incorporated or to be incorporated outside the Republic, whether the company has or has not established, or when formed will or will not establish, a place of business in the Republic unless the prospectus is dated and- (a) contains particulars with respect to the following matters:- (i) the instrument constituting or defining the constitution of the company; (ii) the enactments, or provisions having the force of an enactment, by or under which the incorporation of the company was effected; (iii) an address in the Republic where the said instrument, enactments or provisions, or copies thereof, and if the same are in a foreign language a translation thereof certified in the prescribed manner, can be inspected; (iv) the date on which and the country in which the company was incorporated; (v) whether the company has established a place of business in the Republic, and, if so, the address of its principal office in the Republic; Fourth Schedule. (b) subject to the provisions of this section, states the matters specified in Part I of the Fourth Schedule and sets out the reports specified in Part II of that Schedule, subject always to the provisions contained in Part III of that Schedule:  Note: Law 64(I) of 2001, as amended, was repealed and replaced by the Stock Exchange Commission Law, 2009 (L.73(I)/2009). 274 Fourth Schedule. Provided that the provisions of sub-paragraphs (i), (ii) and (iii) of paragraph (a) shall not apply in the case of a prospectus issued more than two years after the date at which the company is entitled to commence business, and, in the application of Part I of the Fourth Schedule for the purposes of this subsection, paragraph 2 thereof shall have effect with the substitution, for the reference to the articles, of a reference to the constitution of the company. (2) Any condition requiring or binding an applicant for shares or debentures to waive compliance with any requirement imposed by virtue of paragraph (a) or (b) of subsection (1), or purporting to affect him with notice of any contract, document or matter not specifically referred to in the prospectus, shall be void. (3) It shall not be lawful for any person to issue to any person in the Republic a form of application for shares in or debentures of such a company or intended company as is mentioned in subsection (1) unless the form is issued with a prospectus which complies with this Part and the issue whereof in the Republic does not contravene the provisions of section 357 of this Law: Provided that this subsection shall not apply if it is shown that the form of application was issued in connection with a bona fide invitation to a person to enter into an underwriting agreement with respect to the shares or debentures. (4) In the event of non-compliance with or contravention of any of the requirements imposed by paragraphs (a) and (b) of subsection (1), a director or other person responsible for the prospectus shall not incur any liability by reason of the non-compliance or contravention, if- (a) as regards any matter not disclosed, he proves that he was not cognizant thereof; or (b) he proves that the non-compliance or contravention arose from an honest mistake of fact on his part; or (c) the non-compliance or contravention was in respect of matters which, in the opinion of the Court dealing with the case, were immaterial or were otherwise such as ought, in the opinion of that Court, having regard to all the circumstances of the case, reasonably to be excused: Fourth Schedule. Provided that, in the event of failure to include in a prospectus a statement with respect to the matters contained in paragraph 16 of the Fourth Schedule, no director or other person shall incur any liability in respect of the failure unless it be proved that he had knowledge of the matters not disclosed. (5) This section- 275 (a) shall not apply to the issue to existing members or debenture holders of a company of a prospectus or form of application relating to shares in or debentures of the company, whether an applicant for shares or debentures will or will not have the right to renounce in favour of other persons; and (b) except in so far as it requires a prospectus to be dated, shall not apply to the issue of a prospectus relating to shares or debentures which are or are to be in all respects uniform with shares or debentures previously issued and for the time being dealt in or quoted on a prescribed stock exchange, but, subject as aforesaid, this section shall apply to a prospectus or form of application whether issued on or with reference to the formation of a company or subsequently. (6) Nothing in this section shall limit or diminish any liability which any person may incur under the general law or this Law, apart from this section. Exclusion of section 355 and relaxation of Fourth Schedule in case of certain prospectuses."
}