{
  "article_number": "358",
  "title": "Registration of prospectus.",
  "content": "358.- (1) It shall not be lawful for any person to issue, circulate or distribute in the Republic any prospectus offering for subscription shares in or debentures of a company incorporated or to be incorporated outside the Republic, whether the company has or has not established, or when formed will or will not establish, a place of business in the Republic, unless before the issue, circulation or distribution of the prospectus in the Republic, a copy thereof certified by the chairman and two other directors of the company as having been approved by resolution of the managing body has been delivered for registration to the registrar of companies, and the prospectus states on the face of it that a copy has been so delivered, and there is endorsed on or attached to the copy- (a) any consent to the issue of the prospectus required by section 357; Fourth Schedule. (b) a copy of any contract required by paragraph 14 of the Fourth Schedule to be stated in the prospectus or, in the case of a contract not reduced into writing, a memorandum giving full particulars thereof or, if in the case of a prospectus deemed by virtue of a certificate granted under section 356 to comply with the requirements of that Schedule, a contract or a copy thereof or a memorandum of a contract is required to be available for inspection in connection with the application under that section to the stock exchange in question, a copy or, as the case may be, a memorandum of that contract; and 277 (c) where the persons making any report required by Part II of that Schedule have made therein or have, without giving the reasons, indicated therein any such adjustments as are mentioned in paragraph 29 of that Schedule, a written statement signed by those persons setting out the adjustments and giving the reasons therefore. (2) The references in paragraph (b) of subsection (1) to the copy of a contract required thereby to be endorsed on or attached to a copy of the prospectus shall, in the case of a contract wholly or partly in a foreign language, be taken as references to a copy of a translation of the contract in English or a copy embodying a translation in English of the parts in a foreign language, as the case may be, being a translation certified in the prescribed manner to be a correct translation, and the reference to a copy of a contract required to be available for inspection shall include a reference to a copy of a translation thereof or a copy embodying a translation of parts thereof. 19 of 99(I) of 2009. (3) In the case of a public company, which issues a prospectus for the purpose of subscription of its shares or other securities or transferable securities in a foreign market and in relation to which the exception of section 361A does not apply, the prospectus as well as any other documents which accompany it or which must be submitted for registration, may, at the option of the company, be submitted in a language which is widely used in the international financial sector. Penalty for contravention of sections 355 to 358. 3 of 166 of 1987."
}