{
  "article_number": "37A",
  "title": "Possibility to use electronic method.",
  "content": "37A.-(1) From the date of the coming into force of the Companies (Amendment) (No.3) Law, 2011, every form, certificate, minutes or other document delivered or sent to the registrar of companies for filing 45 145(I)/2011. 2 of 145(I) of 2011. 188(I) of 2004 34(I) of 2009. or issued by the registrar of companies, as the case may be, and requiring affirmation, certification or signature pursuant to the provisions of this Law, may be signed by an electronic method, provided that the registrar of companies approves the use of such method, in accordance with the directions he may issue pursuant to subsection (2): Provided that the Council of Ministers may, by a decision thereof, published in the Official Gazette of the Republic, decide that, as of a subsequent date to be determined in the decision thereof it may be possible to use the advanced electronic signature as the term is defined in section 2 of the Legal Framework for Electronic Signatures and Related Matters Law, either in addition or in substitution to the electronic method, referred to in this subsection. (2)(a) The registrar of companies shall issue directions prescribing: (i) the procedure for the implementation of the provisions of this section, (ii) the interpretation of the terms “form”, “certificate”, “minutes” or “other document” for the purposes of this section, and (iii) the details of the electronic method to be used in each case. (b) The directions of the registrar of companies referred to in paragraph (a) shall be published on the website of its office and shall be placed in a conspicuous place at its office. (3) Whenever the electronic method is used for a signature, it shall be deemed to have the same effect as a manual signature, for the purposes of any criminal or civil proceedings and the person who makes use of such signature shall be deemed to have knowledge of the contents of the document that he signs. (4)(a) Without prejudice to the generality of subsection (1), the statutory declaration referred to in subsection (2) of section 17 may be submitted to the registrar of companies through the electronic method by the advocate making such declaration. (b) In case the statutory declaration submitted in accordance with the provisions of paragraph (a) is not true, the person making the declaration shall have the same criminal and civil liability that he would have had as if he had made a false sworn affidavit. PART II. Share Capital and Debentures Prospectus  Law 145(I) of 2011 came into force upon publication in the Official Gazette of the Republic, that is on 4.11.2011 (Official Gazette, Suppl.I(I) ) , No 4302, dated 4.11.2011). 46 Dating of prospectus."
}