{
  "article_number": "387",
  "title": "Power to Council of Ministers to make Regulations.",
  "content": "387.- (1) The Council of Ministers shall have power to make regulations- (a) in respect of all matters stated or required in this Law to be prescribed; (b) prescribing forms to be used for any matter under the provisions of this Law; 287 Eighth Schedule. (c) altering or adding to the requirements of this Law as to the matters to be stated in a balance sheet, profit and loss account and group accounts and, in particular, of those of the Eighth Schedule; and any reference in this Law to the said Eighth Schedule shall be considered as a reference to that Schedule with any alterations or additions made by regulations for the time being in force under this subsection; 14 of 76 of 1977. (d) determining the fees or stamp duties which should be paid by virtue of any provision, or in relation to any provision of this Law, or generally by companies or in relation to them, and providing that the manner of payment of such fees and stamp duties namely in cash or by stamps or any of them in cash and others by stamps, will be each time determined by the Registrar; 7 of 98(I) of 2006. (e) in relation to all matters that have to be regulated or are being regulated for the purpose of facilitating the implementation in the Republic of the provisions of Council Regulation (EC) No. 2157/2001 dated 8 of October 2001 concerning the Statute for a European company (SE) as amended from time to time and may, in addition, create offences concerning the contravention of the regulations made by virtue of this paragraph or of the afore-mentioned Council Regulation, which shall be punishable with imprisonment for a term not exceeding two years or with a fine of thirty four thousand, one hundred and seventy-two euros, (€34,172) or with both such imprisonment and fine. (2) The Council of Ministers may by regulations- Table A Eleventh Schedule. 15 of 76 of 1977. (a) alter Table A and the form in the Eleventh Schedule; Tables B, C, and D, of First Schedule and forms in Second Schedule and Part II of Sixth Schedule. (b) alter or add to Tables B, C and D in the First Schedule and the forms in the Second Schedule and Part II of the Sixth Schedule, but no alteration made by the Council of Ministers inTable A shall affect any company registered before the alteration, or repeal as respects that company any portion of that Table. (3) No regulations shall be made under subsection (1) so as to render more onerous the requirements therein referred to, unless a draft of the regulations has been published in the Gazette. 3 of 17 of 1979. (4) Regulations made under this section shall be laid before the House of Representatives. If within thirty days from the date of such laying the House of Representatives does not by resolution amend or annul the Regulations so laid, in whole or in part , they shall then, soon after the period hereinbefore mentioned, be published in the Official Gazette of the Republic and shall come into force as from such publication. In the event of their amendment, in whole or in part, by the House of Representatives, they shall be published in the Official Gazette of the Republic as amended by the House and shall come into force as from 288 such publication. Supplemental Construction of references in other Laws to companies registered under the former Companies Laws. Cap. 1. 11 of 1989. 18 of 1922 to 45 of 1944. 25 of 1949."
}