{
  "article_number": "389",
  "title": "Savings",
  "content": "389.- (1) Nothing in this Law shall affect any Order in Council, order, rule, regulation, appointment, conveyance, charge, mortgage, deed or agreement made, resolution passed, direction given, proceeding taken, instrument issued or thing done under any former enactment relating to companies, but any such Order in Council, order, rule, regulation, appointment, conveyance, charge, mortgage, deed, agreement, resolution, direction, proceeding, instrument or thing shall, if in force at the commencement of this Law, continue in force, and so far as it could have been made, passed, given, taken, issued or done under this Law shall have effect as if made, passed, given, taken, issued or done under this Law. (2) Nothing in this Law shall affect any prosecution instituted under the provisions of any former enactment relating to companies. (3) Nothing in this Law shall affect- Cap 117. (a) the provisions of section 55 of the Trade Unions Law (which avoids the registration of a trade union under the enactments relating to com- panies); Gazettes Suppl. No.3. 23.2.1946 Suppl. No.2A 9.12.1950. (b) the provisions of any Defence Regulations having effect under the provisions of the Supplies and Services (Transitional Powers) (Cyprus) Order, 1946, which continues in force by the Supplies and Services (Continuance) Order, 1950. (4) Any document referring to any former enactment relating to companies shall be construed as referring to the corresponding enactment of this Law. (5) Any person appointed to any office under or by virtue of any former enactment relating to companies shall be deemed to have been  Note: The Trade Unions Law (Cap117) was repealed and replaced by the Trade Unions Law, 1965 (L.71/1965, as amended by Laws 22 of 1970, 48(I) of 1991, 97(I) of 1996). 289 appointed to that office under or by virtue of this Law. (6) Any register kept under any former enactment relating to companies shall be deemed part of the register to be kept under the corresponding provisions of this Law. (7) All funds and accounts constituted under this Law shall be deemed to be in continuation of the corresponding funds and accounts constituted under the former enactments relating to companies. (8) Nothing in this Law shall affect- (a) the incorporation of any company registered under any enactment hereby repealed; (b) the regulations contained in Table A made under the former enactments relating to companies, so far as the same apply to any company existing at the commencement of this Law. (9) Where any offence, being an offence for the continuance of which a penalty was provided, has been committed under any former enactment relating to companies, proceedings may be taken under this Law in respect of the continuance of the offence after the commencement of this Law, in the same manner as if the offence had been committed under the corresponding provisions of this Law. Cap.1. 11 of 1989. (10) Save to the extent to which it is otherwise provided by subsection (4) the mention of particular matters in this section shall be without prejudice to the general application of section 11 of the Interpretation Law with respect to the effect of repeals. (11) In this section the expression \"former enactment relating to companies\" means the Companies (Limited Liability) Law, and the Companies (Limited by Guarantee) Law, 1949. Provisions as to winding-up proceedings commenced before the date of commencement of the Law."
}