{
  "article_number": "39",
  "title": "Matters to be stated and reports to be set out in prospectus.",
  "content": "39.- (1) Every prospectus issued by or on behalf of a company, or by or on behalf of any person who is or has been engaged or interested in the formation of the company must state the matters specified in Part I of the Fourth Schedule and set out the reports specified in Part II of that Schedule, and the said Parts I and II shall have effect subject to the provisions contained in Part III of that Schedule. (2) A condition requiring or binding an applicant for shares in or debentures of a company to waive compliance with any requirement of this section, or purporting to affect him with notice of any contract, document or matter not specifically referred to in the prospectus, shall be void. (3) It shall not be lawful to issue any form of application for shares in or debentures of a company unless the form is issued with a prospectus which complies with the requirements of this section: Provided that this subsection shall not apply if it is shown that the form of application was issued either- (a) in connection with a bona fide invitation to a person to enter into an underwriting agreement with respect to the shares or debentures; or (b) in relation to shares or debentures which were not offered to the public. 3 of 166 of 1987. If any person acts in contravention of the provisions of this subsection, he shall be liable to imprisonment not exceeding two years or to a fine not exceeding two thousand, five hundred and sixty-two euros or to both such imprisonment and fine. (4) In the event of non-compliance with or contravention of any of the requirements of this section, a director or other person responsible for the prospectus shall not incur any liability by reason of the non- compliance or contravention, if: (a) as regards any matter not disclosed, he proves that he was not cognizant thereof; or (b) he proves that the non-compliance or contravention arose from an honest mistake of fact on his part; or (c) the non-compliance or contravention was in respect of matters which in the opinion of the Court dealing with the case were immaterial or was otherwise such as ought, in the opinion of that Court, having regard to all the circumstances of the case, reasonably to be excused: 47 Fourth Schedule. Provided that, in the event of failure to include in a prospectus a statement with respect to the matters specified in paragraph 16 of the Fourth Schedule, no director or other person shall incur any liability in respect of the failure unless it be proved that he had knowledge of the matters not disclosed. (5) This section shall not apply- (a) to the issue to existing members or debenture holders of a company of a prospectus or form of application relating to shares in or debentures of the company, whether an applicant for shares or debentures will or will not have the right to renounce in favour of other persons; or (b) to the issue of a prospectus or form of application relating to shares or debentures which are or are to be in all respects uniform with shares or debentures previously issued and for the time being dealt in or quoted on a prescribed stock exchange; but, subject as aforesaid, this section shall apply to a prospectus or a form of application whether issued on or with reference to the formation of a company or subsequently. (6) Nothing in this section shall limit or diminish any liability which any person may incur under the general law or this Law apart from this section. Expert’s consent to issue of prospectus containing statement by him."
}