{
  "article_number": "391",
  "title": "Imposition of a fee",
  "content": "391.-(1) Notwithstanding the provisions of this Law or any other Law or Regulations made thereunder, all registered companies shall be obliged to pay an annual fee of three hundred and fifty euros (€350.00), which shall be paid in accordance with the following procedure: (a) Existing registered companies, which in accordance with the provisions of this section are subject to an obligation of payment of a fee, shall be obliged with respect to the year 2011 to pay such fee, not later than the 31December 2011. (b) Existing registered companies, with respect to each year following the year 2011, shall be obliged to pay such fee, not later than the 30 June of each year: Provided that, in case of companies which belong to a group of companies, the total fees payable by the said companies shall not exceed the amount of twenty thousand euros (€20.000,00), an amount which is apportioned between them in equal parts. {The below transitional provisions were enacted pursuant to the Companies (Amendment) Law, 2013 (L.6(I)/2013) and do not form part of the Law. Notwithstanding paragraph (b) of subsection (1) of section 391 of the principal law (a) The last day for payment of the annual fee for the year 2012 is the 29th March 2013; (b) Every company, which has been registered in 2012 or dormant company or company or group of companies, that do not possess any assets or a company, that does possess assets which are located in areas which are not under the control of the Republic, that has ceased to be exempted from the obligation of payment of the annual fee of three hundred and fifty euros ((€350) after the Companies Amending (No.3) Law of 2012 came into effect, shall not owe the said fee for 2012 and will be deemed as struck off the register as of 1st January 2012, if it applies for the commencement of the procedure for its striking off which is provided in section 327 of the principal law by the 29th March 2013.} (2) In case a company delays to comply with its obligation of payment of the annual fee set out in section until the 30 June of each year, but which  Note: Section 391 of the Companies Law (Cap.113 as amended), was repealed by section 61(2) of the Insurance Companies Law, 1967 (L.27/1967).By virtue of Law 117(I)/2011, a new section 391 has been inserted. 291 2 of 190(I) of 2012 proceeds with the payment of such fee within two months of the date set out above, shall be subject to a charge of ten per cent (10%), while a company which delays to proceed with payment of the said annual fee but which proceeds with its payment within a period of five months after the 30 June of each year, shall be subject to an additional charge of thirty per cent (30%). (3) Notwithstanding the provisions of subsection (2), in case a company does not comply with the payment of the said annual fee, within the time limits set out above and in accordance with the procedures provided for in this section, the Registrar shall proceed with its removal from the register, applying mutatis mutandis, the provisions of section 327 of this Law: Provided that within a time period of two years from the removal of a company from the register and as long as the company pays to the Registrar a fee of five hundred euros (€500.00), such company shall be considered as ipso jure reinstated in the register, and in such case the Registrar shall carry out the relevant correction: Provided further that after two years from the removal of a company from the register and as long as the company pays to the Registrar a fee of seven hundred and fifty euros (€750.00), such company shall be considered as ipso jure reinstated in the register, and in such case the Registrar shall carry out the relevant correction. (4) Deleted. Exemption of companies located in the occupied area from the obligation to pay fees. 2 of 74(I) of 2014. Date of commencement. 391A.- Companies that were registered pursuant to the provisions of the principal law prior to 14 August 1974 and had their registered office or their place of business or all of their assets in an occupied or inaccessible area and that are no longer active and/or do not possess any other asset other than the assets which are located in areas which are not under the control of the Republic, are not obliged to pay the fee provided for in article 391, or to pay other fees and charges provided for under this Law."
}