{
  "article_number": "4",
  "title": "Requirements with respect to memorandum.",
  "content": "4.-(1) The memorandum of every company must state: 3(a)(i)of 70(I)of 2003 3(a)(ii)of 70(I)of 2003 2(a)(i)of 24(I)of 2005 2(a)(ii)of 24(I)of 2005 2 of 129(I)of 2005. (a) (i) in the case of a private company, the name of the company together with the word “limited” or “ltd”or in case the name of the company is written in latin characters, with the word ‘’limited or Ltd’’ as the last word of the name; (ii) in the case of a public company, the name of the company with the words ‘’δημόσια λίμιτεδ’’ or ‘’δημόσια λτδ’’ or ‘’δημόσια εταιρεία λίμιτεδ’’ or ‘’δημόσια εταιρεία λτδ’’ or ‘’δε λίμιτεδ’’ or ‘’δε λτδ’’ or in the case the name of the company is written in latin characters with the words ‘’Public Company Limited’’ or Public Company Ltd’’ or “Public Company Limited or ‘’Public Co. Ltd’’ or ‘’ Plc’’ or ‘’ Public Limited’’ or ‘’ Public Ltd’’ as the last words of the name, 3 of 98(I) of 2006. (iii) when referring to SE, the name of the company together with the latin characters “SE” as the last word of the name. (b) the objects of the company. (2) The memorandum of a company where limited by shares or by guarantee must state that the liability of its members is limited. (3) The memorandum of a company limited by guarantee must also state 31 that each member undertakes to contribute to the assets of the company in the event of its being wound up while he is a member, or within one year after he ceases to be a member, for payment of the debts and liabilities of the company contracted before he ceases to be a member, or of the costs, charges and expenses of winding up, and for adjustment of the rights of the contributories among themselves, such amount as may be required, not exceeding a specified amount. (4) In the case of a company having a share capital- (a) the memorandum must also state the amount of share capital with which the company proposes to be registered and the division thereof into shares of fixed amount; (b) no subscriber of the memorandum may take less than one share; (c) each subscriber must write opposite to his name the number of shares he takes. 3(b) of 70(I) of 2003. (5) The articles of a public company- (a) must contain regulations which define the number and the method of appointment of the directors, who are entrusted with the management of the company and its representation against third parties, (b) may contain regulations which define the allocation of responsibilities between the directors. Public company: minimum registered capital. 4 of 70(I) of 2003."
}