{
  "article_number": "41",
  "title": "Registration of prospectus.",
  "content": "41.- (1) No prospectus shall be issued by or on behalf of a company or in 48 of prospectus. relation to an intended company unless, on or before the date of its publication, there has been delivered to the registrar of companies for registration a copy thereof signed by every person who is named therein as a director or proposed director of the company, or by his agent authorized in writing, and having endorsed thereon or attached thereto: (a) any consent to the issue of the prospectus required by section 40 from any person as an expert; and (b) in the case of a prospectus issued generally (that is to say, issued to persons who are not existing members or debenture holders of the company), also- Fourth Schedule. (i) a copy of any contract required by paragraph 14 of the Fourth Schedule to be stated in the prospectus or, in the case of a contract not reduced into writing, a memorandum giving full particulars thereof; and Fourth Schedule. (ii) where the persons making any report required by Part II of that Schedule have made therein, or have, without giving the reasons, indicated therein, any such adjustments as are mentioned in paragraph 20 of that Schedule, a written statement signed by those persons setting out the adjustments and giving the reasons therefore. The references in sub-paragraph (i) of paragraph (b) of this subsection to the copy of a contract required thereby to be endorsed on or attached to a copy of the prospectus shall, in the case of a contract wholly or partly in a foreign language, be taken as references to a copy of a translation of the contract in English or a copy embodying a translation in English of the parts in a foreign language, as the case may be, being a translation certified in the prescribed manner to be a correct translation. (2) Every prospectus shall, on the face of it,- (a) state that a copy has been delivered for registration as required by this section; and (b) specify, or refer to statements included in the prospectus which specify, any documents required by this section to be endorsed on or attached to the copy so delivered. (3) The registrar shall not register a prospectus unless it is dated and the copy thereof signed in manner required by this section and unless it has endorsed thereon or attached thereto the documents (if any) specified as aforesaid. 4 of 166 of (4) If a prospectus is issued without a copy thereof being delivered under this section to the registrar or without the copy so delivered having endorsed thereon or attached thereto the required documents, the company, and every person who is knowingly a party to the issue of the prospectus, shall be liable to a fine not exceeding forty-two euros for every day from the date of the issue of the prospectus until a copy 49 1987. thereof is so delivered with the required documents endorsed thereon or attached thereto. 5 of 99(I) of 2009. (5) In the case of a public company, which issues a prospectus for the purpose of subscription of its shares or other securities or transferable securities in a foreign market and in reference to which the exception of section 46A does not apply, the prospectus as well as any other documents which accompany it or which must be submitted for registration, may, at the option of the company, be submitted in a language which is widely used in the international financial sector. Restriction on alteration of terms in prospectus or statement in lieu of prospectus."
}