{
  "article_number": "47",
  "title": "Prohibition of allotment unless minimum subscription received.",
  "content": "47.- (1) No allotment shall be made of any share capital of a company offered to the public for subscription unless the amount stated in the prospectus as the minimum amount which, in the opinion of the directors, must be raised by the issue of share capital in order to provide for the matters specified in paragraph 4 of the Fourth Schedule has been subscribed, and the sum payable on application for the amount so stated has been paid to and received by the company. For the purposes of this subsection, a sum shall be deemed to have been paid to and received by the company if a cheque for that sum has been received in good faith by the company and the directors of the company have no reason for suspecting that the cheque will not be paid. (2) The amount so stated in the prospectus shall be reckoned exclusively of any amount payable otherwise than in cash and is in this Law referred to as the \"minimum subscription.\" 9 of 70(I) of 2003. (3) The amount payable on application on each share shall not be less than twenty-five percent of the nominal amount of the share. (4) If the conditions aforesaid have not been complied with on the expiration of forty days after the first issue of the prospectus, all money received from applicants for shares shall be forthwith repaid to them 54 without interest, and, if any such money is not so repaid within forty- eight days after the issue of the prospectus, the directors of the company shall be jointly and severally liable to repay that money with interest at the rate of five per cent per annum from the expiration of the forty-eighth day: Provided that a director shall not be liable if he proves that the default in the repayment of the money was not due to any misconduct or negligence on his part. (5) Any condition requiring or binding any applicant for shares to waive compliance with any requirement of this section shall be void. (6) This section, except subsection (3), shall not apply to any allotment of shares subsequent to the first allotment of shares offered to the public for subscription. Subscription for registration and payment of share capital. 10 of 70(I) of 2003."
}