{
  "article_number": "47A",
  "title": "Subscription for registration and payment of share capital",
  "content": "47A.(1) Shares of a public company shall only be allotted only in return for contribution of assets which can be given an economic value, which have already been valued in accordance with section 47B. Undertakings of obligations, which relate to execution of activities or the provision of services, are not considered as assets which can be given an economic value. (2) Without prejudice to the generality of the prohibition of subsection (1), the allotment of shares without any contribution is permitted to employees of the company. (3) (a) A public company cannot acquire its own shares which are offered for subscription. If the shares of a company have been subscribed for by a person acting in his own name, but on behalf of the company, the subscriber shall be deemed to have subscribed for them for his own account. (b)The signatories of the memorandum or, in the case of increase of the subscribed capital, the directors shall be obliged to pay off personally the shares which, in contravention of paragraph (a), the former, stated in the memorandum or the latter stated to the secretary, were to be acquired by the company. (4) Shares of a public company issued for a consideration of a cash contribution or cash securities, must be paid off at the time of incorporation of the company but at the latest by the date of issuance of the certificate provided for in subsection(4) of section 104, as this subsection has been renumbered by section 24 of this Law: Provided that the above restriction shall not apply to groups aiming at promoting the participation of its employees in the capital of the business. (5) Shares issued for a contribution in kind must- 55 2(a) of 64(I) of 2012. 2(b) of 64(I) of 2012. (a) have been issued to the level of the sum determined in accordance with section 47B: Provided that where the increase in subscribed capital is made in order to give effect to a merger or a division, for which an independent expert’s report-valuation has been drawn-up, or a public offer for the purchase or exchange of shares for the compensation of the shareholders of the company which is being absorbed or divided or which is the object of the public offer for the purchase or exchange of shares, the valuation of the value of the contributions in kind as provided for by section 47B shall not be necessary, and (b) be paid off in whole within five years from the date of the issuance of the certificate provided for in subsection (4) of section 104, as this subsection has been renumbered by section 24 of this Law. Contributions in kind: Methods of valuation and cases where such valuation is not necessary. 10 of 70(I) of 2003 3 of 87(I) of 2008."
}