{
  "article_number": "47B",
  "title": "Contributions in kind: Methods of valuation and cases where such valuation is",
  "content": "47B.- (1) It is obligatory for the valuation of the contributions in kind to be done by a report, which is drafted before the incorporation of the company or, at the time of the issuance of the certificate provided for in subsection (4) of section 104, as this subsection has been renumbered by section 24 of this Law, by one or more independent experts , which have been recognized by the Registrar as qualified to act for the purposes of this section, as prescribed by Regulations, and who is or are appointed by the company. The experts may be natural or legal persons. (2) The report mentioned in subsection (1) must - (a) include the description of each contribution and the adopted methods of its calculation, (b) determine whether the value which results corresponds at least to the nominal value of the shares and to the possible additional amount paid for shares issued at premium in return for the contributions. (3) The report mentioned in subsection (1) shall be published in accordance with section 365A. (4) The valuation provided for in subsection (1) shall not be required when: (a) ninety per cent of the nominal value of all the shares under valuation has been undertaken by one or more companies and (b) the following conditions are additionally fulfilled: (i) with regard to the company in receipt of such contribution, the signatories to the memorandum have in writing waived the drafting of a report by experts, 56 (ii) the waiver has been communicated to the registrar of companies and has been published in accordance with section 365A, (iii) the contributing companies- (a) have reserves, which the Law or the articles do not allow to be distributed, and the amount of which is at least equal to the nominal value of the shares which were issued for the contribution in kind, 2 of 70(I) of 2007. (b) guarantee, up to an amount equal to the debts of the recipient company arising between the time the shares are issued for a contribution in kind and one year after the publication of that company’s annual accounts for the financial year during which such contributions were furnished. No transfer of shares is allowed during this period. The above guarantee must have been notified to the registrar of companies and have been published pursuant to section 365A; and 3 of 64(I) of 2012. (c) capitalize an amount equal to the nominal value of the shares issued for the contribution in kind, depositing it in the reserves. Its distribution is possible only after three years from the publication of the annual accounts of the recipient company for the financial year during which such contributions were made or if necessary, until such later date as all claims relating to the guarantee referred to in subparagraphs (b) which are submitted during this period have been settled. (5) This section shall not apply in the event of the formation of a new company by way of merger or division provided that an independent expert’s report-valuation on the draft terms of merger or division has been drawn up. Acquisition of assets where incorporation has been completed. 10 of 70 (I) of 2003 3 of 70(I) of 2007 7 of 99(I) of 2009."
}