{
  "article_number": "47D",
  "title": "Non-application of section 47B subject to requirements.",
  "content": "47D.- (1) (a) The provisions of section 47B shall not apply in cases where, after a resolution of the board of directors of the public company, transferable securities or money-market instruments are contributed as consideration in kind and such transferable securities or money-market instruments are evaluated on the basis of the average -weighted- price at which they have been traded on one or more regulated markets, for a minimum time period of three months, preceding the effective date of the contribution of the respective consideration. (b) In cases where the average -weighted- price has been affected by exceptional circumstances that would significantly change the value of the assets at the effective date of their contribution, amongst others, in cases where the market of such transferable securities or money-market instruments has become illiquid, a revaluation shall be carried out on the initiative and responsibility of the board of directors of the public company. For the purposes of the above-mentioned revaluation the provisions of section 47B shall apply. (c) For the purposes of the provisions of this subsection, the terms “transferable securities”, “money-market instruments” and “regulated market” shall have the meaning assigned to them by subsection (1) of section 2 of the Investment Services and Activities and Regulated Markets Laws, 2007and 2009. (2) (a) The provisions of section 47B shall not apply in cases where, after a resolution of the board of directors of the public company, assets other than the transferable securities or money-market instruments mentioned in subsection (1) are contributed as consideration in kind which have already been subject to a fair value by a recognised independent expert and when the following conditions are met: (i) the fair value has been determined for a date not more than six months before the effective date of the asset contribution; (ii) the valuation has been performed in accordance with generally accepted valuation standards and principles of valuation which are applicable in the Republic to the kind of assets to be contributed; (b) When new circumstances, that would significantly change the fair value of the assets at the effective date of their contribution, occur, a revaluation shall be carried out on the initiative and responsibility of the 58 Official Journal of EU: L157, 9.6.2006, p.87. board of directors of the public company. For the purposes of such revaluation the provisions of section 47B shall apply. (c) In case of absence of the revaluation referred to in paragraph (b), one or more shareholders who hold an aggregate percentage of at least 5% of the subscribed capital of the public company on the date when a resolution is taken for the increase of capital, may demand a valuation by an independent expert, in which case the provisions of section 47B shall apply. The said shareholder or shareholders can submit such demand until the effective date of the contribution in kind, on condition that, on the date of submission of the demand, the said shareholder or shareholders shall still hold a total percentage of at least 5%of the subscribed capital of the public company, as it was on the day the resolution on the increase in the capital was taken. (3) The provisions of section 47B shall not apply, when after a resolution of the board of directors of the public company, the contribution in kind constitutes of assets, other than the transferable securities and the money-market instruments mentioned in subsection (1), the fair value of which arises, for each separate asset, from the statutory accounts of the previous financial year, provided that the statutory accounts have been subject to an audit according to the provisions of Directive 2006/43/EC of the European Parliament and of the Council of 17 May 2006, on statutory audits of annual accounts and consolidated accounts, amending Council Directives 78/660/EEC and 83/349/EEC and repealing Council Directive 84/253/EEC. (4) If any director of the company knowingly contravenes or authorises the contravention of any provisions of this section, he shall be responsible to compensate the company or the person to whom the contribution was made for any loss, damages or expenses which the company or the person to whom the contribution was made may have suffered or sustained by it: Provided that the procedure for retrieval of any such loss, damage or expenses does not arise after the expiration of two years from the date on which the contribution was made. Liability for publicity in case of application of section 47D. 5 of 87 (I) of 2008."
}