{
  "article_number": "47E",
  "title": "Liability for publicity in case of application of section 47D.",
  "content": "47E.-(1) Where the shares of a public company are contributed as consideration in kind as defined in section 47D without an expert’s report as provided in section 47B having been submitted, in addition to the requirements of section 118 and within one month after the effective date of contribution of assets, a statement shall be published in the Official Gazette of the Republic, in accordance with section 365A, which shall contain the following: (a) a description of the relevant contribution in kind; (b) the value of the contribution in kind, the source of the valuation and if required, the method of valuation; (c) a statement whether the value arrived at corresponds at least to 59 the number, to the nominal value or, in case of lack of nominal value, the accountable par and, where appropriate, to the premium on the shares to be issued for such consideration ; and (d) a statement that no new qualifying circumstances in relation to the original valuation, have occurred. (2) When a contribution in kind is proposed, without an expert’s report as provided in section 47B having been submitted, in relation to an increase of capital proposed within the context of section 62, an announcement containing the date on which the resolution on the increase of capital was passed and the information listed in subsection (1) shall be published, according to the manner stated in section 365A, before the contribution in kind is realised. In this case, the declaration pursuant to subsection (1) shall be limited to the statement that no new qualifying circumstances have occurred since the publication of the aforementioned announcement. (3) If any director of the company knowingly contravenes or authorises the contravention of any provisions of this section, he shall be liable to compensate the company or the person to whom the contribution was made for any loss, damages or expenses which the company or the person to whom the contribution was made may have suffered or sustained by it: Provided that the procedure for retrieval of any such loss, damages or expenses shall not be raised after the lapse of two years from the date on which the contribution was made. Prohibition of allotment in certain cases unless statement in lieu of prospectus delivered to registrar. Fifth Schedule."
}