{
  "article_number": "48",
  "title": "Prohibition of allotment in certain cases unless statement in lieu of prospectus",
  "content": "48.-(1) A company having a share capital which does not issue a prospectus on or with reference to its formation, or which has issued such a prospectus but has not proceeded to allot any of the shares offered to the public for subscription, shall not allot any of its shares or debentures unless at least three days before the first allotment of either shares or debentures there has been delivered to the registrar of companies for registration a statement in lieu of prospectus signed by every person who is named therein as a director or a proposed director of the company or by his agent authorized in writing, in the form and containing the particulars set out in Part I of the Fifth Schedule and, in the cases mentioned in Part II of that Schedule, setting out the reports specified therein, and the said Parts I and II shall have effect subject to the provisions contained in Part III of that Schedule. Fifth Schedule. (2) Every statement in lieu of prospectus delivered under subsection (1) shall, where the persons making any such report as aforesaid have made therein or have, without giving the reasons, indicated therein any such adjustments as are mentioned in paragraph 5 of the said Fifth Schedule, have endorsed thereon or attached thereto a written state- ment signed by those persons setting out the adjustments and giving the reasons therefore. (3) This section shall not apply to a private company. 60 4 of 166 of 1987. (4) If a company acts in contravention of subsection (1) or (2), the company and every director of the company who knowingly and wilfully authorizes or permits the contravention shall be liable to a fine not exceeding eight hundred fifty-four euros. 3 of 166 of 1987. (5) Where a statement in lieu of prospectus delivered to the registrar of companies under subsection (1) includes any untrue statement, any person who authorized the delivery of the statement in lieu of prospectus for registration shall be liable on conviction to imprisonment not exceeding two years or to a fine not exceeding two thousand, five hundred and sixty-two euros, or to both such imprisonment and fine unless he proves either that the untrue statement was immaterial or that he had reasonable ground to believe and did up to the time of delivery for registration of the statement in lieu of prospectus believe that the untrue statement was true. (6) For the purposes of this section- (a) a statement included in a statement in lieu of prospectus shall be deemed to be untrue if it is misleading in the form and context in which it is included; and (b) a statement shall be deemed to be included in a statement in lieu of prospectus if it is contained therein or in any report or memorandum appearing on the face thereof or by reference incorporated therein. Effect of irregular allotment."
}