{
  "article_number": "50",
  "title": "Applications for and allotment of, shares and debentures.",
  "content": "50.-(1) No allotment shall be made of any shares in or debentures of a company in pursuance of a prospectus issued generally and no proceedings shall be taken on applications made in pursuance of a prospectus so issued, until the beginning of the third day after that on 61 which the prospectus is first so issued or such later time (if any) as may be specified in the prospectus. The beginning of the said third day or such later time as aforesaid is hereafter in this Law referred to as “the time of the opening of the subscription lists”. (2) In subsection (1) the reference to the day on which the prospectus is first issued generally shall be construed as referring to the day on which it is first so issued as a newspaper advertisement: Provided that, if it is not so issued as a newspaper advertisement before the third day after that on which it is first so issued in any other manner, the said reference shall be construed as referring to the day on which it is first so issued in any manner. 4 of 186 of 1987. (3) The validity of an allotment shall not be affected by any contravention of the foregoing provisions of this section but, in the event of any such contravention, the company and every officer of the company who is in default shall be liable to a fine not exceeding one thousand, seven hundred and eight euros. (4) In the application of this section to a prospectus offering shares or debentures for sale, the foregoing subsections shall have effect with the substitution of references to sale for references to allotment, and with the substitution for the reference to the company and every officer of the company who is in default of a reference to any person by or through whom the offer is made and who knowingly and wilfully authorizes or permits the contravention. (5) An application for shares in or debentures of a company which is made in pursuance of a prospectus issued generally shall not be revocable until after the expiration of the third day after the time of the opening of the subscription lists, or the giving before the expiration of the said third day, by some person responsible under section 43 for the prospectus, of a public notice having the effect under that section of excluding or limiting the responsibility of the person giving it. (6) In reckoning for the purposes of this section the third day after another day, any intervening day which is a Saturday or Sunday or which is a bank holiday shall be disregarded, and if the third day, as so reckoned, is itself a Saturday or Sunday or such a bank holiday there shall for the said purposes be substituted the first day thereafter which is none of them. Return as to allotments."
}