{
  "article_number": "51",
  "title": "Return as to allotments.",
  "content": "51.-(1) Whenever a company limited by shares or a company limited by guarantee and having a share capital makes any allotment of its shares, the company shall within one month thereafter deliver to the registrar of companies for registration- (a) a return of the allotments, stating the number and nominal amount of the shares comprised in the allotment, the names, addresses and 62 descriptions of the allottees, and the amount, if any, paid or due and payable on each share; and (b) in the case of shares allotted as fully or partly paid up otherwise than in cash, a contract in writing constituting the title of the allottee to the allotment together with any contract of sale, or for services or other consideration in respect of which that allotment was made, such con- tracts being duly stamped, and a return stating the number and nominal amount of shares so allotted, the extent to which they are to be treated as paid up, and the consideration for which they have been allotted. (2) Where such a contract as above mentioned is not reduced to writing, the company shall within one month after the allotment deliver to the registrar of companies for registration the prescribed particulars of the contract stamped with the same stamp duty as would have been payable if the contract had been reduced to writing. 4 of 166 of 1987. (3) If default is made in complying with this section, every officer of the company who is in default shall be liable to a fine not exceeding four hundred twenty-seven euros for every day during which the default continues: Provided that, in case of default in delivering to the registrar of companies within one month after the allotment any document required to be delivered by this section, the company, or any officer liable for the default, may apply to the Court for relief, and the Court, if satisfied that the omission to deliver the document was accidental or due to inadvertence or that it is just and equitable to grant relief, may make an order extending the time for the delivery of the document for such period as the Court may think proper. Commissions and Discounts, etc. Power to pay certain commissions, and prohibition of payment of all other commissions, discounts, etc."
}