{
  "article_number": "53",
  "title": "Prohibition of provision of financial assistance by company for purchase of or",
  "content": "53.-(1) Subject as provided in this section and subject to the provisions of sections 57A to 57 F, it shall not be lawful for a company to give, whether directly or indirectly, and whether by means of a loan, guarantee, the provision of security or otherwise, any financial assistance for the purpose of or in connection with a purchase or subscription made or to be made by any person of or for any shares in the company, or, where the company is a subsidiary company, in its holding company: Provided that nothing in this section shall be taken to prohibit- (a) where the lending of money is part of the ordinary business of a company, the lending of money by the company in the ordinary course 64 of its business; (b) the provision by a company, in accordance with any scheme for the time being in force, of money for the purchase of, or subscription for, fully paid shares in the company or its holding company, being a purchase or subscription by trustees of or for shares to be held by or for the benefit of employees of the company, including any director holding a salaried employment or office in the company; (c) the making by a company of loans to persons, other than directors, bona fide in the employment of the company with a view to enabling those persons to purchase or subscribe for fully paid shares in the company or its holding company to be held by themselves by way of beneficial ownership. 4 of 166 of 1987. (2) If a company acts in contravention of this section, the company and every officer of the company who is in default shall be liable to a fine not exceeding eight hundred fifty-four euros. 8 of 99(I) of 2009. (3) In the case of a private company, the prohibition in subsection (1) shall not apply if- (a) the private company is not a subsidiary of any company which is a public company, and (b) the relevant action has been approved at any time, with a resolution of the general meeting which has been passed by a majority exceeding ninety per cent of all issued shares of the company: Provided that, the exception of this subsection shall not affect the obligation to comply with any other section of this Law or with any other law. Construction of References to offering Shares or Debentures to the Public Construction of references to offering shares or debentures to the public."
}