{
  "article_number": "57",
  "title": "Power to issue redeemable preference shares.",
  "content": "57.-(1) Subject to the provisions of this section, a company limited by shares may, if so authorized by its articles, issue preference shares which are, or at the option of the company or of the shareholder are to be liable, to be redeemed: Provided that- (a) no such shares shall be redeemed except out of profits of the company which would otherwise be available for dividend or out of the proceeds of a fresh issue of shares made for the purposes of the redemption; (b) no such shares shall be redeemed unless they are fully paid; (c) the premium, if any, payable on redemption, must have been provided for out of the profits of the company or out of the company's share premium account before the shares are redeemed; (d) where any such shares are redeemed otherwise than out of the proceeds of a fresh issue, there shall out of profits which would otherwise have been available for dividend be transferred to a reserve fund, to be called \"the capital redemption reserve fund\", a sum equal to the nominal amount of the shares redeemed, and the provisions of this Law relating to the reduction of the share capital of a company shall, except as provided in this section, apply as if the capital redemption reserve fund were paid-up share capital of the company. (2) Subject to the provisions of this section, the redemption of preference shares thereunder may be effected on such terms and in such manner as may be provided by the articles of the company. 67 (3) The redemption of preference shares under this section by a company shall not be taken as reducing the amount of the company's authorized share capital. (4) Where in pursuance of this section a company has redeemed or is about to redeem any preference shares, it shall have power to issue shares up to the nominal amount of the shares redeemed or to be redeemed as if those shares had never been issued, and accordingly the share capital of the company shall not for the purposes of any enactments relating to stamp duty be deemed to be increased by the issue of shares in pursuance of this subsection: Provided that, where new shares are issued before the redemption of the old shares, the new shares shall not, so far as relates to stamp duty, be deemed to have been issued in pursuance of this subsection unless the old shares are redeemed within one month after the issue of the new shares. (5) The capital redemption reserve fund may, notwithstanding anything in this section, be applied by the company in paying up unissued shares of the company to be issued to members of the company as fully paid bonus shares. 13 of 70 (I) of 2003. (6) The redemption shall be published in accordance with section 365A. Right of a company to purchase or acquire its own shares. 116 (I) of 2005. 2 of 135(I)/2000 14(a) of 70 (I) of 2003 6(a) of 87 (I) of 2008."
}