{
  "article_number": "57A",
  "title": "Right of the company to  purchase or acquire its own shares.",
  "content": "57A. (1) Without prejudice to the provisions of subsection (3) of section 47A and subject to the provisions of the Activities of Persons Holding Insider Information and Activities of Market Manipulation (Market Abuse) Law, as well as the principle of equal treatment of all shareholders holding the same position, a public company may acquire its own shares either directly, or through a person acting on his own name but on behalf of the company, provided that this is enabled by its articles and provided that the following provisions are satisfied: (a) The company has approved by special resolution in general meeting the grant of authorization to its board of directors for acquisition of its own shares within a time period of twelve months from the date that the decision is taken and has determined the terms and the manner of their acquisition and particularly the maximum number of shares that may be acquired, the period for which the company may own same, which may not exceed two years and, in case there is an intention to acquire them in exchange for monetary consideration, the minimum and maximum price of their acquisition, which, in case of a company the shares of which are listed on the Stock Exchange, shall not exceed by more than five per cent (5%) the average market price of the share of the company during the last five Stock Exchange sessions before 68 carrying out the relevant acquisition: Provided that the directors and managers of the company shall have an obligation to ensure compliance with the conditions referred to in paragraphs (b), (c) and (d) below. (b) The total of the nominal value of shares of a company itself acquired by the company, including the shares which the company already owns and maintains in a portfolio and the shares which a person acting in his name but who acquired same on behalf of the relevant company, may not, at any time, exceed ten per cent (10%) of the subscribed capital or twenty- five per cent (25%) of the average value of the transactions, which, in case of a company the shares of which are listed on the Stock Exchange, were negotiated during the last thirty days, whichever of those amounts is smaller. Provided that this shall not affect the obligation of a company the shares of which are listed on the Stock Exchange to abide by the provisions of Regulation 61(Z) of the Stock Exchange Regulations regarding the dispersion of capital. (c) The monetary consideration payable for the acquisition by a company of its own shares shall be paid out of the realized and non-distributed profits. 14(b) of 70(I) of 2003 6(b) of 87(I) of 2008. (d) The acquisition of its own shares, including own shares which the company had previously acquired and keeps in a portfolio and the acquisition of shares of the same company which were acquired by a person acting in his own name, but on the company’s behalf, should not result in the reduction of the net assets below the amount prescribed by subsection (1) of section 169A. 14(c) of 70(I) of 2003 6(c) of 87(I) of 2008. (e) The company can only acquire its own shares which have been fully paid up. 14(c) of 70(I) of 2003. (f) In case of a company the shares of which are listed on the Stock Exchange, the intention of the board of directors of the company to take a decision for the convening of a general meeting, for the ultimate purpose of taking a decision for the acquisition by the company of its own shares, in support of their price in cases where it is considered that the said price is substantially lower than the price which corresponds to the market conditions and to the financial situation and prospects of the company is notified immediately to the Board of the Stock Exchange and the Cyprus Securities and Exchange Commission: Provided that the relevant resolution of the general meeting shall be notified to the Board of the Stock Exchange and the 69 Cyprus Securities and Exchange Commission before the commencement of the Stock Exchange sessions which follows the relevant resolution. 14(c) of 70(I) of 2003. (g) The resolution of the general meeting for the acquisition by the company of its own shares shall be published at least ten days before the commencement of the relevant acquisition, in at least two daily newspapers of wide circulation and the relevant publication must include the basic terms of the transaction and specify the time period during which the company intends to proceed with the acquisitions: Provided that the relevant publication must be repeated every time the company implements the decision of the general meeting for the acquisition of its own shares. 14(c) of 70(I) of 2003. (h) The board of directors of the company shall have an obligation to prepare forthwith a list of the shareholders from whom the relevant shares were acquired, and such list shall be notified, in case of a company the shares of which are listed on the Stock Exchange, to the Cyprus Securities and Exchange Commission and the Board of the Stock Exchange and shall be communicated to the shareholders at the first general meeting that follows the period of acquisition: Provided that the board of directors of the company, in carrying out the above announcement, duly substantiates its decision for the acquisition of its own shares from the company, proving- (a) The diminishing tendency of the price of the share at the time of the acquisition, and (b) by producing an auditors` certificate that this price is substantially lower than the price that corresponds to the actual value of the relevant share. 14(c) of 70(I) of 2003. (i) The act by which the acquisition by a company of its own shares is concluded shall be notified to the Registrar of Companies and Official Receiver within fourteen days with a statement by the company itself, signed by one director and its secretary, and is liable to a fee, in accordance with the provisions of this Law for the time being in force. 6(d) of 87(I) of 2008. (j) The acquisition by the company of its own shares shall not affect the satisfaction of the claims of its creditors. (2) In case the acquisition by a company of its own shares becomes urgently necessary, in order to avoid imminent serious damage to the company, such as, inter alia, the decline of the market price of the share below its actual value, as determined by the certified auditors, the company may proceed with an acquisition of its own shares without the prior approval of the general meeting, provided that its board of directors will inform the shareholders of the company, at an 70 extraordinary general meeting, which must be convened within two months at the latest from the date that the relevant resolution is taken, of the reasons for which the particular acquisition or purchase of the relevant shares took place, the number and nominal value of the shares acquired, the part of the issued and fully paid-up capital they represent and of the value of the said shares: Provided that in case of a company listed in the Stock Exchange, the resolution of the Board of Directors shall be notified, duly reasoned, to the Board of the Stock Exchange and the Cyprus Securities and Exchange Commission within two days from the taking of the said resolution. Exemptions. 2 of 135(I) of 2000."
}