{
  "article_number": "57B",
  "title": "Exemptions.",
  "content": "57B.-(1) Acts by which the company acquires its own shares, shall be exempt from the provisions of section 57A, provided that: (a) The shares were acquired in carrying out a decision to reduce capital on the basis of the relevant provisions of this Law or in case those were acquired on the basis of section 57 of this Law, (b) The shares were acquired after a complete transfer of all the assets of the company, (c) The shares were acquired free of charge and have been fully paid-up or have been acquired by banks or other credit institutions as purchasing commission, (d) The shares were acquired by virtue of a legal obligation, resulting from a court judgment, for the purpose of protecting the minority shareholders in case of a merger, change of object or the type of the company, transfer abroad of its registered office or the imposition of restrictions on the transfer of its shares, (e) The shares were acquired from a shareholder, if the latter has not paid them up, (f) The shares were acquired in order to indemnify minority shareholders in associated companies, (g) The shares have been fully paid-up and acquired by auction following compulsory execution which had the purpose of satisfying a claim of the company against the owner of the relevant shares. (2) A company that acquires shares in the cases mentioned in sub- paragraphs (b) to (f) of paragraph (1) of this section proceeds with their transfer within a time limit of three years at the latest from the time of their acquisition, except if the nominal value of the shares which have been acquired in this way, including the shares that the company has acquired from a person acting in his name, but on the company’s 71 behalf, does not exceed ten per cent (10%) of the subscribed capital. (3) In case the shares in question have not been transferred within the time-limit specified in paragraph (2) above, these are cancelled by reducing the subscribed capital by the corresponding amount: 7 of 87(I) of 2008. Provided that this reduction is necessary to the extent that the acquisition of the shares which must be cancelled had the result of reducing the net assets of the company to an amount lower than that of the subscribed capital, increased by the stock of which this Law does not allow distribution. The amount of the aforementioned subscribed share capital shall be reduced by the amount of the share capital that has been covered, but has not yet been contributed when the former does not appear in the balance sheet. Obligation of company to transfer shares acquired in contravention of this Law. 2 of 135(I) of 2000."
}