{
  "article_number": "57F",
  "title": "Subscription, acquisition or holding shares through subsidiary.",
  "content": "57F.- (1) The subscription, acquisition or holding of shares of a public company (in this section called the “first company”) by another limited liability company, local or overseas (in this section called the “other company”), which other company is a subsidiary of the first, shall, for the purposes of sections 57A to 57E, be considered to have been carried out by the first company. (2) When the subscription, acquisition or holding of the shares through the other company has been carried out under the circumstances mentioned in subsection (1) of section 57B, the provisions of subsections (2) and (3) of section 57B and section 57C shall not apply, but the following will apply: (a) The voting rights attached to the shares of the first company, which are held by the other company shall be suspended, and (b) the directors of the first company are obliged to acquire from the other company the shares mentioned in subsections (2) and (3) of section 57B and section 57C at the price at which this other company had acquired them, unless the said directors prove that the first company had no involvement in the subscription or acquisition of the said shares. (3) This section shall not apply where the said subscription, acquisition or holding is made- (a) On behalf of a person other than the person subscribing, acquiring or holding the shares and provided this person is neither the first company nor the other company, (b) by the other company acting as a professional dealer in securities and in its capacity as such, provided that it is a member of a stock exchange situated or operating in the Republic or in a member state of the European Union, or that has obtained a licence to operate or is under the supervision of 73 an authority of the Republic or a member state of the European Union, being the competent authority for the supervision of professionals dealing in securities. Miscellaneous Provisions as to Share Capital Power of company to arrange for different amounts being paid on shares."
}