{
  "article_number": "60B",
  "title": "Principle of preferring the existing shareholders during the increase of the share",
  "content": "60B.- (1) On the increase of the share capital of a public company by considerations in cash, the shares must be offered on a pre-emptive basis to shareholders in proportion to the percentage of the capital represented by their shares: Provided that, the right of pre-emption may not be excluded, when, in accordance with the decision for the increase of the share capital, the share issuance is made in favour of banks or other credit institutions, with a purpose of offering them thereafter to the shareholders of the company in accordance with the above-mentioned. (2) Shares to which a restricted right of participation in the distributions in the meaning of section 169A and/or in the distribution of the company assets in the case of liquidation is attached, shall not have a right of pre-emption. (3) When the company has different classes of shares, in which the right to vote or the right to participate in the distributions within the meaning of section 169A and/or in the distribution of the company’s assets in the case of liquidation are different between them, and the share capital is to be increased by the issuance of new shares of only one class of such classes, the memorandum or articles may allow the exercise of a right of pre-emption by the shareholders of the other classes only after the exercise of such right by the shareholders of the class from which the new shares are being issued. (4) (a) The offer for subscription on a pre-emptive basis, as well as the period, within which such right must be exercised, shall be published in accordance with section 365A: Provided that no publication shall be required when all the shares of the company are nominal, in which case all shareholders must be notified in writing. 76 (b) The pre-emption right must be exercised within a period which shall not be less than fourteen days from the notification of the offer or the sending out of the letters to the shareholders. (5) The pre-emption right may not be restricted or excluded from the articles, unless by way of a resolution of the general meeting. The directors shall have an obligation to present to the general meeting a written report which shall state the reasons for restriction or exclusion of the right of pre-emption and shall justify the proposed issue price. The general meeting shall decide in accordance with the regulations set out in section 59A. The decision thereof shall be published pursuant to section 365A. (6) Subsections (1) to (5) shall apply to the issuance of all securities which are convertible into shares or are accompanied by a right to undertake shares, but not to the conversion of the securities nor to the exercise of the right to subscribe. Notice to registrar of consolidation of share capital, conversion of shares into stock, etc."
}