{
  "article_number": "64",
  "title": "Special resolution for reduction of share capital.",
  "content": "64.-(1) Subject to confirmation by the Court, a company limited by shares or a company limited by guarantee and having a share capital may, if so authorized by its articles, by special resolution notified to the registrar of companies and published pursuant to section 365A reduce its share capital in any way, and in particular, without prejudice to the generality of the foregoing power, may- (a) extinguish or reduce the liability on any of its shares in respect of share capital not paid up; or (b) either with or without extinguishing or reducing liability on any of its shares, cancel any paid-up share capital which is lost or unrepresented by available assets; or 2(a) of 198(I) of 2011. (c) either with or without extinguishing or reducing liability on any of its shares, pay off any paid-up share capital which is in excess of the wants of the company; or 2(b) of 198(I) of 2011. (d) cancel paid up share capital for the purpose of writing off losses of the company; or 2(b) of 198(I) of 2011. (e) cancel paid up share capital by the creation of a reserve, to be called “the capital reduction reserve fund” which will be subject to the same treatment as the share premium account as prescribed in section 55, the provisions of which shall apply in this respect, and may, if so far as is necessary, alter its memorandum by reducing the amount of its share capital and of its shares accordingly. (2) A special resolution under this section is in this Law referred to as a “resolution for reducing share capital”. 21 of 70(I) of 2003. (3) In the case of a public company the subscribed capital may not be reduced to an amount below the minimum capital provided for in section 4A, unless the decision for the reduction simultaneously provides for an increase of the capital to an amount at least equal to the prescribed minimum. Application to Court for confirming order, objections by creditors, and settlement of list of"
}