{
  "article_number": "65",
  "title": "Application to Court for confirming order, objections by creditors and settlement of",
  "content": "65.- (1) Where a company has passed a resolution for reducing share capital, it may apply to the Court for an order confirming the reduction. (2) Where the proposed reduction of share capital involves either diminution of liability in respect of unpaid share capital or the payment to any shareholder of any paid-up share capital, and in any other case 79 objecting creditors. if the Court so directs, the following provisions shall have effect, subject nevertheless to subsection (3):- 9 of 87(I) of 2008. (a) every creditor of the company who at the date fixed by the Court is entitled to any debt or claim which, if that date were the commence- ment of the winding up of the company, would be admissible in proof against the company, and who can prove that there is a reasonable chance that the proposed reduction of the share capital will endanger the repayment of the debt or the satisfaction of his claim from the company, and that there are no sufficient guarantees in place by the company, shall be entitled to object to the reduction; (b) the Court shall settle a list of creditors so entitled to object, and for that purpose shall ascertain, as far as possible without requiring an application from any creditor, the names of those creditors and the nature and amount of their debts or claims, and may publish notices fixing a day or days within which creditors not entered on the list are to claim to be so entered or are to be excluded from the right of objecting to the reduction; (c) where a creditor entered on the list whose debt or claim is not discharged or has not determined does not consent to the reduction, the Court may, if it thinks fit, dispense with the consent of that creditor, on the company securing payment of his debt or claim by appropriating, as the Court may direct, the following amount:- (i) if the company admits the full amount of the debt or claim, or, though not admitting it, is willing to provide for it, then the full amount of the debt or claim; (ii) if the company does not admit and is not willing to provide for the full amount of the debt or claim, or if the amount is contingent or not ascertained, then an amount fixed by the Court after the like inquiry and adjudication as if the company were being wound up by the Court. (3) Where a proposed reduction of share capital involves either the diminution of any liability in respect of unpaid share capital or the payment to any shareholder of any paid-up share capital, the Court may, if, having regard to any special circumstances of the case, it thinks proper so to do, direct that subsection (2) shall not apply as regards any class or any classes of creditors. Order confirming reduction and powers of Court on making such order."
}