{
  "article_number": "70",
  "title": "Rights of holders of special classes of shares.",
  "content": "70.-(1) If, in the case of a company the share capital of which is divided into different classes of shares, provision is made by the memorandum or articles for authorizing the variation of the rights attached to any class of shares in the company, subject to the consent of any specified proportion 82 shares. of the holders of the issued shares of that class or the sanction of a resolution passed at a separate meeting of the holders of those shares, and in pursuance of the said provision the rights attached to any such class of shares are at any time varied, the holders of not less in the aggregate than fifteen per cent of the issued shares of that class, being persons who did not consent to or vote in favour of the resolution for the variation, may apply to the Court to have the variation cancelled, and, where any such application is made, the variation shall not have effect unless and until it is confirmed by the Court. (2) An application under this section must be made within twenty-one days after the date on which the consent was given or the resolution was passed, as the case may be, and may be made on behalf of the shareholders entitled to make the application by such one or more of their number as they may appoint in writing for the purpose. (3) On any such application the Court, after hearing the applicant and any other persons who apply to the Court to be heard and appear to the Court to be interested in the application, may, if it is satisfied, having regard to all the circumstances of the case, that the variation would unfairly prejudice the shareholder of the class represented by the applicant, disallow the variation and shall, if not so satisfied, confirm the variation. (4) The decision of the Court on any such application shall be final. (5) The company shall within fifteen days after the making of an order by the Court on any such application forward a copy of the order to the registrar of companies, and, if default is made in complying with this provision, the company and every officer of the company who is in default shall be liable to a default fine. (6) The expression \"variation\" in this section includes abrogation and the expression \"varied\" shall be construed accordingly. Transfer of Shares and Debentures, Evidence of Title, etc. Nature of shares."
}