{
  "article_number": "84",
  "title": "Rights of inspection of register of debenture holders and to copies of register and",
  "content": "84.-(1) Every register of holders of debentures of a company shall, except when duly closed (but subject to such reasonable restrictions as the company may in general meeting impose, so that not less than two hours in each day shall be allowed for inspection), be open to the inspec- tion of the registered holder of any such debentures or any holder of shares in the company without fee, and of any other person on payment of a fee of 0,0854 euros or such less sum as may be prescribed by the company. 86 (2) Any such registered holder of debentures or holder of shares as aforesaid or any other person may require a copy of the register of the holders of debentures of the company or any part thereof on payment of 0,0427 euros for every hundred words required to be copied. (3) A copy of any trust deed for securing any issue of debentures shall be forwarded to every holder of any such debentures at his request on payment in the case of a printed trust deed of the sum of 0,0854 euros or such less sum as may be prescribed by the company, or where the trust deed has not been printed, on payment of 0,0427 euros for every hundred words required to be copied. 4 of 166 of 1987. 4 of 166 of 1987. (4) If inspection is refused, or a copy is refused or not forwarded, the company and every officer of the company who is in default shall be liable to a fine not exceeding forty-two euros, and further shall be liable to a default fine of forty-two euros. (5) Where a company is in default as aforesaid, the Court may by order compel an immediate inspection of the register or direct that the copies required shall be sent to the person requiring them. (6) For the purposes of this section, a register shall be deemed to be duly closed if closed in accordance with provisions contained in the articles or in the debentures or, in the case of debenture stock, in the stock certificates, or in the trust deed or other document securing the debentures or debenture stock, during such period or periods, not exceeding in the whole thirty days in any year, as may be therein specified. Liability of trustees for debenture holders."
}