{
  "article_number": "87",
  "title": "Power to re-issue redeemed debentures in certain cases.",
  "content": "87.- (1) Where a company has redeemed any debentures previously issued, then: (a) unless any provision to the contrary, whether express or implied, is contained in the articles or in any contract entered into by the company; or (b) unless the company has, by passing a resolution to that effect or by some other act, manifested its intention that the debentures shall be cancelled, the company shall have, and shall be deemed always to have had, power to re-issue the debentures, either by re-issuing the same debentures or by issuing other debentures in their place. (2) On a re-issue of redeemed debentures the person entitled to the debentures shall have, and shall be deemed always to have had, the same priorities as if the debentures had never been redeemed. 88 (3) Where a company has deposited any of its debentures to secure advances from time to time on current account or otherwise, the debentures shall not be deemed to have been redeemed by reason only of the account of the company having ceased to be in debit whilst the debentures remained so deposited. (4) The re-issue of a debenture or the issue of another debenture in its place under the power by this section given to, or deemed to have been possessed by, a company, shall be treated as the issue of a new debenture for the purposes of stamp duty, but it shall not be so treated for the purposes of any provision limiting the amount or number of debentures to be issued: Provided that any person lending money on the security of a debenture re-issued under this section which appears to be duly stamped may give the debenture in evidence in any proceedings for enforcing his security without payment of the stamp duty or any penalty in respect thereof, unless he had notice or, but for his negligence, might have dis- covered, that the debenture was not duly stamped, but in such case the company shall be liable to pay the proper stamp duty and penalty. Specific performance of contracts to take up debentures."
}