{
  "article_number": "90",
  "title": "Registration of charges created by companies registered in the Republic.",
  "content": "90.- (1) Subject to the provisions of this Part every charge as well as every amendment, assignment or other change to it created after the fixed date by a company registered in the Republic and being a charge to which this section applies shall, so far as any security on the company's property or undertaking is conferred thereby, be void against the liquidator and any creditor of the company, unless the prescribed particulars of the charge together with the instrument, if any, duly stamped by which the charge is created or evidenced, are delivered to or received by the registrar of companies for registration in manner required by this Law within twenty one days after the date of its creation, but without prejudice to any contract or obligation for repayment of the money thereby secured, and when a charge becomes void under this section the money secured thereby shall immediately become payable. (2) This section applies to the following charges:- (a) a charge for the purpose of securing any issue of debentures; (b) a charge on uncalled share capital of the company; (c) a charge on book debts of the company; (d) a floating charge on the undertaking or property of the company; (e) a charge on calls made but not paid; (f) a charge on a ship or any share in a ship; (g) a charge on goodwill, on a patent or a licence under a patent, on a trade mark or on a copyright or a license under a copyright; (h) a charge on any other movable property created or evidenced by an instrument, where the company retains possession of such property; (i) a charge on immovable property, wherever situate, or any interest therein; 12 (b) of 99(I) of 2009. 43(I) of 2004. Provided that, the cases, to which this section shall not apply, shall include cases of- (a) pledge of shares in companies and all the rights emanating from it, (b) agreements for the provision of financial collaterals within the meaning of the Financial Collateral Arrangements Law, as may be amended and apply from time to time. 90 (3) In the case of a charge created out of the Republic comprising property situate outside the Republic, the delivery to and the receipt by the registrar of a copy verified in the prescribed manner of the instrument by which the charge is created or evidenced shall have the same effect for the purposes of this section as the delivery and receipt of the instrument itself, and twenty- one days after the date on which the instrument or copy could, in due course of post, and if despatched with due diligence, have been received in the Republic shall be substituted for twenty one days after the date of the creation of the charge as the time within which the particulars and instrument or copy are to be delivered to the registrar. (4) Where a charge is created in the Republic but comprises property outside the Republic, the instrument creating or purporting to create the charge may be sent for registration under this section notwithstanding that further proceedings may be necessary to make the charge valid or effectual according to the law of the country in which the property is situate. (5) Where a negotiable instrument has been given to secure the payment of any book debts of a company the deposit of the instrument for the purpose of securing an advance to the company shall not, for the purposes of this section, be treated as a charge on those book debts. (6) The holding of debentures entitling the holder to a charge on immovable property shall not for the purposes of this section be deemed to be an interest in immovable property. (7) Where a series of debentures containing, or giving by reference to any other instrument, any charge to the benefit of which the debenture holders of that series are entitled pari passu is created by a company, it shall, for the purposes of this section, be sufficient if there are delivered to or received by the registrar, within twenty-one days after the execution of the deed containing the charge or, if there is no such deed, after the execution of any debentures of the series, the following particulars:- (a) the total amount secured by the whole series; and (b) the dates of the resolutions authorizing the issue of the series and the date of the covering deed, if any, by which the security is created or defined; and (c) a general description of the property charged; and (d) the names of the trustees, if any, for the debenture holders, together with the deed containing the charge, or, if there is no such deed, one of the debentures of the series: Provided that, where more than one issue is made of debentures in the 91 series, there shall be sent to the registrar for entry in the register particulars of the date and amount of each issue, but an omission to do this shall not affect the validity of the debentures issued. (8) Where any commission, allowance or discount has been paid or made either directly or indirectly by a company to any person in consideration of his subscribing or agreeing to subscribe, whether absolutely or conditionally, for any debentures of the company, or procuring or agreeing to procure subscriptions, whether absolute or conditional, for any such debentures, the particulars required to be sent for registration under this section shall include particulars as to the amount or rate per cent of the commission, discount or allowance so paid or made, but omission to do this shall not affect the validity of the debentures issued: Provided that the deposit of any debentures as security for any debt of the company shall not, for the purposes of this subsection, be treated as the issue of the debentures at a discount. (9) In this Part- 2 of 53 (I) of 2011. 130 (I) of 2010. (a) the expression “charge\" does not include any mortgage of immovable property effected under any Law relating to the registration of mortgages of immovable property in force for the time being and any cover pool as from the coming into force and in accordance with the provisions of the Covered Bonds Law, as amended or substituted for the time being; (b) the expression “the fixed date” means in relation to the charges specified in paragraphs (h) and (i) of subsection (2), the 1st day of July, 1922, and in relation to the charges specified in paragraphs (a) to (g), both inclusive, of the said subsection, the date of the commencement of this Law. Duty of company with regard to charges and mortgages created by company."
}