{
  "article_number": "93",
  "title": "Register of charges to be kept by registrar of companies.",
  "content": "93.- (1) The registrar of companies shall keep, with respect to each company, a register and a record in the prescribed form of all the charges requiring registration and of all the mortgages requiring recording respectively, under this Part, and shall, on payment of such fee as may be specified by regulations made by the Council Ministers, enter in the register and record with respect to such charges and mortgages the following particulars:- (a) in the case of a charge to the benefit of which the holders of a series of debentures are entitled, such particulars as are specified in subsection (7) of section 90; (b) in the case of any mortgage- (i) the date and description of the instrument creating or 93 evidencing the mortgage; and (ii) the number and date on the certificate of mortgage; and (iii) the amount secured by the mortgage; and (iv) short particulars of the property mortgaged; and (v) the persons entitled to the mortgage; (c) in the case of any other charge- (i) if the charge is a charge created by the company, the date of its creation, and if the charge was a charge existing on property acquired by the company, the date of the acquisition of the property; and (ii) the amount secured by the charge; and (iii) short particulars of the property charged; and (iv) the persons entitled to the charge. (2) The registrar shall give a certificate under his hand of the registration of any charge registered in pursuance of this Part, stating the amount thereby secured, and the certificate shall be conclusive evidence that the requirements of this Part as to registration have been complied with. 5 of 76 of 1977. (3) The register and record kept in pursuance of this section shall be open to inspection by any person on payment of such fee, as may be specified by regulations made by the Council of Ministers. Endorsement of certificate of registration on debentures."
}